[["Let’s stick to the campaign contribution and campaign finance where you spoke about the “dark” money.  Miss Vader!!! https://www.washingtonpost.com/amphtml/politics/payments-to-corporation-owned-by-ocasio-cortez-aide-come-under-scrutiny/2019/03/05/ae5045ee-3f61-11e9-9361-301ffb5bd5e6_story.html … | Stop lying. You ARE the user of “dark money”. Broke campaign finance law by paying your chief of staff’s LLC company.  Knowing LLC companies don’t have to publish payments made to further your agendas. https://www.washingtonexaminer.com/politics/ocasio-cortezs-chief-of-staff-ran-1m-slush-fund-by-diverting-campaign-cash-to-his-own-companies?_amp=true …", "I think one thing that would help people understand the power of alternative energy sources is an interactive model of interconnected smart micro-grids that demonstrates renewable energy's ability to handle current and future electricity demands | Smart micro-grids can communicate with other local grids who can provide energy when needed to other areas. You can also have a more centralized energy source that can distribute even more energy if the case is needed. The model should also incorporate a storm chasing system | This system would be mobile and easily setup, which would allow for society to harness the surge of energy produced by various storms; there are various wind technologies that prove this possible. Having an interactive model could allow for people to explore the power of new tech", "Define rich. | That thought has crossed my mind | Are you aware who holds most stock? Retirement plans. So any additional taxes hurts employees. So, NO | Wtf is this tweet even saying? Good grief | I immediately cringe when I read that phrase", "AOC’s $15/Hr Minimum Wage For Fast Food Workers Has Plunged New York Into The Worst Recession They Have Seen In Over 20 Years\n\nThis Will Cost NYC Citizens Over 1.9M Job Positions And $61.6B In Lost Wages | BREAKING: Two PACs founded by AOC's top aide funneled $1+ million in political donations into two of his own private companies, new FEC complaint says\n\nAOC also enacted a policy for her office that allows her staff to avoid public financial disclosure laws. pic.twitter.com/7YIUul3vYC", "And there you would be wrong. | You wish it was that easy.  In 12 years it will simply become apparent how truly unwilling to change we are. | He's allowed to disagree with her while still respecting her as a person.  That's how it should work. | Cynicism is the classic refuge of the lazy and entitled. | ... but depressing  | I agree.There are no actual \"revolutionaries\" in American politics right now. There are many amazing progressives who want to use the system to make everybody's lives better. Where I come from, #AOC is what we call a \"normal politician\".  Apparently in the US she's StalinHitler. | Hey come on, all parents do what they have to for their kids.  For some, that means periodically hooking to pay for rent and groceries, for some it means breaking to law so their child will be rich and never have to work an honest day in their life. | The problem with revolutions is that revolutionaries frequently make poor politicians, and so revolutions often fail to deliver the society that they promised.", "Simple quick question. When you tear down all of these buildings to rebuild them what will become of all the rumble and particulates that demolition creates? What about the tremendous amount of CO2 that will put in the atmosphere. Please name one socialists state success. | None of your ideas will ever bring prosperity. We have 200 years of socialism proof but also all the Nordic countries are fleeing simi socialism you love as well. You’re ushering in the demise of America and millions of deaths. Thanks in advance. | Silly girl the financiers don’t own or operate. They also don’t build and have no vested ownership or interest in the property. They merely provide financing so why would they be responsible? And what the hell is building up seawalls are you freaking kidding me? | That and they like lying narratives | Let me correct the fallacy in your statement THERE IS NO MUSLIM BAN there are 51 majority Muslim countries and we banned 7 COUNTIRES with the largest number of TERRORISTS. there are 44 Muslim countries that can still travel to America.Try not to swollen the narrative whole | Why didn’t or don’t you have the same sentiments for Jews or Christians? Christians are being killed next to daily in Africa and the Middle East yet not a word of protest from you. | I’ve looked at this thread and of course it’s turned into a grand Islamic proselytizing is event  just what was wanted. | Of course this is disingenuous. If you elimination fossil fuels howcwill you fuel air plains? Retrofit all plains to be rockets and use non fossil fuel fuels? What’s that going to cost? | Per capita? There emissions are higher and on the rise while ours is declining WHILE we emit lower amounts. In fact we’re the lowest emitter of the top 10 with and economy twice the size of China yet coming in at 50% of the emissions of China https://www.google.com/amp/s/amp.theguardian.com/environment/2018/dec/05/brutal-news-global-carbon-emissions-jump-to-all-time-high-in-2018 … | Ultimate imbecile", "I'd like these topics discussed: 1) the hoax of man-made climate change; 2) how you will pay for your fantasy; 3) current status of your multiple campaign violations and embezzlement | Here we go, wait for it...Corporations are evil.\nThere, I said it. | They are criminals, they shouldn't be a burden on the rest of us.  Having them pay court costs is a small requirement.", "Together workers can protect themselves and their families! We need to #RepealTaftHartley to get the voice of workers back  | Very cool! I wonder how @TankandDaBangas feel about #RepealTaftHartley? Repeal now to help AMERICANS!!  | Not all Americans can have a happy Friday! @AOC you must lead the charge to repeal Taft-Hartley!!! |  Shut up\nWe will #repealtafthartley for all workers to give workers a voice again | If you truly want to stand strongly with working people REPEAL TAFT-HARTLEY!! #RepealTaftHartley", "All of these things would drive prices up for everything and displace the current residents. That's why people who live there protested the decision. They don't want to be forced out of their homes | If I can only afford rent at $1500 a month and demand for housing increases then the price of rent will go up. This means I can no longer afford rent and have to find a cheaper place.", "I love the image of bot farms howling in the void. Imagine some catastrophe takes out the human race, but the farms live on for awhile, powered by backup batteries and solar. The last transmission detected by alien intelligence before complete silence: “But her emails...” | Always and forever. pic.twitter.com/Hy3mKS4qQo | Welp, I guess we're all off the hook for taking or supporting ANY action, until our elected officials' actions are 100% unassailable. What a relief! I can see now why Donald Trump was elected -- he's the all-purpose excuse for us to do nothing. | 5% can be a significant number in the right context, it's a meaningless statement. What about all the other cases then? The problem with this \"lazy poor\" narrative is that a whole lot of non-lazy people have to work twice as hard as white guys like me to achieve the same success. | Oh right, poverty can just be explained as the moral failure of poor individuals. I forgot."], ["Ok well worded. Still wrong. The Pentagon bases decisions on climate based on NASA reports. And NASA admits climate change is real but exaggerated by politicians. Read the report | I just read 6 different surveys on this topic. Your numbers are a little off. Well more than a little. Considering climate crisis is based on one report. Actually a part of a hypothesis. Scientists in this field disagree with it. The evidence just isn't there | Considering their are NOT 17 national security agencies. There is only the NSA. The Pentagon does not get involved in weather studies only relays on NASA. So come again with that false narrative. Let me guess. You saw it on CNN | That number of 3000 is extremely inaccurate. Do better research. And Flint Michigan's lead problem is not environmental but a result of government corruption. By the way Michigan's government is dominated by democrats. Now what? | I haven't just seen war I fought in them. And at home the only violence is from leftist protesters. Do not compare these radicals with the brave men and women of the civil rights movement. Oh yeah other who opposed it were southern democrats. | Actually fascism is left. Not right. Read HISTORY. Nationalism isn't conservative it's liberalism. A bastard child of socialism. Read your definitions. | What fairytale are you drawing from. They only people who want these initiatives are lazy kids who don't believe in earning their own way | There is a solution for that. Stop calling addiction a disorder. There is NO corroborating proof that addition is a predisposed condition. I have been an addiction counselor for 7 years. I have studied this and found it only to be a theory. Nothing more. | That is just down right BRILLIANT. HAHA HAHA | And to solve the problem of families dealing with family members in prison. Maybe start taking responsibility for one's own actions and stop blaming other factors of their own doing. Focus on the reason for the pain masked by the abuse and learn to conquer it. | I'll be sure not to watch. I've had enough stupid today | If these allegations are false fight. I will support you. I don't like your politics but false allegations only weaken our system of justice. | That is just stupid. We as Americans see exactly what's happened. It's socialism at work. Stop covering the truth and look how many people died starved imprisoned under you socialist idiology. Putting democracy in front is a wolf in sheeps clothing | Really? But it's ok for blacks to attack a man wearing a MAGA hat. How is that not a hate crime. The law is for all of it's for nobody. YOU FAIL | Why is it every time you speak I go straight to can t check and you're always wrong. How do you still have a job? It's like listening to a 3 grader | Hey auto correct sucks.", "The issue is that you promote yourself too much. \n\nWhen your life is consumed with a perpetual selfie, inquiring minds want to know...\n\nLike, where did that cool million go?\n\nYou know, stuff like that... | Herein lies your Achilles heel @AOC... Our Founders envisioned elected SERVANTS to the People... not elected powerful people...\n\nIf anything, Jefferson, Adams, Madison et al, warned against powerful pols.\n\nThey created term limits so we could rid ourselves of an @AOC every 2 yrs. | I'm a republican!  Neither shilly nor corporate...\n\nMost my friends are also Rs, not shilly either...\n\nPretty sure we all still have a spine...\n\nWell, maybe one ..\n\nYou sound angry...\n\nTake a valium & chase with whisky...\n\nYou'll feel better... | @AOC Regardless of your opinion, the duly elected voters of Fla. put these House members in place. They can vote them out.\n\nOn the other hand, YOUR district is the 14th in NY.\n\nAnd, many are questioning why they put you there...\n\nBest fix your back yard first eh?...\n\n... | ..\n\n1. Universities have been stealing $ from students for decades.\n2. Tuition was a fraction of today's cost before student loans were available.\n3. Don't borrow $ if you are not adult enough to have a plan to pay it back.\n4. Students are not the victims, taxpayers are.\n\n.. | Actually she has no power in a Republican form of government...\n\nSays so in our Constitution...\n\nThe people who elect have the power...\n\nSays so in our Constitution... | 3.\nA significant number of \"students\" I encounter are from all over America & have attended a few courses in a local high profile university in our area; many from well to do families.\n\n44 years of antidotal & empirical evidence may not be conclusive \"datum\", but enlightening... | ..\n\nActually it is! 44 years in the car business. I've seen way too many times people use proceeds from student loans to pay for a car...\n\n..", "YOUR WIFE READ THIS? | Don't waste your time. She auditioned for the part and beat 2 other people who tried out for the \"part'. She has full backing and is just a pretty, front woman. It is all an act. read up - she is a fraud. just like Barry Hussein. | Yup - and Hillary was ahead election day in the polls anywhere from 4pts to 14pts.  You keep believing this - PLEASE!!  Hope more of your friends, family and the rest buy this stuff. | Wow - disagree and that means we fear? Typical feminist BS. What is truly sad is you probably really believe this crap. Wow - how pathetic. | Wanna bet. just read your post. Yeah - we are all gonna work and pay those who don't want to. Where do people like you come from - just another resentful old man with nothing. | please - PLEASE - keep writing!!!!!!!!!! what the heck is wrong with our kids? | HOW CAN THIS BE POSSIBLE - WE ARE TOLD ALL WOMEN VOTE IN A BLOCK FOR HILLARY AND AOC? YOU MEAN YOU THINK FOR YOURSELF - HOW CAN THAT BE? WARREN, KAMALA, GILIBRAND, AOC - MSNBC, NBC, SBC, ABC, WAPO, NYTIMES - ALL TELL US YOU FOLLOW????? | YOU BET - SHE DESERVES LOW POLLS. THE REST OF US WILL NOT GO QUIETLY | Hey Hall - if you truly think +80% of America agrees with this immature 29yr old nothing - you must have been devastated when the crook and her philandering spouse lost the election. But hey - you probably think Kavanaugh got what he deserved. You simply don't care about America. | Nah - under our skin? No - she just wants to destroy my kids America - just like loafers like you.  Some people never grow up no matter their age. | Pervert | Fantasizing won't help your mental health Moore. | left wing AOC math. A BU econ degree math. A socialists - we'll get the money somewhere - it doesn't matter where - the world is ending in 1`2 years - math. | Wow - apologize for yourself wimp | Heaven's NO!! | Wow - and you vote. God help America | Soros owns you. | Dream on | YEAH - WE ALL WANT TO PAY FOR SOMEONE WHO DECIDES NOT TO WORK. | Yup - proves their are economic morons at all ages - willing to totally through their freedom away for some moronic policy. USSR, Mao, Lenin, Stalin, Hugo, Fidel - bow down Ronnie - you got the goddess - 29 and full of crap. You go for it!!!!! | OMG - you are a woman - you can't say that!!! You have to march lock step with the left - you are not allowed to talk like a normal, intelligent person - this is the day of free everything. | Yup - gimme that stuff for free!!!!!!!!!!", "“The greatest polluting element in the earth’s environment is the proliferation of electromagnetic fields. I consider that to be a far greater threat on a global scale than warming, or the increase of chemical elements in the environment.” – Robert O. Becker | “The Internet of Things (IoT) will destroy not only the Internet… but all of mankind. I can prove it. In only 20 minutes.” ~ Bryan Lunduke https://www.youtube.com/watch?v=304Lcn0nU3c … | ... and we wonder why positions of power are so poorly executed. Nepotism and bribery are at the root of social decay. | Neoliberalism is the 40 yr. economic agenda to reduce the world to poverty level because the strong middle class experiment \"threatened political narrative\" in the 60's. A healthy society also cuts into profits. That's the problem with capitalism. https://www.youtube.com/watch?v=k5u5JpvuiTQ … | “The Internet of Things (IoT) will destroy not only the Internet… but all of mankind. I can prove it. In only 20 minutes.” ~ Bryan Lunduke https://www.youtube.com/watch?v=304Lcn0nU3c … | Ban 5G \"smart grid\", a disastrous swap of fossil fuel pollution for cancerous electrosmog (2000x more radiation than 4G) as well as unfettered surveillance. We need a national discussion first. \n\nTelecom Act of '96 prohibits the protest of tech upgrades based on health concerns. pic.twitter.com/JAWrWe1Tii | “The greatest polluting element in the earth’s environment is the proliferation of electromagnetic fields. I consider that to be a far greater threat on a global scale than warming, or the increase of chemical elements in the environment.” – Robert O. Becker | Surveillance capitalism IS China Technocracy social credit system. Ban 5G: https://theintercept.com/2019/03/01/surveillance-capitalism-book-shoshana-zuboff-naomi-klein/?fbclid=IwAR222lntAR57BKw4NTvuokEY-KrdYgIT-nKpSOv4KaK4cdFZyTtZo3CnvtU … | Connecting EVERYTHING to one source leaves us very vulnerable. Marc Ellsberg’s novel, Blackout, is about how easy it would be to create a global electrical grid shutdown. Blackout scenario: https://www.youtube.com/watch?v=YuM5iCn_iKI&t=610s … | “They define wireless radiation as a pollutant when it comes to protecting themselves in terms of liability, but when they want to force it into our communities and blanket our communities, supposedly it’s safe.” https://www.youtube.com/watch?v=ljLynbr5iPc&feature=share …", "Then you pay for it Doc. By the way, not one mention of nuclear energy. The greenest energy producing power plant invented. Now safer than ever. But you want to destroy our economy and vast swaths of land for solar panels. Environmental frauds, all of you. | Brainwashed. | And we went to the moon on fossil fuels. Hmmm. Amazing isn’t it? | Fossil fuels built it all. | Ahhh yes, electricity, nobody wanted it.  | Who said all that? If it weren’t for the industrial revolution we all would be dirt farmers and life expectancy would have stayed low. | Are you going to declare war on China & India? We could shut down our entire commercial industrial complex and not make a dent. But millions of starving people is the end game? It’s called nature. Just DON’T POLLUTE! CO2 is not a poison. | And how are you going to force the other countries on the planet to destroy themselves with this idiotic Atlas Shrugged plan? We could shut our entire economy down, the entire commercial industrial complex down, and not make a difference. | You just described yourself. Tiny handful of followers, talking points>sock puppet. | I guess he did, he forgot he was describing himself. | No, Basketball is on. The only hot air worth watching is what’s in the round ball.  | Call him what he is, COMMUNIST! | Then produce the alternative fuels first. 20 years you have been working on this alternative fuel and you don’t have it yet? My husband worked in research for alternative fuels as well, most had to be abandoned. You think we are all rubes out here? | Come and make me willfully destroy ourselves! | I repeat, if passenger trains were a profitable entity, they would not have gone away, except where they are now in dense populated areas. And I can drive faster btwn BTR and NOLA than any train that is forced on us by overpriced government fiat. | If passenger trains were profitable the Rail companies wouldn’t have abandoned them in the 20th Century. And you think central planning by government is the answer. CA sunk billions of taxpayers money into high speed rail. All wasted. Disgusting. | Thomas that’s not going to happen. The greening of the planet started thousands of years ago. Opening up areas for agriculture. The Markey’s of this country never mention how the warming of the planet has actually improved areas of the planet. | Spot on Fernando.  you aren’t the only one who understands what Markey and the Justice Democrats are trying to do. | I am a tree farmer also. I am not vegan, and don’t ever get in between me and my hamburger! And if you aren’t paying taxes, this means you aren’t managing your timber? Then you are an incompetent tree farmer. If you are selling the timber, report income? | Because that’s what the 14 page document proposed! Now Markey is trying to walk back the idiotic statements in the “aspirational” proposal. Aspirational my ass! That document was a beard for a complete Marxist takeover of our economy and way of life. | Oh yeah, that will fix it. Give billions to a slush fund that would do nothing, then spend trillions while destroying everyone’s life. Anyone supporting this awful suicide should be run out of office at their next election! | So when you stop all fossil fuel extraction what materials do you propose we use to make the “travel” products in our cars, our planes, our boats, essentially everything in our lives? | Jim, My dad was a mechanic, you don’t change brake fluid, you add. Who are you kidding? You think she bled the brakes too? Changed the pads? Took the drums off and had them turned? Jeez. ", "Where instead of new graduates being productive consumers after graduation they are indentured, unable to becoming contributors. Look to the economics of other countries where education and trades further national production for their education is \"free\" | Hence the reason USA is 17th of 40 where Finland is first! It's not about producing better smart contributors for the USA it's about profits like all things within the for profit system of USA greed. | It wasn't a question it was more of s statement as to the validity of  http://Realtor.com  as a credible source and the criteria they use to make these statements, the parameters in which these statistic qualify for a number of different rely on parental assistance | No progressive say invest in the future have higher education not only affordable but free! Strengthening the economy like the top ten countries in the world not profiting from student loans to keep people indentured like so called \"common sense\" Conservatives lol | Loan balance vs today? Employment opportunities vs today? Seriously utter rhetoric | Realtor dot com? What parameters how much is loaned personally from boomers and others what utter tripe! | for down payments and co-signs the stats are misleading at best and erroneous at worse! The fact is educational loans through government are not in place to give a hand up they are for profit and the educational complex is nothing but a system of indentured servitude. | Unproven and incorrect? LOL Yeah that's why 97% of peer review agree or are you suggesting that climate scientist from around the world get together in some kind of Mason like meeting and discuss how to \"hoodwink\" the planet You must of gotten your accreditation from a cereal box | You really don't get it do you..", " pic.twitter.com/2GbuJvJGn2 | So when is @CraigSBPA's funeral? #MurderedbyWords. | It takes youth & idealism to change the world for the better.\n\nJuly 4, 1776 - ages of Founding 'Fathers'.\nMarquis de Lafayette, 18\nJames Monroe, 18\nAlexander Hamilton, 21\nNathan Hale, 21\nBetsy Ross, 24\nJames Madison, 25\nJohn Paul Jones, 28\nThomas Jefferson, 33 | Our first large welfare programs started because of the Spanish Flu. Public health and welfare became important because poverty & lack of sanitation & health care spread it. Do we need another tragedy like that for you to get a clue? https://www.vaccinestoday.eu/stories/100-years-spanish-flu-world-ready-next-pandemic/ … | The government is supposed to (in part) protect us from the ravages of the Oligarchs who would take all of the wealth if they are not controlled. How far should this go? Until all are impoverished? That will mean another revolution. pic.twitter.com/96l5xQLbN4 | Her early inspiration was Bernie | This country was formed as a 'Commonwealth' (old word for 'socialism') to protect the people and give them freedom from ravages of the Oligarchy (Monarchy) and massive corporations (British East India Company). | Why should I? We will be joining the enlightened countries soon- making sure your grandkids don't have to beg on gofundme for your diabetes meds and that they are as educated as they want to be- without going bankrupt. I promise. \nHave a good day! | Thank you thank you for mentioning the Fairness Doctrine. Everyone whines and whines about FOX news but notice no one dare mention bringing back the solution? Except you! | Commonwealth is a traditional English term for a political community founded for the common good. The noun \"commonwealth\", meaning \"public welfare general good or advantage\" dates from the 15th century. | Not sure how it would work? It's worked in every developed country (not the red ones) on earth for decades. Feces on the sidewalk are from mentally ill NOT getting proper care. pic.twitter.com/91djtyYSRa | \"Civility\" or as they used to call it \"Tolerance\" - as in the Tolerance Game: pic.twitter.com/elEkOG1dTD | The (false) scarcity paradigm is what puts homeless on the street. Homeless on the street is a fear tactic used to keep the 99% fighting each other for crumbs under the tables of the oligarchs instead of overturning those tables and chasing them out of the dining room. | @SenSanders any day of the week | The Sackler family and Perdue Pharma execs should be in prison right now and their assets sold off to fund rehab and burial assistance for their victims. https://www.bizjournals.com/newyork/news/2019/03/08/hedge-fund-dumps-sackler-family-over-oxycontin.html …", "Right, but if you engage in credit-based transactions, you are arguably either explicitly or implicitly agreeing to have any deficiencies reported to warn others. What would the alternative look like? No accountability? | Arguably there is implicit consent here, at least. Not so with the “third-party doctrine,” which lets government access our data without a warrant. #legalizeprivacy | Also, aren’t we supposed to run out of oil long before it’s the only thing we’ll have left to drink?\n\nTrying to keep those dire predictions straight in my mind! | You’re assuming drastic action is needed to “save the planet” when alarmists like you have been wrong for decades.\n\nAnd why do you have so little confidence in human ingenuity and its prospects for continuing to improve our lives?\n\nMaybe it’s just a bad piece of legislation? | Corporations can only try to sell you stuff. It's government that poses the most potential danger to us, because it can wield force. | False alternative: it’s supposed to be run in service of a principle: individual rights. “The people” might vote to violate rights. | So you actually expect a privately owned platform to allow itself to be used to promote its own destruction? | Why be scared when the solution has been known for centuries: eliminate the power of government to pick winners and losers in the market, and thereby remove any incentive for corporations to “take over.”\n\nMob-inflicted mutual enslavement is no solution. | Various branches of government, interpreting a constitution in a system of checks and balances. It’s not infallible, but it’s the best humans can do. | Why would they “take over” if nothing could be gained by it? | Is there a Guinness World Record for the number of package deals contained in a single tweet? | Your question poses a false alternative. The plan will not boost the economy. It will stunt growth for all except the chosen green cronies. Leaving people free to use technology to improve our lives, in the face of all challenges, is the only moral and practical solution. | Are you not trying to turn \"working people\" against \"billionaires + the powerful\" in this tweet? I guess \"fueling discord\" between those groups doesn't count?\n\nAnd just the other day you talked about drinking water becoming scarce if we don't all sign on to your #GreenNewDeal.  | #greennewcronyism is what I’m calling it. | “Invest” is the new “redistribute”  | Whatever happened to the idea upon which America was founded: that we are born with certain inalienable rights, and government’s proper role is only to *recognize* them, *uphold* them, *respect* them?\n\nWhy do you say *establish*? Because healthcare is not and cannot be a *right*. | Could it be that both “crises” are cut from the same fear-mongering, power-grabbing cloth? | How about we reject socialism, which codifies and implements precisely that “logic”?\n\nDemocratic Socialism is mob-imposed, mutual enslavement, in which any gains come at the expense of others, by design.\n\nTo reject that “logic” is to embrace Capitalism. | I know! | Your collectivism is showing again!\n\nImagining what is possible for a facility that is open to the public is not the same as “public imagination,” whatever that means.\n\n#lifeisonelongreadingtest", "What's with all the labels today;  we are all Americans with vast views but at the end of the day we are human beings and should respect each other - the amount of hate, dislike the utter contempt will destroy this nation from within. | What I find truly amazing, that no one talks about the earth constantly evolving & climate will forever be changing and to politic off the use of one model is insulting to the people who have knowledge of such & flipping out b/c AOC claims climate causes asthma is asinine.... | My undergraduate degree was in Economics and I am a true believer in market base solutions and the government does play a role by promoting research and development by having a tax code that promotes innovation - such as allowing increase depreciation for capital improvement... | I went to Parochial School, Catholic School, for nines years and Jesus certainly was no Hustler, the New Testament talks about love and acceptance.  We are children of God and with that, we should adhere to the Golden Rule. | I was paying attention; the science is faulty; scientists in England and at Penn State University were caught manipulating the data; their are numerous model that predict the complete opposite.  Her #NewGreenDeal is not about corporate pollution. Keep your argument on point. | The idea of Health Care actually Health Insurance is a right by birth is a most ridiculous argument; Health Care is an individual responsibility - most of the current illnesses come about from poor food choices; table sugar causes inflammation in the body is one example. | Alex, I’m pretty sure @realDonaldTrump understand the situation & I’m well aware of @NOAA research; being rude doesn't help you win an argument.  Manipulating data by scientists & politicians picking certain models that advance their political position doesn't help either. | The real question we should be asking how did she unseat an established Democrats who held the seat for 20 years, & why the @gop didn't have a formidable challenger; it the same thing in Palm Beach County, Florida w/@RepTedDeutch & @RepLoisFrankel they have no challengers. | Going against the @amazon NYC deal was the height of insanity and the 3billion$ in incentive isn’t actual $, this concept should have been learned in Freshman Economic.  Maybe you should ask @paulkrugman to explain it to you - do you realize how many Union Jobs have been lost.", "That's not true.  Every single person who conflates opposition to the present Israeli government with antisemitism is actually promoting antisemitism. | Someone has to, because the relationship we have with Israel is sick.  How do you explain unconstitutional laws like this that force American citizens to pledge to a foreign country? https://theintercept.com/2018/12/17/israel-texas-anti-bds-law/ … | \"We need to recognize each other's struggle as part of our own.\" | So?  Ilhan did not say she was against all Israeli people, she objects to making it forbidden for American citizens to criticize the Israeli government.  The Israeli government deserves criticism, it is not antisemitic to do so. | It's not Ilhan who is being antisemitic, it's you.  The Israeli government is not \"Jews\", it's politicians with their own agenda.  If you can't figure out the difference, ,you're just another antisemite. | I'll probably forget your hateful bigotry in which you promote an anti-semitic trope just to express your anti-Ilhan hate. | Opposing the policies of a politician is not the same as opposing all of the people in that country or people of the same ethnicity.  If you think Israel=Jews, you're the racist."], ["I would hope you would hire staff based on their abilities and not the color of their skin.", "Yes. Some people are hostile after you correct them the first time, no matter how politely, and thereafter they will deliberately use your incorrect name in spite. | A person's name is important to him/her. All my life I had to \"fight\"  to get people to call me by my correct first name, not shortened or dumbed down. You'd think 5 letters  & 2 syllables of a common name would be easy, right? No, it's been an ongoing decades-long battle.", "I'm confused... I'm latina.... Never ever had a Hyphenated last name... I'm older than you.... ", "Present. 0", "\"Life's a bowl of cherries,  And nobody's merrier than me.  Because, everyone else is a proletariat,  And baby I'm the bourgeoisie. \"", "Esa pendeja no tiene nada bueno. Keep exposing those idiots.", "I’m asking @AOC if she will support the bill. Bernie said he will not. I hope she will.  | So, will you be supporting the Houae Dems bill to strengthen the ACA? Bc we badly need it. My life is on the line if I can’t have the coverage, services, & prescriptions that the ACA has afforded me. So are tens of millions of others. Asking for America.", "There's a time for moderation; on gun safety and a border wall, its not the time. Neither is climate change. It's long past time to be bold.", "It's very hurtful that you don't also speak out to defend against (maybe rarer case) of misandry. Do you? You do represent all, including men too, right? | Name one what?", "This is totally uncalled for and dangerous. Somehow we have got to stop these people from tearing us apart. | For being \" a man of God\" this is awful. Anyone who even believes in God would never say such a thing."], ["Canvassing app to find out about voters & what they want? Why not use this great concept between elections?  Is this not a great tool for reps beyond town halls (limited when dealing with >750k constituents or preventing inyourface protests)? Seed of #directdemocracy ? @Voterfied", "Lots of us have survived war and we’re still loyal to the Constitution of the United States of America. We have no need or want for your agenda and Sharia Law. We will not be silenced, those days stopped when the terrorist OBAMA left the WH. | ? | Not at all, I’m sayin she’s completely out of touch with reality. I’m not concerned with her background I’m responding to her egregious and obviously uninformed comments about males. I was a fan of hers since the early 70’s | Never had a mortgage, never owned a business or had to make payroll. Have ya ever even made a car payment? Hardly had a job and now we’re supposed to turn over the entire economy of the United States to you? Sorry but that’s a Hard No, not gonna happen | I’m certain now that between the two of you it’s unlikely you could formulate a single original rational thought. | You’re in the minority, finally you racist ignorant piece of shit. Shut the fuck up. We’re done with your intersectional stupidity. | DHS is the only thing between the rightful citizens of this country and the invasion of chaos at the southern border. If they’re seeking asylum why not accept asylum being offered in Mexico? Answer- your asylum argument is a complete lie and putting Americans in danger", "LOL  the DNC has sold out to neocons & Wall Street & Big Pharma, you guys have become a war party & you actually think they would hand the party over to Progressives  corporate money has polluted your party pic.twitter.com/Dxq53VmXn0 | who really thinks she would endorse Bernie & go against the DNC? Once a sellout, always a sellout pic.twitter.com/rsV8MGtUJV", "Progressive = Socialist | Love how people in another country, who by depends on the US have a opinion on our politics. Try paying your own way! | Waiting on the Socialist Democratic Party to explain how they will pay for it! | Troll from France | Sorry but the Democratics that have controlled PR forever are to blame! | Don’t worry an investigator will contacting you soon | Swing away! Please cause your socialist views are making it easier for 2020! | Reading the people comments that support her, are amazingly ignorant. She spewing everything people want to hear but not how it will be paid! | And now comes the race cardPoliticians are so wrong! | They are socialist!!! Just like you!", "If America were a civilized nation like its peers in EU? Waiters - who work far harder & longer than the J-Streetwalkers in Congress - would get a living wage, health insurance and paid benefits like vacation, maternity leave, etc. Sadly, we are not. @JusticeDemocrat #LivingWage | 1.Thank you for your service sir. \nBut you're confusing oligarchic Dictatorships (Cuba, Venezuela, USSR, etc) stealing Billion$ from taxpayers w/ Social Democracies like Norway, Finland, Netherlands, Germany and countless others that are very successful nations. Not the same. | 2. Reread your oath: It's defend our Constitution, not foment Civil War - which is traitorous. Threatening a democratically elected Congresswoman is undemocratic. Am sure you're not a traitor and support the USC - so should delete this tweet & think about your words. Be well sir | Mine is a heavily Mil/LE family - my middle name is from my Uncle Ed who died in WWII. So I appreciate deeply all who sacrifice to serve in all forms. You cast AOC as an enemy in reply, but I believe u misspoke - so why I said to delete that tweet and be more careful in future.", "The clueless party perhaps? | Membership dropped because even union members see how irrelevant unions have become. | Yeah, and that’s why they are closing factories and/or moving production to low wage countries. | Given your statement, it’s surprising you function at all. | Unions are no longer relevant or needed; the drop in union numbers and members is proof of that. Today unions are just about taking from companies without any regard to that company’s ability to make enough profit to survive...unions need to go the way of the dodo. | If the democrats in Puerto Rico hadn’t run the country into debt (~120 billion) then the government would not be forced to cut social services. Of course, AOC, perhaps intentionally, forgets to mention that, as it just proves that socialism doesn’t work. | Which is why we need the citizenship question added to the census. States should not be able to count illegals as residents in order to pad their congressional seat count, not to mention getting funds they don’t deserve. | As far as I’m concerned, they are one and the same. Also, look into that murder-suicide thing I mentioned. | As far as I’m concerned, there is no difference between the two, especially when the number one source of illegals in this country are those who come here on visas, then fail to leave when said visa expires. | $97 trillion, approximately. | Lol | Speaking of unfounded statements... | I chose the wall. | I think you meant 2 Billion.", "This is what *tyranny looks like. FTFY. | Move there. | Come to Missouri. | It's been the entire USA vs California and New York tbh. | The EPA's recycling efforts have been a giant waste of taxpayer time and dollars. | No thanks. pic.twitter.com/LzhPRQrXUU | What did socialists use before candles?\n.... \n...\n..\n.\nElectricity. | The income tax is a violation of privacy and demands that you waive your 5th amendment rights. A socialist state is a surveillance state. | Let's get politics out of money instead. | Capitalism is so amazing that even morons can be billionaires. They also frequently get elected, sadly. | Since when are Democrats against taxes? | It's Cheaper To Buy Every American A Ferrari Than Fund The Green New Deal https://thelibertarianrepublic.com/its-cheaper-to-buy-every-american-a-ferrari-than-fund-the-green-new-deal … | Green New Deal in practice pic.twitter.com/cWfHf2Q1Zp", "I am convinced the battle for the soul of the United States and even this planet we call home is not with Republican or Democrat, Rich or poor, black or white, Christen or Muslim it is between the illuminated and the dim. One deals with reality the other follows a reality star | I see you are with the dim typo police you can see that but miss the message", "What I’m scared of; How idiots like you can get elected to Congress. Sit back and learn before you start taking on bills. You have no clue. I could write a book on all the illogical things you’ve said. You’re turning Democrats to Republicans, so thank you. #FlawedLiberalLogic | You’re* the fool. Go ahead and vote for Socialism, it’s working wonders in Venezuela isn’t it? Moron. And fyi, I am a farmer in the Midwest and part of a large farming community, we are all doing just fine. Not sure where you’re getting your ‘farmers are bankrupt’ lies from. CNN? | Look everyone, Nadine is a moron. | Holy wow. Replace Republican with Democrat and you are 100% accurate. If you actually feel that way your ignorant and part of the problem with society these days. Trump will win again in 2020 to keep us saved from the radicalized race baiting liberals trying to end the country.", "Means you lose an hour of coloring in your books, TippyTop Airhead! | The Cow farts tour continues.\n\nStarring TippyTop Airhead.\n\n#RunTrain | HATE https://twitter.com/RealJamesWoods/status/1104860847359193088 … | Every Jewish democRAT should #WalkAwayFromDemocrats | It's all you clowns do..talk...and talk crap, part of being an airhead!\n\n.....RUN TRAIN..."], ["We fact checked, you are HONEST here. pic.twitter.com/Nkr0TVOuaE |  morons pic.twitter.com/uqwkTGdLG4 |  pic.twitter.com/5GsGgYmPtz", "#ImpeachAOC  #ResignAOC pic.twitter.com/eh0psprNSY |  pic.twitter.com/bWZSPyzKBe | #ImpeachAOC  #ResignAOC pic.twitter.com/5OoNmbVSaV", "We love you both Ayanna & AOC be fierce NO kid gloves for Fascist thieving republiCON liars. Raise hell girls. pic.twitter.com/qQ443V8I5H | Fascist evil republiCONs and their effing games", "Being a Board Member of Justice Democrats is not helping your arguments. Didn't you run on transparency? Money funneled to a PAC/then funneled to 2 companies, owned & ran by the same person isn't a shining example of transparency. If this was Trump you'd be dancing on the roof. | So, is this from your Q&A page? pic.twitter.com/Sqt2BoQT5S |  pic.twitter.com/DNNH1gUWZL | So, you're saying she'll be turning down that $10M from Netflix, right? | Climate change is a hoax. https://www.nbcnews.com/mach/amp/ncna987116?__twitter_impression=true … | Start with the glaciers GROWING in Greenland. \n\nExplain how you think climate change is shrinking them, when they've gotten bigger for the past 2 years.\n\nI dare you.", "If there's a home around to put him in. | If we \"could've easily been run over\", why weren't we? Just a general inquiry. pic.twitter.com/yj3J6OE2m4 | I don't think you realized how much you contradicted yourself. \n- mentioning 2nd amendment\n- in the same statement, in all caps no less, \"No amount of legislation will protect you from bad people.\" pic.twitter.com/6lm6D91gi9", "Climate change = Snow melts in spring. Snow evaporated= rain. Rain = fresh water for farmers & Drinking water for towns & Cities. “Climate change “ & the cycle begins. 11yrs 9 months. pic.twitter.com/8RFpKxkLRr | Where’s the money? pic.twitter.com/o9iEZQqcjy | AOC you are so full of shit. The New Terminals are public private Joint Ventures because Gov. Can’t run anything. LaGuardia Airport is all Union jobs. Stop before you also become irrelevant. Oh sorry you are irrelevant. pic.twitter.com/Bvlqngu965 | AOC you’re not relevant anymore. The Mortgage was mandated by the Now Governor Cuomo when he worked for HUD. The Banks had to give loans to people that couldn’t handle payments. Trying reading History. | The intent of Congress is a civic duty not a way of life as is in a Communist system. You will be voted out eventually & you’re staff will have to get a real job answering to a Boss. You are relevant in your temporary role. So far you & you’re staff cost NYC millions of dollars. pic.twitter.com/xTQW9mqdtT", " pic.twitter.com/NzBkeYDBb5 | No, to normal people it signifies degradation, slavery, capitulation, weakness, and evil. It means you are less than whole, a tool to your puppeteer. It tells me you are weak. pic.twitter.com/uzmkJIL4Oi | Lol. How’s that working out for you? pic.twitter.com/tU3F0GJXE7", " pic.twitter.com/aamGLZjjPi | We will win! pic.twitter.com/xE5atMqYyx | She wants to take my burgers away. | Is this like a question? |  pic.twitter.com/v7WXUW1rdW", "I recommend a Harry Potter Time Turner or Star Wars cloning so you can attend simultaneous committee hearings... pic.twitter.com/ZvMBKLGFSx | Both protestors are WOMEN ! PATRIOTS  pic.twitter.com/2XkIyW3iox", " pic.twitter.com/tHzF5pmlEZ | Bartender 90 days ago, kook today, only a democrat could pull that off. | Cortez an puppet politician fooling the people.... it doesn’t get any better. | Jose A Del Real... does your article address securing Open Borders? |  pic.twitter.com/NLddEcMuHR | Free healthcare or mental healthcare is not a right. |  pic.twitter.com/LHgXaK42ot | Cortez as soon as you & the others kooks can figure out how to control the following. I will say how do we get started or call each of you idiots.\n\nSun Solar Flares \nEarth gravitational rotation \nMoon rotation \nCap all active Volcanos\n\nClimate Change is a Hoax! | Medicare for all would eliminate 15 million American jobs within 15 months. Free college will require minimum standards otherwise it is a waste of resources | Those that file bankruptcy because of medical bills, never had or paid for healthcare coverage."], ["#WakeUp & do your own research folks! #AlexandriaOcasioCortez is a #Puppet ACCTRESS for the @justicedemss #Socialists who created her to forward their plot to infiltrate & control the US government! They have already installed 3 recruits in Congress. https://www.youtube.com/watch?v=V-3_FGyhg4k&t=5s&frags=pl%2Cwn … | #AOC #JusticeDemocrat #Creation  #TheyWriteHerTweets #SocialistInfiltration #TheyHateAmerica #DemocratsAreDestroyingAmerica \n#MAGA @POTUS #AmericaFirst #WethePeople #KAG2020 #SecuretheBorder #PatriotsAwakened #EndCHILDtrafficking #EndWAR #SavetheChildren https://www.youtube.com/watch?v=wbtcgiH6MnQ&frags=pl%2Cwn … | #AOC #JusticeDemocrat #Creation  #TheyWriteHerTweets #SocialistInfiltration #TheyHateAmerica #DemocratsAreDestroyingAmerica \n#MAGA @POTUS #AmericaFirst #WethePeople #KAG2020 #SecuretheBorder #PatriotsAwakened #EndCHILDtrafficking #EndWAR #SavetheChildren https://www.youtube.com/watch?v=wbtcgiH6MnQ&frags=pl%2Cwn … | Conspiracy to infiltrate the US government #Marxists #JusticeDemocrats #CorbinTrent @RashidaTlaib @AyannaPressley #BeckyBond @saikatc #SocialismKills  \n\n#WEthePEOPLE #MAGA @POTUS @RealDonaldTrump #AmericaFirst #SecuretheBorder #StoptheInvasion #KAG2020 https://www.youtube.com/watch?v=V-3_FGyhg4k&frags=pl%2Cwn … | To learn more about this topic (which you clearly need to consider) I recommend you read the Constitution.... #WethePeople #AmericaFirst #SecureTheBorder #SavetheChildren #PatriotsAwakened \n\n http://constitutionus.com ", "Dems can’t win w/o G-mandering, voter fraud, MSM lies, trying to destroy a SC nominee’s life, stopping blacks frm voting in the past, buying poor blk votes via welfare state, destroying rule of law w illegal IMG/sanctuary cities-2 get new voters. See chg the rules to pack SCOTUS | .@PrisonPlanet Facts don’t count with AOC, only her raw, unfiltered, unrefined emotions matter to her. So glad that’s who’s the ”boss” of us now. #Dembo | .@SisterJanetFRAP Repubs learning to out-gerrymander Dems by turning it into a science & art form does not mean Dems don’t gerrymander. They do. Just lose more often, scream louder and point fingers as if they don’t.  There’s a current case in Maryland pic.twitter.com/3mnZWYosN0 | .@SisterJanetFRAP By ”data” do you mean facts? \nDemocrats have been knee deep in gerrymandering since the beginning of the practice - btw, invented by Elbridge Gerry a ”Democratic-Republican.”  A few facts documenting Democrat gerrymandering:  https//bit.ly/2Fv7SFF pic.twitter.com/GUOHST6HnX | .@SisterJanetFRAP Try to keep. I said *trying* to destroy Kavanaugh’s life...not that you succeeded. | .@SisterJanetFRAP The rest of my statement is pure gibberish?  Sorry you can’t do abbreviations, #KnowShitForHistory & don’t even know that bec Dems can’t win without cheating & changing the rules, they are now trying – *trying* – to ”gerrymander” a packed Supreme Court", "What @AOC doesn't realize is green slime deal is a bill of garbage it is not practical it would bankrupt the country & it's not attainable! All she does is fling poo poo against the wall to see if any sticks & so far none  has stuck! @HouseDemocrats want her out! @POTUS #MAGA | The inmates are rumning the @DNC asylum! The 3 bottom feeders @RepAOC @RashidaTlaib & @Ilhan are dictating what the top @TheDemCoalition does! That's wjy @realDonaldTrump , @HouseGOP @SenateGOP & @GOPChairwoman all win again! | @RepAOC should move along w @BernieSanders & most @DNC members to a socialism country! #usa people don't want that here & don' t want socialized medicine! Yesterday was National Doctors Day & she didn't acknoledge that ! She's helping @realDonaldTrump & @HouseGOP @SenateGOP win! | Old, young ,white, black men & women get nervous when people like u think @RepAOC @Ilhan & @RashidaTlaib are providing leadership! The 3 Stooges of @HouseDemocrats provide hatred, bigotry & no useful ideas to #MAGA! @dnc wants all 3 out! Many of every race are helping, not them! | We all wonder why every time @RepAOC speaks something more stupid than the time before comes out! She & her other 2 Stooges @Ilhan & @RashidaTlaib  are pushing more & more voters over to @HouseGOP @SenateGOP & to @realDonaldTrump !", "Present  Present PresentPresent  Present PresentPresent  Present PresentPresent  Present PresentPresent  Present PresentPresent  Present PresentPresent  Present PresentPresent  Present PresentPresent  Present PresentPresent ", ".@aoc and her campaign chair held majority legal control over Justice Democrats PAC during her primary run.\n\nJustice Democrats raised over $1.8 million before her primary victory. @AOC has sat on the PAC's board since Dec. 2017.\n\n https://web.archive.org/web/20180323224252/https://www.justicedemocrats.com/about …\n\nhttps://dailycaller.com/2019/03/04/ocasio-cortez-justice-democrats/ … pic.twitter.com/0RYULjIcev | Care to address the fact that you and your chief of staff have served on the three-member board of Justice Democrats PAC since December 2017?\n\nWorth noting that Justice Democrats had raised over $1.8 million prior to your primary victory.", "Yeah, I see the answer. All those running for POTUS on the DNC side, along with all Democrats in the senate voted “NO” for the #GreenNewDeal . Go figure, their real colors shine through the BS they and the MSM push daily. ROTFL. #ShameOnDemocrats #NoCollusion #Meh | Need context and real data. The Flint water crisis is manufactured by Flint’s government, just happen to be majority Democrat. This is not new. The Midwest has flooded for as long as recorded history, people build on floodplains, . Is what she says relevant? True? #Meh | What?  All she says is she’d be happy to engage these folks and keeps going. Wow, NOW THIS line of BS is outstanding. LOL #ShameOnDemocrats | Would you consider serving you own district for a change?  They seem to be experiencing “Voters remorse” in your election as you haven’t been paying attention to them. Are you a notional rep, or do you have a district?#AOC #SocialismKills https://www.google.com/amp/s/nypost.com/2019/03/30/her-heart-is-not-in-the-bronx-aocs-own-district-turns-against-congresswoman/amp/ … |  pic.twitter.com/0HCPraXKed", "Per @AOC's point, GOP wants to add census citizenship question to radically change how districts are drawn, excluding noncitizens from representation even though districts have long counted total population. That would be massive power shift to whiter & more Republican areas | Wilbur Ross falsely claimed DOJ first requested citizenship question on 2020 census but new memo from @OversightDems shows member of Trump transition team initially proposed idea. More evidence undermining Ross's testimony  https://oversight.house.gov/sites/democrats.oversight.house.gov/files/documents/2019-03-14.%20Supplemental%20Memo%20on%20Gore%20TI.pdf … pic.twitter.com/Eda1dGOfcl | Federal court said Wilbur Ross \"violated the law\" & \"violated public trust\" by adding citizenship question to 2020 census. Ross “alternately ignored, cherry-picked, or badly misconstrued the evidence in the record before him\" https://www.motherjones.com/politics/2019/01/judge-strikes-down-controversial-citizenship-question-on-2020-census/ … | And Wilbur Ross absurdly claimed census citizenship question needed to enforce Voting Rights Act when even top Trump DOJ official admitted \"not necessary.\" Trump admin hasn't filed single lawsuit to enforce VRA https://www.motherjones.com/politics/2018/11/trial-over-census-citizenship-question-kicks-off-amid-revelation-of-trump-administration-deception/ … | .@AOC notes Kris Kobach wrote to Wilbur Ross & wanted citizenship question added to census to exclude non citizens from counting toward Congressional apportionment. \"It had nothing to do with Voting Rights Act,\" she said. \"It is about immigrants & Congressional apportionment\"", "So you are defending her anti-semitism. We get that. The Democrat Party is now the party of anti-semitism, terrorist sympathizers, socialism and communism, big government, high taxes, infanticide, anti black community, Pro crime, anti-law enforcement, the list goes on. | You are proving my point. The fact that the Democrat Party has avowed themselves with Socialism and Communist ideas, such as The Green New Deal, Medicare for all, Govt. control of business and labor, means they cannot distance themselves, except to accuse the GOP of the same. | Nice try. This is exactly what Lenin did before and after the revolution. He would smear the opposition as something, that in all reality, he embodied. @AOC is following Lenin's Playbook. This is where she gets her ideas, this is where she gets her talking points. | That proves absolutely nothing. Whales are different than humans, and sound travels underwater differently. Any person with basic science knows those two facts. All you proved is that air horns are annoying to humans. Some of this already knew that. Did you? | Sorry, I don't listen to socialist/communist propaganda. The Green New Deal is an idea birthed out of the ideology of Karl Marx. Extreme, oppressive environmental ideologies were a part of his Communist Manifesto. | The problem with Puerto Rico is not Congress and POTUS, it is their own corrupt officials who cannot be trusted. \n\nNumerous stories about corrupt officials using allocated money unwisely. https://thehill.com/opinion/campaign/407717-political-shenanigans-mask-true-problems-in-puerto-rico … | The #GreenNewDeal will do nothing but enact Socialism in the United States. It will enslave millions by high taxes. Create massive job loss by over-regulation. Total government control of business and labor. The Green New Deal is a very bad deal.\n\n#NoGreenNewDeal | There is nothing wrong with public education, as long as they educate and not indoctrinate. Big difference between the two. | Something we have learned today. Anti-semites stand together. Hamas terrorist sympathizers stand together. Those who associate themselves with terrorist groups such as Hamas and CAIR, stand together. The Democrat Party has become a safe haven for anti semantics and terrorists. | No thank you. I don't listen to Communist propaganda. pic.twitter.com/1diGY4PdpA", "There are NUMEROUS GOOD REASONS to eliminate Fusion Voting! You are misleading your audience, @AOC. Very disappointing to see this tweet. | Closed primaries have nothing to do with fusion voting. Fusion limits voter choice in NYS by allowing backroom deals to put the same candidates on multiple party lines. 46 states have outlawed fusion, and so should NYS. | Love ya @AOC, but you are DEAD WRONG. Fusion Voting = Ballot Rigging & leads to corruption, patronage, backroom deals, & limited voter choice (by allowing one candidate to steal multiple party lines). It also dilutes what parties stand for, and betrays party members. #EndFusion | No, fusion voting is a legalized way to rig the ballot in NYS by limiting voter choice. It's why you see the same candidate on multiple party lines when you go to vote. It's an archaic system fed by corruption & patronage, one that 46 states have outlawed. #EndNYFusionVoting | There needs to be a powerful third party. The D party is never going to survive and is literally killing itself. | Fusion voting = ballot rigging. Fusion leads to corruption, feeds unhealthy patronage, encourages backroom deals, limits voter choice by allowing one candidates to run on multiple party lines, dilutes what third parties stand for, and betrays party members. #EndNYFusionVoting", "Generally white working class male, those that voted for Obama then switched to Trump. Bill Clinton appealed to this voter. Back in the nineties, we called him \"bubba.\" | This Trump Democrat aka \"bubba\" killed us in states Mi., Pa., And Wi. @TheDemocrats must do better with this voter. @AOC and other liberals must explain to them their policies are in their interest. Ex. See #MedicareForAll. | One more thing. In this piece from Rick Wilson, he uses the term \"bubba\" in saying the Dems should be less AOC (skip down to section about Rowe and AOC) and more like \"bubba.\" BTW, Bill Clinton was considered a bubba.  I don't agree with all of article. https://www.nydailynews.com/opinion/ny-oped-losing-2020-20190331-qz6zaomkfndxlleg75yhdqyvou-story.html?outputType=amp&__twitter_impression=true … | If you watch American news, you'll get interviews with guys who voted for Obama then switched to Trump. About 70K voters across those 3 states were the difference. @TheDemocrats must do better with these voters in the upper Midwest."], ["This is the perfect example of the people who voted these goofballs into office. @vlopez118. Thinks thats a hard question.  | SOME ONE PLEASE TELL ME HOW ARE WE GONNA PAY FOR THIS?????  I keep,asking and no one will answer. | But did you send money? They looking for money not comments | Help your own before you help others. What about the AMERICANS who need help? Any amswer for that? | WHAT MONEY????????? | Bernie? Do we really need an 80 year old president?", "Geez smh. Political suicide. Keep talking hon. | When you are for open borders, sympathize with radicals are antisemitic, racist, hostile toward this country and our President people are going to lash out. When you speak like a terrorist people will believe you are a terrorist. Just who are the \"real people\" you speak of AOC?", "Not a handout and we have not played victim but have BEEN &continue to be victims of systematic racism. Its what's owed and it must be paid. If wht ppl have continued to benefit from unpaid labor of our ancestors then why shouldn't those descendants of those ppl be compensated", "The nonstop parade of elementary argument fallacies she and many other politicians continue to use to manipulate people makes me lose a lot of respect for her and her ideas.", "Theres considerably more than 1000 words to describe why you 4 are the wrong women to shape the future of women and girls...\nLets start with 1... infanticide", "Lmao.  Keep telling yourself that. | Sure sure. Idiot.  At this point y’all have to prove that you’re not racist rather than us having to prove you are. | You would’ve guessed wrong. The majority of Americans support all those policy positions. It’s just a few billionaires convincing a lot of dumb people they shouldn’t support it. But still the majority does. That’s called mainstream.", "Only the women's March cares that it's Muslims they didn't give a shit when Jewish people are getting shot or when Christians are getting shot as long as it's Muslims that's where they give a damn about", "Asshole | Shutup, bitch. It's a typo, you miserable POS.  | Some of you, in these comments, are miissserrrabbbllleeee. I've never seen so many sad insufferable people, ever. Damned if you do. Damned if you don't. You that complain about her are people that have dome nothing to male this country better. A lot of lip service. #shutupplease | Yes, economics is a system. I'm going to assume you DID NOT go to college. | But, we are in America. We need to fix our own house before we take on others. | It's weird how people in these comments bash @aoc for doing something about a problem that will affect EVERYONE. Whether you like it or not. You all are just miserable. | Umkay....so you were just being a jerk, then. Is it because she's not white? | You sound ignorant. | You're a donkey. | This is stupid. | The same way we pay for everything else. How are we paying for am 18-year war that has cost us over a trillion dollars? |  pic.twitter.com/zJZfAvMn5N", "Need clearer video or subtitles. | I do. It's a lie that life only thrives by competition. Life thrives through cooperation; everyone and everything can win. But people in power spread a lie long ago that shames people into losing. Good people who believe them would rather go without than win while others lose. | He would probably end up sanctioning him.", "If we keep drawing a line in the sand then PEOPLE will keep picking a side. | I'm a non-hatefilled, veteran, disabled, white person who was born with cleft and spent a lifetime being ridiculed by every race equally. People in general dislike those who are different. I just wish \"Hate\" wasnt synonymous with whites. PEOPLE generally hate what is different."], ["Journalists should doctor phones with fake contacts and information and wait for law enforcement agencies to file charges with the data they burned. When you’ve got them by their balls, their hearts and minds will follow. As evidenced by Cohen and Manafort’s 47-month sentence. | Exactly what we’ve been hoping and praying for all our lives. \n\nI wish AOC was my Congresswoman. \n\n#CongressionalEnvy | “The Democrats who backed the bill - Sens. Heidi Heitkamp, Joe Donnelly, and Claire McCaskill - did not make it through the midterm elections.” “They didn’t win re-election, and so I think that they might regret the fact that they kind of sold out the Democratic Party’s values” pic.twitter.com/r3Xg5kQ8Ac | If the ocean dies, mankind is dead. Talk to fishermen or go spear fishing. Watch Sylvia Earle in the Mission Blue documentary. The reefs are dying. The fish that are left, even at the deepest pointe on earth, have plastic in them and toxic levels of poison in the Baltic Sea. pic.twitter.com/CCgkhf49P4 | Politicians and policymakers don’t comprehend the gravity of our continued life on earth. We cannot survive without life in the ocean. pic.twitter.com/Z67uRMr5wk | American suicide rates are up an average of 30% and as much as 58%.\n\nThe #RepublicanRegime is killing us. We cannot survive without a living wage and healthcare. pic.twitter.com/ahX0AJVXho | #HR1 must be amended. It should be illegal for all politicians to invest in any company that does business with the government. Rick Scott used money he got defrauding Medicare, Medicaid and Tricare for more than 20-years to buy his Governor seat and doubled his net worth as Gov. pic.twitter.com/STBfLDZF4b | Great find, Saikat! |  pic.twitter.com/D1uD79Mwyx | Yep. | Blackwater Founder Erik Prince Implicated in Murder\n\nSworn statements filed in Federal Court allege that Blackwater founder Erik Prince launched a “crusade” to eliminate Muslims and Islam.\n\nBy Jeremy Scahill \nAugust 4, 2009 https://www.thenation.com/article/blackwater-founder-implicated-murder/ … | The Republican polls are clearly wrong. Definitely not just the 18- to 34-year olds that love AOC. | “Kucinich is on the House Committee on Oversight and Government \nReform and has been investigating Prince and Blackwater since 2004. Blackwater wouldn’t exist without federal patronage; these allegations should be thoroughly investigated,” Kucinich said.” | “A former Blackwater employee and an ex-US Marine who has worked as a security operative for the company have made a series of explosive allegations in sworn statements filed on August 3 in federal court in Virginia.“ | Erik Price is the new mafia earning $170-million + a yr in the protection racket.\n\nTaxpayers pay him. He pays hired guns a $500-$1,000 a day - up to $300K a yr to murder in the shadows. \n\nHe operates in 25 countries across Africa, the Americas, Asia, Europe and the Middle East. | “For example, Mr. Prince transferred funds from one company (Blackwater) to another (Greystone) whenever necessary to avoid detection of his money laundering and tax evasion schemes.” | Your emotional response lacking factual substance, void of logical thought and without a source for your irrational opinion is unpersuasive. | You’re an idiot if you don’t. Clearly you have no idea what’s happening, and make no effort to read, if you don’t know that this is absolute truth. You’re not a follower and yet felt compelled to comment - and reveal to the world that you don’t know what you’re talking about. | Betsy DeVos saw how well the government pays Erik and she’s in the process of privatizing education the same way that Erik privatized war. | Taxpayers fund training and health care for veterans. Erik plucks the very best for private mercenary work weakening US forces and leaving the least experienced on the taxpayer’s payroll. Erik gets free, fully trained, mercenaries and billions since 1997. \n\nThis is how Rome fell. | This CNP email describes the methods, strategy, and tactics.\n\nCNP members: Richard + Betsy DeVos, Ed Prince (Erik Prince’s dad). Erik’s co is guarding oil + gas worldwide + works for Putin, MbS (and more) disrupting geopolitics, earned $170M last yr. They don’t want a Green Deal. pic.twitter.com/8pn9JiRfGB | Ed Price, Betsy and Erik’s dad, made their millions manufacturers parts for the gas-guzzling automakers that are going out of business.", "Actually what's costing us lives are the people in those seats. | and yet still no takers on my challenge to discuss this ground breaking Supreme Court case! Not even you?! but you want to talk elections ? How about we discuss the LAW lawmakers are igoring and the Media is Blacking out! pic.twitter.com/DVOhNd1QEz | town hall question: How is congress not opposing @TheDemocrats and @dccc new rule to oppose any candidate or organization who challenges any incumbent? Why is this not being dealt with by Congress. This is collusion to break election law and kill democracy. LAW IS CLEAR pic.twitter.com/l5KgqRf87L | Amazing how the discussion of a question on the census is open but not a word about the case proving WHY WE HAVE A CENSUS! Supreme Court case 18-290. It's to legally determine the number of Representatives in the House and establish a legal quorum which we proved dosn't exist ! | This is law already. That is the lawful reality. This is bringing Corruption to the forefront. It's almost like the universe it's self is opening the doors to lay all bare! As I say EVERYTHING has a breaking point even an atom...and the spirit of the universe. | It's organized crime. Rico ! | 3) proper process would be to suspend lawmaking process of Congress until this case is resolved. 75% is the threshold of ratification of Amendmants to Constitution. We proved 80% exists. This Article The First was the first in the bill of rights sent to states as a bundle of 12. | 2) rather than acknowledge the existance of this law the Supreme Court sent this case back to the Federal Appellate Division after the plaintiffs rights were violated which took the case to the Supreme Court in the first place. | 5) Article The First limits power of Congress to prevent The House which is the People's voice from being silenced. Article The Second which we didn't get until 1999 limited their pay. Do the math? 12 articles the first two the most important but the last two we find out exist? | 1) So glad you asked. Article one as we know it of the Us Constitution is currently in court as groundbreaking evidence proves No member of the House may represent more than 50K. Rather than address this LAW they continue to make law without the authority of the Constitution\n. | You could start by following the Constitution and calling out those who don't! But then that would mean you have to atleast read the darn thing. | @AOC ... You want to comment? Or would you rather someone else rise to defend you? The problem is you can't say anything because you don't have permission... But you speak for Americans without their permission. | 7) NO media will discuss this case and our twitter, facebook, and press releases have all been censored BC Congress will shut down for a wall but won't pause the act of making law to ensure it has the right and authority to make law. pic.twitter.com/V11l082m4P | 4) Ask your self how did 3-12 of these Articles get passed and added when article 2 has also proven to be ratified as we now know it as the 27th ammendment limiting the pay of Congress. was not added until 1999. | 6) to bring this acse we had to serve every State Legislator, House, Senate, Sec of US Chamber of Commerce, VP and President. Citizens don't even know the STATE's AGs fought this and lost. yes all 50 states. | Really I challenged you and you won't respond...so quit the bragging.  It's a Cupreme Court case and you won't discuss it. 18-290 #eighteen290 come on say it with me! pic.twitter.com/5YOBhgf79z |  https://www.supremecourt.gov/search.aspx?filename=/docket/docketfiles/html/public/18-290.html … This is a real case about the authority you think you have. I know what I am talking about and I am saying YOU Don't! SUPREME CORT CASE 18-290 Apportionment of the House and the First Amendment to the Constitution 80% proven ratification being ignored! pic.twitter.com/06xaEbJIpH", "Nothing compared to GND's $93 Trillion bill which will bankrupt the country and every resident. | A \"constituent\" is a voter, a member of the electorate. Illegal aliens can't vote. Or can they in your district? Maybe someone needs to look into that.\n https://amp.dailycaller.com/2019/03/15/ocasio-cortez-aliens-constituents?__twitter_impression=true … | 4,000 Americans were MURDERED in the past 2 yrs by violent illegal aliens...Where's your response to those lives and families? You don't want to build a wall, You don't want ICE to enforce our immigration laws, You don't want to secure our border, You are ok with Sanctuary Cities pic.twitter.com/nLim4xezL8 |  https://www.facebook.com/prageru/videos/561028954306702/ … | says the woman who wears a hijab which is a religious symbol that oppresses women. The main purpose of wearing a hijab or burqa is to cover the face of a woman so they don't attract another man. Oppression is a human rights issue. | Stop avoiding the 800-pound gorilla, what's your response to your Dark Money scandal, it's a Federal Finance Violation. https://www.washingtonexaminer.com/politics/ocasio-cortezs-chief-of-staff-ran-1m-slush-fund-by-diverting-campaign-cash-to-his-own-companies … | Her deal is too ambitious and not financially feasible for a country our size. It also does not include partnerships and sharing of ideas to help other countries such as China & India who have worse pollution issues. She's not a scientist, nor does she have a PhD in this field. pic.twitter.com/0ojsduzY7T |  pic.twitter.com/ocd0m27T00 | I don't think so, I own 2 companies and employ many Americans, I do a lot more than AOC in supporting my community and economy. She has no clue how to be a leader and run a company. Her ideas are foolish and not realistic. The video just proves how dumb she is... | 4,000 Americans were MURDERED in the past 2 yrs by violent illegal aliens...Where's your response to those lives and families? You don't want to build a wall, You don't want ICE to enforce our immigration laws, You don't want to secure our border, You are ok with Sanctuary Cities pic.twitter.com/vZX5n3Doc1 | Ideas (GND) are not solid or realistic when they cost us $93 Trillion to implement and she can't explain where the money is going to come from. Did you see the video I posted earlier, she has verbal diarrhea. https://www.cnn.com/videos/politics/2018/09/16/alexandria-ocasio-cortez-40-trillion-dollar-spending-plan-sotu-vpx.cnn … | Not solely but she's adding to the troubles and the media isn't helping either by hyping her up. Trump disrupted politics as he did with the media, we needed this, with disruption there is chaos at first but it should settle amd bring change and be a learning moment | yes but she's not running for President and the candidate that will win the nomination will NOT be someone who is progressive. There's turmoil in the Democratic party and it's only going to get worse. I'm making a bowl of popcorn to watch this one play out... pic.twitter.com/BCVQ063HXw | She's doing more to destroy the Democratic party than me, that is true! She is handing over the next election to #Trump2020  If I closed my eyes and someone played this audio for me and asked me to guess the person's age, I would say a teenager... https://www.youtube.com/watch?v=8Y531QRhEwc&ab_channel=TheDCShorts … | She's doing more to destroy the Democratic party than me, that is true! She is handing over the next election to #Trump2020  If I closed my eyes and someone played this audio for me and asked me to guess the person's age, I would say a teenager... https://www.youtube.com/watch?v=8Y531QRhEwc&ab_channel=TheDCShorts … | SPOT ON WTF? She has got to be the dumbest person in Government..\nHer only solution is to increase taxes on the wealthy people who are at the \"tippy tops\" so they can fund her social programs and the people \"unwilling\" to work...A child's vocabulary SMH! https://www.youtube.com/watch?v=8Y531QRhEwc&ab_channel=TheDCShorts … |  pic.twitter.com/ihou2vRyOb | Impresses us that she has absolutely NO KNOWLEDGE OR EXPERIENCE. Delusional and Dumb!  https://www.cnn.com/2018/09/18/politics/alexandria-ocasio-cortez-tapper/index.html … | Who's smart??? Delusional and Dumb!  https://www.cnn.com/2018/09/18/politics/alexandria-ocasio-cortez-tapper/index.html … | What's clear and grounded about the policy? How's it going to be funded? | Are you joking? Substantive not, try unrealistic and delusional. AOC says something dumb every week and is helping to hand over the next election to #TRUMP2020 #TippyTops https://youtu.be/8Y531QRhEwc  | Tippy tops...are these the words of an intelligent adult? https://www.youtube.com/watch?v=b1dY8RkIxCo … |  pic.twitter.com/QtiFshsckU | No it's because AOC is DUMB AS WOOD! She is a puppet created by her chief of staff Saikat and Cenk Uygur from the young turks. They manage the strategy and write out all of her talking points and questions. https://www.youtube.com/watch?v=1h5iv6sECGU&ab_channel=MrReagan … | Of really??? She's Delusional and Dumb!  https://www.cnn.com/2018/09/18/politics/alexandria-ocasio-cortez-tapper/index.html … | I SERIOUSLY THINK AOC IS A TRUMP OPERATIVE, PLACED INSIDE THE DEMOCRATS TO CAUSE TURMOIL AND SABOTAGE THE PARTY FROM WITHIN. EVERY WEEK SHE GIVES US OPINION THAT IS DUMBER THAN THE WEEK BEFORE. IT'S JUST VERBAL DIARRHEA WITH LACK OF KNOWLEDGE AND ECONOMICS OF HOW THINGS WORK. | Climate change occurs in cycles, up and down, it's been like this for BILLIONS of years. https://www.popularmechanics.com/science/environment/a25835969/power-capture-carbon-dioxide-coal-plants/ …", "Yes and at one time scientists thought the world what is flat. You'll have to prove beyond the shadow of a doubt that we can actually do something to change the climate.First of all only the Creator can you control the climate.climate change has been going on since the beginning | Can't you make everybody happy and go back to serving drinks. nobody needs your extreme left socialist borderline communist ideas | WOW pic.twitter.com/c0VtCLrlO5 | Is that a socialist cat Cortez?? Cortez are you cool with having animals in the bodega?? Cat shit and piss. Cortez you're a disgrace | We are all appointed to die once!! No one is making it out of here alive. If it happens in 10, 20 or hundred years to all of us!  Than that's that. Nothing anyone can do!! I suggest you start praying to the Creator if you're that scared | You certainly sound upset and scared to bring life into the world I don't blame you. The way you think proves that you shouldn't bring children into the world | Boy you're putting words into my mouth!! If you want to have children it's a personal decision!! Quit scaring them saying they're all going to die it's fear-mongering and I don't accept that's what a behavior. It's just simply wrong. Live the life you'd like. | She lives in a very expensive building. I'm sure they made arrangements it's just that she likes to cause trouble what don't you get | !!!!?? Stop using fear you don't know when this world is going to end basing that on decision on whether or not you should have children is your own decision don't drag other people into it | One time people thought the Earth was flat. One time there was a threat to the ozone layer. Both times they were wrong. We know there's climate change can change since the beginning of time. Stop scaring the millennium!! It's sad fear-mongering | Thanks to people like @AOC . They will penalize the wealthy for being wealthy they will rip out the middle class. Put everyone into poverty. And the generation that gets everything for free will be taxed 80 to 90% of their income to pay for the free. | So when they lend money to a bar restaurant. The banks know there's a possibility that someone might get drunk and hurt somebody on the road. Or hurt somebody anywhere at the home at The Establishment itself. So let's hold financial institutions liable!! Ur a moron | The only green New deal she got was a $200,000 a year income and probably even more than that when she does these talk shows. She'll be a millionaire by the end of the year. Let's see how much she helps with that money | Yes 9-11 was just fine!! We Americans forgive and forget!! Pulse nightclub in Florida in the name of radical jihadist. And @illhanOmarpress . Her racist rhetoric it's all good. | Aren't you the one who sang you can't do this you can't eat that no more fossil fuel. No more planes for automobiles. Eat less meat become a vegetarian do what I tell you I'm your new Hitler. Putting you in charge was the worst thing that happened to America since Obama | Having a D next to your name doesn't give you the right to act like a Hitler!!! | No!! Stop telling people what to do!  Ur not smart enough to say what's right or wrong!  Ur STUPID! STOP PUSHING YOUR GENDER YOUR VIEWS IN YOUR EXTREME LEFT SOCIALISTIC COMMANDMENTS ON US. WE WILL NEVER BE A COMMUNIST OR SOCIALIST COUNTRY | You can't be that STUPID!!! YOU SOUND LIKE THERE DELIBERATELY KILLING YOUNG KIDS AND RAPING THEM!! IF YOU BELIEVE THIS YOU'RE INSANE AND NEED TO RESIGN IMMEDIATELY | What you don't speak on is that there Rich liberal Democrats!! Who are bribing everybody. Liberal Democrats have been doing this forever and the ones taking the braves liberal Democrats | No!! Stop telling everyone what to do with their money do what you want with your money!  Stop being a communist America will never be a communist state | @AOC is the biggest FOOL OF THEM ALL!! YOU'RE A DISGRACE TO MY PEOPLE. MY HISPANIC HERITAGE CAN'T STAND YOU | No!! Stop forcing people to do what you want we should have a right to make her own decision. Please resign you make me sick | Someone should hold you down and inject you and get you thinking normal you radical left-wing nut Job. You know different from a jihadist or Nazi with your way of thinking | Blah blah blah blah blah ACO I pray that you never reproduce | So now you're a doctor and know what treatment to give these wild kids. Why do Democrats always want to get involved in the healthcare System they not doctors they're actually morons!! I wish you would protect u.s. citizens the way she protects illegal immigrants!!! | you protect immigrants like you should be protecting United States citizens especially the ones that voted you in, not the illegal ones who voted for u!! The legal US citizens. Enjoy your years, next election you'll be out. I hope ur gone in 2 years | Its intent was if an illegal or an insane person tries to get a gun permit it's to be reported to the authorities. But you don't want the illegal immigrants to be  reported. because they might send them back and that's your voter base in the future!! You're disgusting", "Why is this tape delayed?  Is #MSNBC cutting out the non-flattering portions of this train wreck? | People are leaving New York because of insanely high taxes...  don’t believe me, just ask @AOC’s mom.  | I agree @aoc has refused to debate a single person from the republican side; even after being offered in excess of $100,000 | Let me guess.... nobody from the right will be allowed to ask questions? | If you’re look to get real advice on this, I encourage you to follow @RealCandaceO @staceydash @CondoleezzaRice @MiaBLove @YoungKimCD39... unlike @AOC, these woman as actually super intelligent, independent and were not picked via a ‘candidate audition’ - aoc is not smart!  AVOID | Actually, we’d prefer that they know the branches of government and how many months are in a year, before they start spouting off their ‘visions’ | That is a valid point. | The only institutional bias going on, is the stupidity running through your head! | I find it ironic, that the kids protesting and missing school.... are probably the ones who need school the most. | Oh shit... @SpeakerPelosi may be unstable, but the lady isn’t stupid.  She’s using @AOC like a wet rag.  Letting her utter complete stupidity while passively trashing her...  in a year and a half,  @SpeakerPelosi will be considered the “reasonable liberal” |   is this satire?  The freshman class has been the political gods gift to the Republican Party.  Since they were sworn in their approval numbers have been tanking... while republicans have been steadily increasing...  why do you think @SpeakerPelosiis so pissed? | Actually, what he posted is mostly true..  except she cost about 25k direct jobs and another 100k auxiliary jobs - and has more than 2 ethics complaints... | When you say Justice Dems, are you talking about the casting couch company? | Again, this video is embarrassing and cringy... You’re like the dumber-hipper version of @SenWarren.  Btw... is that the first beer she’s ever opened!? pic.twitter.com/QuzHfPxxGU | It’s pretty well documented that you went to a casting couch and were selected, out of 10,000 dem candidates, to run and be funded by the @justicedems.  The sad thing is, out of 10,000... you were the best they could find!? | “Reject the logic that says, because someone is elected to office means they are somehow smart” - | Welp... another liberal deletes her tweets. Dang. | That’s because you’re stupid  | Are you in middle school? | You have no idea what you’re trying to say, do you? | Has a chance to indoctrinate some gullible middle schoolers huh?  Good for you! | Grow up, you immature child. | It’s come from the grocery store, right? | Actually... that’s what the opposite of a Representative Republic looks like. Also, go try and buy a gun somewhere and not have to take a background check... | Yep... great for the @gop | You don’t actually think she has mentalstrength do you? |  her approval has tanked to 31%, she is verifiably stupid and her constituents are starting to see it.  This twit will be primaried before she has any chance of being re-elected. | #every. #single. #time. | But... it’s not a good policy, in fact, it’s a very bad policy and it’s roots and substance were born from intellectual stupidity.  You can try to “frame” your defense of it anyway you want... but it doesn’t change reality. | Reading an @AOC thread of her supporters... is probably what the casting for the movie Idiocracy was like. | And you had a beer... in the most awkward video in Instagram history. | Lol..., that’s her job. | Oh how nice... 2 year fake investigation didn't work out, so now make up new accusations! | Reservations that refuse federal money, vastly outperform almost every other demo in America... | Of course you could hear a pin drop - when in the presence of screeching, fake accent, hyperbolic outrage and utter stupidity.... people tend to watch in disbelief and annoyance. | I think before the next election - your ass should get Billy Madison’d and be forced to compete every grade level of school k - 12 before you’re able to run again! | I would guess about 50% is trolling... #AOC and the #GND is the best thing that’s happened for the Republican Party in decades. | Congrats on your new 21% approval rating. \nThe Over/Under on your usage of the word “like” is 40.5 for tonight’s Town Hall. | Less than 5% of Black and Hispanic kids chose to take the test and/or apply. | Well, and the funny thing is... NYC does allow school to chose kids based on affirmative action. This school in particular, by law, MUST chose only the highest exam scores taken. | Agreed! | I miswrote that* does not allow* it should say | 31% overall approval.  0-57.  20% independent approval.  Please never leave the democrat party! | Nobody is reaching... this girl is literally the dumbest person ever elected in American politics - and it’s not even close. | Sorry... he knows the 3 Branches of Government and he knows the difference between an incentive and cash on hand.  Also... since in office he’s broken almost every Econ record... | Great reply  your love of her makes sense now. | So... you’re saying a paid into time of system...  of which both are badly performing, somehow compares to the 90 trillion dollar tear down and rebuild fantasy of yours?  @AOC do you have any idea how ss even came about? | I’d love to join, will you be engaging in debate with the opppsite side... or just answering scripted softball questions? | Oh that’s weird... last I checked, Blacks and Latinos are leaving the @DNC in droves.  Seems like we have a lot more in common than you think. | Too bad. The socialist idea of ‘money for all’ and ‘college for all’ - via government backed loans caused this.  Maybe don’t take out a quarter million in loans huh? | Thank you for educating!  Also important to note... despite only representing 15% of kids in the NYC Public School system - more Asian kids chose to take the exam than black and hispanic students, combined. | Girl, you have officially gone off the deep end... again. | “I’m just an actress trying my best to remember the lines fed to me by @justicedems.” | Do you know where Iowa is? | Pretty sad that you triggered liberal idiots would go to this extent just to get a guy out of office.  Plan A didn’t work - so on to plan B I guess. Losers. | They are talking about #monopoly, the legal term, not #Monopoly the board game... | It is unfortunate that the Department of Education has essentially ruined public school; and in turn, warped it into the American version of a USSR style indoctrination camp. | Make sure you don’t funnel it all to your spouse, I mean boyfriend. https://twitter.com/cheneyshow/status/1112449315702632448?s=21 … | The green new deal, that the @justicedems are pushing, is now going to solve addiction? |  https://twitter.com/cheneyshow/status/1112449315702632448?s=21 …", "What you’re saying is you want to bribe an aggrieved segment with free income and health care to go along with the pain of ridiculously expensive energy. Problem: Who pays for that crap?  You will say, “Wealthy people or corp.s” BS. Not enough there to pay for it. | Here’s cold reality for the Green New Deal!! https://www.inforum.com/news/984129-Extreme-cold-shuts-down-North-Dakota-wind-farms-energizing-debate-on-their-reliability … | Dark Money Superstar!!! | Let’s let PR become an independent island nation. They can get lots of aid from UN, community of nations and the USA. | How do the GND captains of industry propose to make this stuff a reality. Order GM to produce electric cars in Lordstown? Subsidize the electric cars? Electric cars don’t solve a GHG problem unless the power base is shifted first. Heck, Congress can’t even condemn anti-Semitism. | Where is the cost benefit analysis and alternatives evaluation. The principles of the National Environmental Policy Act require alternatives analysis. The GND is a porcine Frankenstein stitched together to support an irresponsible emotional pork barrel appeal. #GreenOink! | Should not be the case. Can’t have “one man one vote” representation and dillute that with non-voters. Of course the left wants to vote non citizens. We’ll see how that plays out. | I am not demeaning the contributions of immigtants. In the 1960s the SCOTUS formulated the “one man one vote principlefor legislative apportionment. To square with that Congress should represent those who legally vote. Longstanding policy has been that citizens vote. | Show the evidence that these extreme weather events are caused by warming. The IPCC has consistently written we don’t have sufficient science to make the linkage & it could be cheaper to adapt than invest in iffy energy that’s dangerously untested. Who’s your economist? Mary J? | I won’t quibble about the duality of the power ploy but citizen representation meets my own sense of fairness. You are free to believe Non-citizens ought to count. | Non-citizens should NOT count for apportionment. There’s no compelling case for counting them. | Of course we know the slavers insisted on counting the slaves to advance the cause of sustaining slavery by increasing Southern representation in Congress. Counting non-citizens is also political power ploy. Are you serious about pleading the Deep South defense? | Justice Democrats? Nonsense. They are the Justin Democrats as in Justin Fairfax. They do nothing to root him out. They preach but don’t practice. | We need to also identify the “climate hysteriac”\n— a person so seized with climate change that they cast aside rational thought, refuse to analyze alternatives, costs/benefits, and rashly advocate extreme plans like GND. They harm the cause of a rational response. | That’s a lame defense of a take over of the US energy sector. And how does this “existential threat” justify a government takeover of health care and a Jaun Perron tax system. Stick to the problem. GND is just cheap demagoguery! | What a moron to construct such a wild a— theory of liabilty. If she takes Uber, she benefits from lower gas prices facilitated by the pipeline. @AOC is more culpable for impacts of pipeline than Sloan!  It’s good everyone understands she’s a ditz! How many more Dems like this? | Maybe we can start a litany of the imperfect Democrats. We can start.\n— Woodrow Wilson was a white supremacist. \n— Bill Clinton was a sexual predator \n— Hilary enabled Bill\n— FDR ignored the holocaust\n— Senate Dems post New Deal worked with southerners to filibuster Civil Rights | It’s absolutely true. In terms of our economic future, the Green New Deal is the bottom. We could only go up. That’s merely an observation that GND is a collection of linked and extreme alternatives formulated without rigorous cost benefit analysis. Who would contribute to this? | Their prating and babbling helps the cause of traditional conservative principles and values. They are so crazy. Please encourage them to continue talking crazy.", "‘The last 8 years’\n\nSo, all of it?\n\nAlso, remember how Obama inherited the Recession and got things building upwards again, in part through ‘socialist’ policies like ACA, setting a growth rate that is still continuing to this day? | It’s also worth noting that higher taxation on the rich was done to great effect from the end of WWII through to the 60’s, which is when there was one of the largest booms in American economic growth.\n\nThen major tax overhauls started protecting the rich. And things slowed. | She’s the one fighting to reduce taxation on lower income individuals and families while also expanding how much they earn. | Denmark also has a much smaller level of wealth inequality, and an overall higher quality of life index. | Every member of congress is given a budget for paying their staff. AOC has opted to use that budget to its full extent, rather than paying minimums to her staff.\n\nSo while they are being paid more, there is no higher cost to taxpayers. The money is already allocated. | How long has the running joke been, ‘I got my college degree to be a barrista’? | Social-capitalism does however, as evidenced by most 1st world nations having some blend of the two. | If someone can start a company and make it in life, great. More power to them.\n\nDo they have to do it paying their employees so little they need second or third jobs to stay afloat? | Regardless of where we stand on this issue, I do think we can al agree on the irony of the generation built on government subsidization being so against it now. | Local woman is all about people thinkin for themselves while also proudly sporting the banner of a man who outright lies constantly. pic.twitter.com/zO0Zkl184c | Considering she is advocating here for something she has long made part of her platform that got her elected, I’d dare argue she is, in fact, speaking to her constituents. | Which fake news about Mueller exactly? He has found a huge number of crimes in Trumps direct orbit, and based on indictements proof a very large effort was made by a foreign power to help him be elected. | Further, cows primarily release methane through burps, and the amount can be vastly reduced by changing their diet. | Notice the first lines. \n\n“...a full and thorough investigation of the Russian government’s efforts to interfere in the 2016 presidential election...”\n\nHe is also, relevant to b)(ii), authorized to investigate any other crimes uncovered.Before the report, he has done this. pic.twitter.com/au6YeMKULY | To own the libs, clearly.\n\n(Also careful mentioning Trek. A socialist utopia where there is no money, discrimination, and people devote themselves to what they love? You’ll make their heads explode) | to develop new technologies and techniques that are much harder to develop in more industrially driven production nations. Think of it as an investment; US capital is put into developing the technology, and then other nations can buy it from the US, increasing US GDP.(/Fin) | By a department that Trump cut funds from, no less. | Eliminate outright, no.\n\nBut you can mitigate the symptoms and reduce the damage. | America was paying to reduce its own emissions. At 14% of total world wide emissions, it is the second highest producer, and thus has nearly the most to reduce (beaten by China only).\n\nIt is also a service-driven nation, and thus well positioned (/1) | Actually, the goal is to improve air travel so as to be less polluting, while also investing in infrastructure to provide more options that are less expensive and more green in place of air travel. | Only three nations have not committed to lowering greenhouse emissions.\n\nOne of them used to also be committed to it, but then Trump was elected. | That’s 14% of total world wide.\n\nOnly China produces more out of nearly 300 nations.\n\nAlso worth noting America is well positioned to develop tech and methods that can then be sold worldwide. | Heavy Boots. | Which leads to disparity in the education received.\n\nIt creates a natural barrier; kids from more poverty-prone areas receive lower tiers of education, making it more difficult to move themselves out of poverty, making it more likely their children receive the same. | Ah yes, the old ‘you’re not from the country so you have no idea, city slicker’ argument. Well played.\n\nCan you dispute that the majority of methane produced by cows comes from burps? Nows your time to show up a dumb city hippy, c’mon now! | You seem to have missed some details.\n\nGND will not ‘outlaw’ air travel, simply try to reduce dependancy on it by expanding alternatives.\n\n(Also, we’re both using an instantaneous form of long distance communication that renders cross country travel for meetings needless). | She actuall proposes creating more eco friendly alternatives widely available, not getting rid of them. | You’re really bouncing around here.\n\nFirst, no one is saying smaller states arent important. Not sure where you get that from.\n\nSecond, no one is claimin. It is a quick and easy fix.\n\nThird, I’m curious where you get that cost? | Electric cars vs traditional gas guzzlers, high speed trains, more fuel efficient airplanes, more robust public transportation and infrastructure. | Speaking as someone whose brother was born premature, was known to be born premature, but whose mother was pressured to carry him to term knowing he likely wouldnt survive (spoiler, he didnt), only to warch him suffer for two weeks before finally being allowed to pass?(/1) | Mueller has turned a profit and resulted in the exposure of multiple crimes.\n\nBenghazi was how much, how long and how little? | Mueller has cost the government approximately $17million.\n\nDue to the crimes uncovered by him, Paul Manafort has had to forfeit $22million.\n\nProfit. | ‘Grug hear from Dug that water rise!’\n\n‘Dug just want communal housing so him not eaten by sabertooth. Ignore Dug!’ | And, all this having preceeded my birth, which means it could have prevented my own conception from occuring out of fear and pain?\n\nI consider a child viable when it is born and survives.\n\nBefore that, they arent yet. It’s a simple binary distinction to me.(/Fin) | She did categorically deny it. Try to pay attention for more than a few days sweety. | Electric engines are more eco friendly than a diesel engine. And while current methods have room for improvement, the whole point of GND is to invest in that improvement.\n\nSame with public transportation. Bad now? Why not make it better. | Then as I said in my other tweet I stand corrected and humbled. | Let me see if I follow you here.\n\nBecause she doesnt have the savings to do this, she is demonstrating how privelleged she is compared to pelple who do not have the savings to do that? | Fair enough. I’ll answer it like this.\n\nI don’t consider a fetus alive. Not in the same way a child is.\n\nIt’s a work in progress. It isn’t yet born. It isn’t developed fully.\n\nIt’s a collection of cells that will be a child someday, but arent yet.(/1) | If the mother is at risk of serious harm or death from the birth, is it right to sacrifice her for a child who might grow up without her?\n\nWhat about if she’s raped? Is it right to force that on her?\n\nWhat about a mother who is unable to care for the child or provide for it? | Except for abortion. Or free trade. Religions a grey area, but if you want to protest let’s work on reducing that right too. Also really important that elections are as difficult to partake in as possible.\n\nBut yeah! Choice!", "I'm 51. I remember when we had politicians like aoc,Bernie,illham,and rokhana. They were not unusual\n They were the norm\nThen they shot the Kennedy brothers and we ended up here\nLong live our justice democrats\nGod speed to our progressives to take back our government | Everyone saying they want to move when socialism wins..again pic.twitter.com/4EBiz3D99V | They can't wrap their minds around democracy\nWe,justice democrats,find,support and run progressive politicians like aoc. They are only beholden to us\n It's called democracy\n This is what it used to be\nPeople like aoc and Bernie were the norm\nI remember | It's because,say it with me, they are republicans. | Not that capitalism alone is bad | That's a justice democrat right there | Of justice democrats taking that party back to the people | Omg.give it a rest\nEveryone sees capitalism has failed. | She's a justice democrat\nShe's not corrupt\nIf the other politicians don't want to lose their seats they better begin acting just like her and fighting for the people instead of Billionaires AND.corporations huh? | Too cute | She's only beholden to us | That guy used to be in the Hillary campaign so I actually think he did that on purpose..maybe just me but that was some fishy stuff | I'm actually afraid people are so afraid of change they will protect the establishment | Preaching to the choir\nI've saying this for 25 years\nThank you all\nMedicare would have saved my daughter\nI hope it can save me\nFight for us | I know right | You people look ridiculous | We know it goes to the justice democrats\nWe are the justice democrats\nNothing shady about people coming together for a common goal. Its a people pac. | Every country has socialism\nWe so too\nRedirecting money to give quality of care to citizens is what most countries do. | I really wish you pe would learn to read\nScientists say pic.twitter.com/R86AAIWRMr | We have the money.that is a ridiculous right wing talking point | We have a government by the people for the people..ever heard of it? | She intimidates you..good | You have to make up b.s. because you can't argue her on policy |  pic.twitter.com/mMVz3FVhoy |  pic.twitter.com/2Tv8cAbHw0 | We have too many people denying the urgent needs we must have. While fires ,tornadoes,and floods along with lack of healthcare kill and displace people they shut their eyes and say it's not happening. I'm building a damn bunker. They will see it burn down . | Every other country does what we are going to do. We can absolutely afford it. | Because you take the profit out preying on people | #AOC  | Candace is an idiot | Every country has socialism. It's required to ensure the quality of life for the citizens | Your a small man. Its obvious | My son is navy...aoc is the future and she's helping remove all the corrupt corporate trash | A jihab is no different than this pic.twitter.com/kzpI4bcAJE | While you support the establishment destroying this country..yeah..I'm pathetic\nGo troll someone who cares | Actually I have pic.twitter.com/TLEvjpWhON | Somebody needs to be | This is America\nCapitalism has failed\nPeople are suffering and dying\nThis is how Rome fell pic.twitter.com/E9DFTscNQv | She did as her constituents asked her do. | When the majority of the country hates trump.\nNot worried | A bad one", "This is 'THE SETTLEMENT CULTURE\" we have developed in the USA.  IT IS HORRIBLE.  BECAUSE WE HAVE THIS 'SETTLEMENT CULTURE,' CORPORATIONS DO THE MATH AND FIGURE IT'S WORTH THE MONEY THEY'LL PAY OUT IN SETTLEMENT TO BREAK ****WHATEVER DAMN LAW WE'RE TALKING ABOUT.  MASTERS OF THIS | ARE THE KOCHS (oil and other manufacturing pollution,) the MERCERS (tax evasion -- still just hanging in mid-air like an immortal cloud,  the DeVos Family -  tax evasion/business scams (Betsy DeVos' was born into a family that got rich on Amway), and all the big energy companies. | \"THE SETTLEMENT CULTURE\" has become one of the PRIMARY FEATURES OF AMERICAN SOCIETY -- THE OIL 'IN THE WHEELS OF BUSINESS.'  And so it was -- with the housing-market  crash of 2008 and the BANKS. | This has just become \"THE WAY LIFE IS LIVED IN THE USA.\"  Corporations - banks -- and the elite rich KNOW IT AND EXPECT IT AND PLAY IT.   Now it's leaking into JAIL SENTENCES.  LOOK AT PAUL  MANAFORT.  HE WORKED OUT HIS OWN SETTLEMENT AGREEMENT. | One could suggest that \"It is a risk that Wells Fargo is willing to take BECAUSE:  When the nasty-stuff HITS THE FAN --- everyone involved on the corporate end of the project settles for a nickel per millions of dollars of loss to the environment and impacted communities. | Hello AOC and TEAM;  I'd like to take this opportunity to ask you (with deep sincerity and a sense of urgency) to begin an open communication with @JennyCohn1 who on Twitterhas been visibly leading THE FIGHT for Election Integrity. Jenny, with 20 years experience as a lawyer; | turned her full attention 2 years ago to an unrelenting study of electronic voting equipment of all types, being used in the USA currently, including 'new' E-machines now being purchased by many state -- after a 'VERY HARD SELL' by ES&S.  Many of these 'new' voting machines have | when they attempt to verify that their votes were coded properly in the machines, and will be counted in the election according to their choices.   PLEASE, PLEASE, make contact with @jennycohn1 and others she is working with.  Election 2020 is going to 'hit us over the head' in | no time.    This country has an URGENT, SEVERE PROBLEM with UNRELIABILITY OF VOTES CAST BY ITS CITIZENS --- conferring erroneous results on the outcomes of elections.   If voters WHO BELIEVE THEY HAVE CHOSEN DEMOCRATIC CANDIDATES ON VOTING MACHINES WIND UP HAVING VOTED FOR | REPUBLICAN CANDIDATES --- we will have another disastrous election outcome to deal with affecting our ability to deal with climate change and gun control.  AGAIN - I URGE YOU to ESTABLISH A WORKING RELATIONSHIP WITH @JENNYCOHN1 VIA TWITTER and then to BEGIN A SERIOUS FULL-TIME | been manufactured with \"switching devices\" IN THEM - which can be turned on and off, and when turned on ARE EXPRESSLY THERE TO SWITCH VOTES chosen by voting citizens to UN-MADE AND CHOICES.   Many machines read out voting results in BAR CODING which is incomprehensible to voters | FOCUSED WORKING GROUP - RESULTING IN HEARING IN THE U.S. HOUSE OF REPRESENTATIVES, ON SWITCHING TO HAND-MARKED PAPER BALLOTS ONLY WITH STRICTLY CONTROLLED AND MONITORED COUNTS.   Thank you for your consideration | EXTREMELY IMPORTANT TO UNDERSTAND.  THANK YOU.   I hope some day you will be the President of the country."], ["Enjoy your dinner @AOC sheep pic.twitter.com/dGG1XXxWUo | Order you new @AOC T-shirt now pic.twitter.com/qfBMoTwk4d | This is what happens when all you've done in life is be a bartender listening to drunk idiots and thinking what they said was so smart | Her tweet was really racist | Yous gots Black staff I's so glads to hears that Boss \nMaster @AOC yous a goods women | Welcome to the new Soviet Union by @AOC | Master boss say she gots Black staff | This is China and India \nClimate Change is not an American issue it's a global issue\nThe New Green Deal fixes nothing pic.twitter.com/3ivikPNO1C | Poor abused @AOC pic.twitter.com/rZBzFbafOV | Wake up kids @AOC New Green Deal is worse than a joke it has no details \nYes Climate Change needs to be handled over the next 100 yrs but on a global level it's not only an American issue \nHave kids teach them maybe one of them will grow up to save our planet | What does @AOC New Green Deal Mean?\nNo Trees which means no oxygen \nNo Life \nAOC is right the world will end in 12 yrs if we stop crazy @TheDemocrats pic.twitter.com/SNKKqwGQ0J | This is a scary statement | You are same as the old boss and we won't be fooled again \nGoodbye @AOC 2020 | If defending the Jewish people makes me ugly, then I'm proud to be ugly | We can automate your job @AOC pic.twitter.com/5JWdDvZdW7 | Your right @AOC because of you and your party won't fund a Wall and more bed space we have no room Stand up America Vote Democrats out of office 2020 | The Rasmussen Reports daily Presidential Tracking Poll for Tuesday shows that 53% of Likely U.S. Voters approve of President Trump’s job performance. Forty-five percent (45%) disapprove.\nStart crying now @TheDemocrats \n2020 is @realDonaldTrump time pic.twitter.com/gt6mPDEknh | She hates Jews and it appears you do too \nThere is racism based on the color of someones skin then there is racism based upon someones religion \nYou are a religious racist discriminating against those with different beliefs | Here is what you should have tweeted\nPlease every Mosque in America tomorrow is Friday provide extra security, in today's world events like what happened in New Zealand can happen here | Stop your hate gets the facts first | Master Boss @AOC why didn't you take the subway, you took a van that gets 17MPG what happened was your black staff not there to carry you? | Yes and the left your party buys off the average American to get their rich kids in | In your district only 34% of voters support you, the @DNC/GOP are working together to make sure you lose in 2020 | Who paid to get you into college | @MotherJones \nHa ha ha ha ha ha | WOW, you are a hateful nutball | How much are you charging them $600,000 each? | Again from @CNN guns aren't legal in New Zealand | Robert Byrd pic.twitter.com/kJc4msTYKI | You asked what the @GOP has done for America @AOC\nhere are the facts The 13th, 14th, and 15th Amendments, the 19th Amendment \nWhat have @TheDemocrats Done???\nWaiting for your reply | Please give us one law that @TheDemocrats have passed in the past 29 yrs that have made Americans lives better waiting for your reply | We are asking that you resign now you’ve proved to be the wrong person to lead @TheDemocrats #1 you never paid taxes you owe but you want Americans to pay higher taxes #2 you threw away plastic bags because recycling was hard to do #3 you move $1,000,000 in PAC money to a Corp | Want to ask you about the $1,870 you owe the State of New York for unpaided taxes on a company you had, normally something this small means nothing but for you its a matter of character which it seems you are lacking\nPlease tell America why you've never paid the taxes you owe | 3 months in office @AOC stole $885,000 @RashidaTlaib took $35,000 illegally @IIhanMN being called out for hating Jews, yes women in office is needed but not criminals and haters | The 13th, 14th, and 15th Amendments, known collectively as the Civil War Amendments, were designed to ensure equality for recently emancipated slaves. The 13th Amendment banned slavery and all involuntary servitude, except in the case of punishment for a crime. @GOP did this | The Drunk Tweets begin | Please tell all of America heck the world how Boss God @AOC will stop hurricanes | 12 yrs till the end of the world 2 yrs before a Dem can take power 3 yrs for \nHouse-Senate to pass New Green Deal that leaves 7yrs to rebuild all of America \nYou so crazy girl | @AOC New Green Deal pic.twitter.com/WNGUruZCCA | How would your Green Fake Deal stop hurricanes, what you think your God now? | Dear @AOC this is your party pic.twitter.com/LJ6lTWJ17V | Another @AOC lie | 2020 is coming and you need to lose your 800,000 real twitter followers won't help you and the @DNC/@GOP want you gone and we are working to make sure you are | Which party voted for the 19th amendment?\nHouse of Representatives passed the 19th Amendment May 1919 it did so by 304 votes to 89, Democrats only 104 to 70 in favor but Republicans 200 to 19. In the Senate, Democrats were in favor only by 20 to 17 the GOP voted for it by 36 to 8 | You defending @IlhanMN hate makes you a lesser person, you claim to stand up for the people that means all the people, excusing hate means you condone it | They voted no because it was watered down so much and failed to call out @IlhanMN over her hateful tweets | Wow who wrote this for you | Elizabeth Báthory and you have a lot in common pic.twitter.com/Ax2BlM5zYh | @AOC grades\nEconomics History Science English FAILED\nArrogance A++ | Yes another @TheDemocrats who cares nothing about Black youth\nBill de Blasio\n@BilldeBlasio | Drunk tweeting | I finally figured out who you remind me of pic.twitter.com/7sekww7Pu3 | We will see won't we if you've broken the law jail if not then no jail | Can we all help poor @AOC save the environment everyone needs to send her a canvas shopping bag our environmental master boss uses plastic bags pic.twitter.com/0Y2oQkLWk3 | Your the Boss so go for it primary all of them and watch as you lose every seat including yours we have people in your district and many who voted for you want you out in 2020 | We'll in inform the Judge when you are sentenced, that you want more time | Yes please get her drunk again so she can send out more Drunk Tweets | @AOC now is now God she can stop hurricanes | OH No a mistake was made in a title bar on a TV show the world is ending\nWe no longer have 11 yrs 328 days to live the world is ending now\n\nPetty @AOC just like you are | The border at ‘Breaking Point’ as More than 76,000 Migrants Cross in a Month  https://nyti.ms/2SMMwHk  \nNational Emergency @SpeakerPelosi \nThis is from the @nytimes TODAY | You have to be the dumbest person ever to serve in Congress | Stop drinking and tweeting | A one term wonder | Can you tell us about the $1,000,000 you took in donations that have gone into one of your staffs companies\nwaiting on you to answer a 35 page compliant has been filed against you\nthese charges are criminal | Read https://www.foxnews.com/science/earth-is-greener-today-than-it-was-20-years-ago-thanks-to-human-activity-counterintuitive-nasa-study-shows … | You say we only have 12 yrs to live and you eat hamburgers fly around, take gas guzzling cars\nMaster Boss you are a fake | And @realDonaldTrump was the first President to care he got Prison reform passed", "Yeah speaker wrap it up! | Controlled demolition World Trade Center buildings. United States government is being investigated buy a jury in New York right now.\n\nLook for yourself \nlawyers committee\n http://LCFOR911.ORG  | Grand jury seated in the state of New York investigating criminal acts by the United States government 9-11-2001.\nControlled demolition\n look for yourself\n http://LCFOR911.ORG  | There's this thing it's called video. You know you can go back and watch it.\n\n9/11 was done by the \ngovernment. Grand jury seated right now in New York investigating criminal acts by the United States. controlled demolition World Trade Center buildings\n http://LCFOR911.ORG  | semantics\n http://LCFOR911.ORG  | what I'm trying to tell you there is a grand jury. They've been seated since November 2018.  they have subpoenaed plenty of people from the Bush Administration already. indictments will follow.\n\nLawyers committee\n http://LCFOR911.ORG  | The United States government killed those people!\nGrand jury seated in New York right now investigating criminal Acts. controlled demolition World Trade Center buildings. \n\nLook for yourself\n http://LCFOR911.ORG  | Lawyers committee, Architects and engineers have been trying for years to get a grand jury seated to hear evidence of the United States government's involvement in 9/11 2001.\nI know people don't want to believe their government can do this. \nGo look\n http://LCFOR911.ORG  | You keep saying murder is murder. You're right murder is murder. But 9-11-2001 is far more than just the people who were killed. #Wars were started. Liberties were lost. Trillions of Untold trillions of dollars have been spent on killing. And your #government continues to lie. | I don't know why you automatically assume I'm a Democrat cuz I'm not and I'm not a republican either I'm not an independent. I'm an American | Controlled demolition World Trade Center buildings. Grand jury seated right now in New York investigating government criminal Acts.\n\nLook for yourself\n http://LCFOR911.ORG  lawyers committee | 9-11-2001 was done by the United States government. Grand jury seated in New York investigating criminal acts by the United States government\nControlled demolition lawyers committee\n http://LCFOR911.ORG  | the reason why we spend all that money on your great military. is because the United States government has got people like you fooled into thinking terrorists are out to get us.\n9-11-2001 was done by the United States government. Controlled demolition\n http://LCFOR911.ORG  | Do you know who else is a killer and a tyrant? the United States government\n\nGrand jury seated in the state of New York as of November 2018. investigating controlled demolition World Trade Center buildings. \n\nLook for yourself \nlawyers committee\n http://LCFOR911.ORG  | If representative Cortez wants to be re-elected she needs to let the people of New York know that there is a grand jury investigating us gov controlled demolition World Trade Center buildings 9-11-2001\n Google 9/11 grand jury \n#lawyers #committee \n http://LCFOR911.ORG  | Let's go New Yorkers support the family members of those people who lost their lives on 9/11 2001 they need you.\nGoogle 9/11 grand jury\n#lawyers #committee\n http://LCFOR911.ORG  | New Yorkers contact all your representatives congressman and ask them why there has been no discussion about the grand jury in New York investigating US gov controlled demolition World Trade Center buildings Google 9/11 grand jury #lawyers #committee \n http://LCFOR911.ORG  | it's time to make the people that were really responsible for 9/11 2001 pay the consequences. Grand jury seated in the state of New York investigating us gov controlled demolition World Trade Center buildings Google 9/11 grand jury #lawyers #committee\n http://LCFOR911.ORG  | The people of New York should be angry at their two senators and their representatives. They are not letting you know about the grand jury investigating us gov controlled demolition World Trade Center buildings 911 Google 9/11 grand jury #lawyers #committee | New Yorker think back at how angry you were the day of 9-11-2001. Now channel that anger into action. Contact your senators and representatives and ask them why they are being silent about the grand jury seated in New York investigating us gov \nGoogle 9/11 grand jury | If the government has nothing to hide then why won't they let the public know about this grand jury.\n\nGoogle 9/11 grand jury\n#lawyers #committee\n http://LCFOR911.ORG http://Ae911truth.Org  | All these politicians want to be on social media we need to let them know about the grand jury investigating u.s. government 9-11-2001 controlled demolition\n\nGoogle 9/11 grand jury\n#lawyers #committee \n http://LCFOR911.ORG http://Ae911truth.org  | Representative Cortez Chuck Schumer and senator gillibrand refuse to tell the people of New York there is a grand jury seated investigating US #government controlled demolition World Trade Center buildings 911\nGoogle 9/11 grand jury.\n#Lawyers #committee \n http://LCFOR911.ORG ", "Very true.  When the government makes mistakes people should not try and repeat those mistake, but rather avoid making them again and trying to ensure that they don't happen again.  This is what @AOC is doing. I wish more politicians cared as much as she does. | These women, including you @AOC, are the protagonists in future history books. | Rules in Washington apparently only apply to male Republicans. | Fox News acts like they condemn statements by these two buffoons, but in reality it's what makes their base come back for more.  Fox News has a responsibility to FIRE these clowns for such remarks, not just pretend to reprimand them. | Rules apparently only apply to Democrats. | Another example of big corporations putting the interest of their shareholders over the interest of the country, the American people, and the environment.  This is why we need more regulations when it comes to environmental concerns, not less! | Laura Ingraham is just doing the “Fox News Thing.”  In other words, she’s spreading lies , hate and propaganda. | Trump's already neglecting citizens in blue states, as well as Puerto Rico.  He's already threatened FEMA funds in California.  It's a disgrace.  This President does not have America's interests at heart.  He only has the interests of his voters at heart. | Thank you for being so real. | The opposite of progressive is “regressive.”  It should work everywhere except when you are reading history books. | Unlike Trump, you don’t need to frame a fake Time Magazine to hang on your wall. | Only crazy people use pictures of Ronald Reagan riding a Dinosaur that’s carrying an American flag, to try and prove a point. | Anyone who disagrees with this is really un-American. | I wouldn’t allow this lady to stand in the same building as my children.  She is the epitome of an evil witch. | These are all things that will benefit America in many ways, not just environmentally but economically as well.  These are all means to create new jobs.  I support the #GreenNewDeal | Yesterday GOP congressman Jim Jordan used an anti-Semitic trope to refer to @TomSteyer, and not a single GOP member reprimanded him.  I'm not even seeing Democratic leaders reprimanding him.  As a Jewish man, I am not offended by Ilhan's remarks but I am offended by Jordan's. | Yet this same man refuses to hold a vote to make the Mueller report public. Mitch McConnell must be voted out in 2020. | Thank you for being one of the few U.S. Representatives to really dig deeply into these actions.  Your line of questioning is really thought out and it really exposes these men for their conspiracy to attack the U.S. Constitution. | The GOP attacks her because what she’s doing is exposing their party. | The youth of this nation is inspiring.  The old white dudes in politics need to take some pointers from our future generations.  That's one bright spot in this country: Our youth! | This is Fox News trying to make their base think you are irrelevant. | The good thing is that there is no DOJ policy against indicting a sitting United States Secretary of Commerce. | When they don’t want something to be true, they just make up elaborate reasons for how and why their wishful thinking is true. They live in a fantasy world where they have imaginary power. | Lock Him Up! | What are the odds that the Trump family were accepted to college based on money rather than merits? | Violence in general should never be tolerated.  Hateful rhetoric by the U.S. President should never be tolerated either.  There comes a time when Americans need to stand up and say \"Enough is Enough\" to the hate. | This is all they do.  They create FAKE crimes so that crimes committed by Trump don’t seem as bad. | Why do these executives get off with merely paying fines from the companies they work for.  They are the ones making these decisions.  They deserve to go to prison! | Our next Episode of @KrassenCast focuses on another right wing media outlet, Big League Politics, that attacked you for bogus FEC allegation, but they are actually working with PACs themselves. | I believe a wall would end more lives than it would save.  If this money that Trump is trying to unconstitutionally take for the wall was to go to real problems like the opioid crisis, the amount of lives saved would be huge.  They simply don't care about American lives. | And Trump admitted to sexually assaulting women.  I’m pretty sure I’d take someone who drives cars before someone who assaults women, any day. | It's my opinion that every student who wants an education should have the same right to that education no matter the color of their skin, their religion, or their economic background.  We need to fix this mess, and give everyone a fair chance in America. | Another example of how every vote counts.  Thank you Democrats. | It’s the old GOP hacks who don’t know what they are talking about.  They don’t even understand how the internet works. | After this tweet, membership in the Girl Scouts will skyrocket, rightfully so. | This is amazing news.  Now only if we can get Trump’s people to stop as well. | Just another attempt by Conservatives to demean condemn females for being strong human beings.  If anything we should stop buying Trump Vodka because he's such a failure. Oh wait, Trump vodka no longer exists.  Another Trump failure. | As far as I'm concerned, when Fox News attacks you, you gain points in my book. To me, it's the biggest compliment any rational politician can be given. | Why is no one mentioning Jim Jordan's anti-Semitic trope that he tweeted just days ago?  Why is it OK for GOP members to be blatantly anti-Semitic, but not OK for Democrats to call out policy toward another country? | Our future generations will look back and ask, “how the hell were our Republican ancestors so dumb?” | BOOM! | Exactly.  Climate change is a REAL National Emergency. | You could save innocent children from a fire, and Fox News would find some way to try and make you look bad. | I am not against ICE, but I am against the way that President Trump is running ICE.  Congress needs to put an end to Trump’s policies, not an end to ICE. | The Immigrant Detention Centers are not run by ICE.  We need to stick to the facts.  Let's not stray from facts like the GOP is doing. | I am not defending ICE.  I just don't think they need to be abolished, and this is coming from someone who was a victim of an ICE raid.  They were formed to help protect us from terrorism.  I think that needs to be their main focus. | I don’t have the stomach or self control to deal with the other party. | Thank you @AOC for your well-thought out questions.  Together the Democrats are in fact cracking the armor around Trump's lies and corruption. | And then Mitch McConnell refuses to hold votes for policies that he knows both parties would support, simply because he is Trump’s stooge. | The only problem is that today’s wealthy Republicans and the corporations that fund the Republicans don’t care about society.  They just care about their power and wealth. | Why are Republicans so against progress?  What do they want to move this country back in time? | The same people calling taxpayer-funded healthcare \"socialism\", drive their kids on taxpayer-funded roads to taxpayer-funded schools on a daily basis, while they go to work and contribute to social security every week. | That’s why you and so many other Democrats like you were elected in 2018.  Let’s fix this shit! | All it is is fear mongering by the right.  There are so many on the right who don’t actually care about human lives or safety, but rather about holding onto office. | When our privacy no longer is embraced by the U.S. government and by U.S. corporations, we no longer are given the rights that the U.S. Constitution promises us.  We are individuals and we deserve our individual privacy. | Better than writing a check from a bank account that is made of laundered Russian rubles. | Hopefully our kids will be smart enough to actually do something about climate change. | Getting big money out of politics means that Republicans will no longer win elections, unless they start caring about facts, science and the people whom they represent. | Your 2024 Presidential campaign slogan should be, “Until you do it, I’m the boss.” | Republicans call you \"Radical.\"\nWe call you \"Refreshing.\" | And this isn’t a “socialistic idea.” It’s a humanitarian idea. | Please have the House Oversight Committee investigate this. https://hillreporter.com/bombshell-new-allegations-kushner-appears-to-be-extorting-qatari-government-29169 … | Keep doing what you are doing.  Don’t give up.  America needs you. | That’s because they are scared of you.  They know you are a winner who the American people embrace."], ["AOC derangement syndrome! pic.twitter.com/Fn4LOQA7gF | pos pic.twitter.com/yIqqKzOkbM", "She just questioned the ability of a lobbying organization, to have so much sway in Congress. AIPAC is a lobbying organization that tends to have a lot of sway. Just like the NRA has a lot of sway in Congress,  etc. | She's allowed to have a different view of Israel and varying lobbying groups that support it's interests influence. That doesn't mean she's being anti-Semitic. | It is disturbing that people get upset when a Congresswoman has a question about a group that promotes Israel. Had this been a Russian lobby or another country would there be this much outrage?", "Bill Nye is a fake scientist! | I think i have rag like the one you have on head and wipe the crap off the bottom of my shoe. This for the \"twit\", have given 90% of the 900K to the government, just wondering? Rash, have you put on a little weight, might want exercise more. | Blowhard Behar talking Bulls#$%!! What's new, MORONS! | #AlwaysOnCrack Alex, you have no data to back climate change. Stop the bulls#$%!! You should fire whomever writes your skits!! U r so funny, a few, 12k people, believe you or voted for you as a joke!! | GO MAGA!! BUILD THAT WALL! BUILD THAT WALL!", "Campaign finance and dark money. pic.twitter.com/v3eYOSaiwZ |  pic.twitter.com/ZOk2xUuJpH", "President candidate Yang has a good proposal to deal with student debt “pay 10% of income for 10 years then college loan will be forgiven and require colleges to reduce tuition (it has been rising fast) and increase trade education “", "There is a certain humility around not wanting to completely replace the existing system and it's because of unintended consequences. Tinkering at the edge is how you minimize unintended consequences rather than create radical social upheaval for *everyone*. pic.twitter.com/QBUd5bmavo", "A document circulated to reporters and posted *on the website* of the *author of the bill* discussed ending air travel and cattle emissions. These are not ~crazy lies~ Republicans invented https://twitter.com/jonfavs/status/1101913633171206144 …", "If you had a brain you'd know climate change is FAKE...like #fakenews. Climate is ever changing, cannot be static proven by ice history in Antarctica...you don't know this bc you don't research, you listen dummies...so you're in a line of dummies repeating what other dummies say! pic.twitter.com/js2YE8F48n | 2. Who are the scientist that scream global warming/we're all going to have HOT winters? Who do they work for/who employed them? How did they get their data? I don't take anything at face value and I do my research! If you want to be pissed at pollution, be pissed with #CHINA! | 1. Climate Control \"facts\" are FLAWED. Earth goes through natural checks and balances/climate changes REPEATEDLY, different phases of global temperatures rising/falling and this has happened for MILLIONS of years. Just because some ice is melting doesn't mean FL will disappear.", "Let the LPGTQ have their own parades like the Irish, like Puerto Rico,  etc. I want to see inclusion in any LBGTQ parade of Evangelical Christians just like they accept all Muslim groups. | She is like a sixth grader. | That's' what Maduro says. | Cortez you afraid to go on FOX? Afraid they would ask you for the truth? | Socialism has never worked and won't work here Alex. | Horse  | She speaks after she only listens part of it when they come to a part she can disagree with. That is what she does almost every time she speaks. | They lie Katie, all the time when it comes to anyone who might support the  President. | Figures she would think she was the victim. What a waste. | Only you could have the longest run-on sentence I have ever seen. | AOC another msm darling and lackey. | Free, Free, Free!! | Hey I'm a working person and know full well about economics for the middle class. You know NOTHING accept how to spin facts to match your narrative. FAKER AOC | And paid with Wampum.", "i understand it too. i also understand what you said. there was no need for your input. | bill nye is a mechanical engineer. not a scientist. | and i appreciate the conversation. usually those who reply to something like my post would be a troll, youre not. | no. dont assume."], ["Lest we forget, St. Ronald also launched his 1980 general election campaign in Philadelphia, Mississippi, with a speech about states' rights.\n\nHe knew exactly what he was doing. | For those who can't remember what made Philadelphia, Mississippi famous during the Civil Rights Movement, it's this:  https://en.wikipedia.org/wiki/Philadelphia%2C_Mississippi#Murders_of_Chaney,_Goodman,_and_Schwerner … | Because we can't speak ill of Saint Ronald. | No no no... you see, family is \"off limits\" if you're a Republican.\n\nDemocrats' families are always fair game. | John McCain: \"Why is Chelsea Clinton so ugly? Because her father is Janet Reno.\" Chelsea was 18. | Rush Limbaugh: \"Everyone knows the Clintons have a cat; Socks is the White House cat. But did you know there is also a White House dog?\" [while showing a picture of Chelsea Clinton]. Chelsea was 12. | Every state in the country has dram shop laws. | I mean it's a license to serve alcohol to the public; of course there are going to be laws that the license-holder acts responsibly.", " https://www.justicedemocrats.com/home/  |  https://www.justicedemocrats.com/home/  |  https://www.justicedemocrats.com/home/  |  https://www.justicedemocrats.com/home/ ", "He absolutely was. The Democrats(founders of the KKK) called the Republican party \"the black Republicans\" pre-1964. It wasn't until after the Democrats promised welfare benefits, that black people voted Democrat. The Democrats literally bought votes, and are still doing it today!", "Today’s socialist wants to live off yesterday’s money. Who’s money will tomorrow’s socialist live off of? They never think past one. How did socialist light their homes before candles? Electricity. | Is she saying that low income people have bad credit scores? Is she saying that low income people are not responsible enough to pay their bills? |  pic.twitter.com/CdvWh8ZZIU | Because if there’s one person on the planet that knows about cheating taxes it would be a former bartender. Could you imagine the tax revenue generated if every bartender and waitress from coast to coast paid there taxes, not millions, not billions but trillions. | Meanwhile in real time the house of representatives is having a vote to let its democrat members know not to have anti-semitic hate speech. Can you get any more childish than having to pass bills to not hate Jews? The Democrat Party can’t shake Black Face or their KKK roots. | Meanwhile. pic.twitter.com/1ApKyoVelV", "Learning to speak Spanish fluently as I have, one of the important things is to understand the CULTURE behind that language. One of the first things you learn is that this is how children are named, they take the name of BOTH parents! | You make a very important point here! People VOTED for this guy and support his sick & twisted agenda. WHAT'S WRONG WITH THESE PEOPLE?! They KNEW exactly who they were voting for. There is a significant amount of the population who DON'T care about our country at all! Terrifying! | The reason the Dems got hacked during the 2016 elections was COMPUTER ILLITERACY! That has to change and that means booting old guard Dems from the party and deploying effective security. The old guard will never understand because computers are still foreign devices for them!", "25,000 jobs LOST to NY in less than 75 days in office! At a cost of 5 BILLION dollars.\n@NYCMayor @NYCMayorsOffice @SenGillibrand @TheDemocrats @SenateDems @HouseDemocrats @nycgov @nytimes @nypost @MeetThePress @WSJ @FaceTheNation pic.twitter.com/ggVk8L6D60 | Tweets the idiot that cost NY BILLIONS of dollars, and 25,000 jobs! Just astounding why she thinks anybody should take ANYTHING she says serious! @NYCMayor @nytimes @NYCMayorsOffice @nycgov pic.twitter.com/8K6FQu8ge6", "Reading the thread it looks like the RW trolls are all behind Ro and eager to find challengers to incumbent Dems.\n\nIs anyone dumb enough to fall for this BS from the Intercept?\n\nGoing after @CheriBustos is a big mistake. | It's far right Blue Dog Dems who are more like old fashioned Repubs and not the more moderate Dems.  And many Bernie bots are cons punking us still. pic.twitter.com/T3jSWPQOal", "1/ For those who don't know: one of the \"defining characteristics\" of Fascism is fraudulent elections, where, if the regime (coughGOPcough) even allows elections, they are rigged in favor of the regime. The regime will also employ projectional hypocrisy by claiming that it's | 3/ free and fair elections with high turnout are bad for him and his party. There are 18 \"DCs\" of Fascism and the GOP have adhered to ALL OF THEM since Oct. 2001 and more than half of them since Tricky Dick Nixon was President. That is the current state of the GOP, everyone", "Lmbo | #NewGreenDeal #DrainTheDeepState #LiberalismIsAMentalDisorder #LooneyLeft #GeorgeSoros #DemocratsHateAmerica #DrainTheSwamp #WalkAway #DemocratsDividingAndDestroyingAmerica #AmericaFirst #WakeUpAmerica #TrumpTrain #Trump #PJNET #tcot #BuildTheWall #MAGA #DemocratsArePoison pic.twitter.com/itxNr6jxBm", "Will you also receive benefits after she passes? She was the victim. All the victims of slavery are dead. | BREAKING: New Mexico is set to become The next state to Award it's state’s electoral votes to the winner of the national popular vote.\n\nDelaware is Also set to Join New Mexico That Would make it 15 states\n\nThose 15 states account for 189 electoral votes, just 81 shy of the 270 | I'm a lifelong old white Dem and I REJECT THE DCCC'S ACTIONS. Who ever heard of stifling new ideas in the Democratic Party? That's a GOP policy. Stop this shit now. No donations from me til you do."], ["Adam Schiff you think Joseph Mifsud was a Russian that met with  Papadapolous. If that is so then why when the FBi met Mifsud in Feb 2017  they let him go and Papa D was never charged with anything dealing with  Russia? Mifsud is NOT RUSSIAN. He is western asset. | This is unacceptable and wrong. We are better than this.  The ppl of America voted for Donald Trump to represent them as President of the United States of America. Agree to disagree. That civility. Anything else is simply another form of hate.", "#Democrats are Sooo in trouble for 2020! #WednesdayMotivation #AshWednesday #Lent #AOC #Omar #RashidaTlaib #Israel #JDL #BorderPatrol #ICE #NRA #MAGA #NewYork #Nadler #Venezuela #Tornado #Cohen #Schiff @FoxNews @Idf @TuckerCarlson  #Pelosi #Schumer @SpeakerPelosi @CNN @SenSchumer pic.twitter.com/LL7mgkKbGJ | Pure Looney Tunes!!! #Wednesdaymotivation #AOC #OMAR #RashidaTlaib #737MAX #TuckerCarlson #LauraLoomer #CollegeCheatingScandal #Venezuela #FacebookDown #Brexit #FAA #Bayern #JayLeno #Manafort #BombCyclone pic.twitter.com/8d97EdV4xL", "@AOC is a typical DemonRat. Just like @RahmEmanuel said, “don’t let a good crisis go to waste”.\n\nChicago IS waste and after all these years, @TheDemocrats can’t focus on ANYTHING positive, they only try to divide and conquer, tearing the country apart in the process.", "So where were your #Democrat cohorts when it came time to vote on this?  pic.twitter.com/zCMITqJ7T9 |  pic.twitter.com/TGwcupyR0o", "That’s an even stupider statement than the last AOC statement are you all on the left bucking for the stupidest ass hat of the century award it seems like it. | Wow like are you like a weather scientist like we didn’t read that in your collage transcripts. Like you should tell the real truth about your degree and like who paid for it. Like if you don’t we will. | She knows exactly what she was saying it was a cryptic tweet threatening the President and his family’s lives. That’s the way she says sorry to the Clinton KLAN so they won’t suicide her. pic.twitter.com/ucejvKHxOn | Like cool, like did ya do each others nails, like pony tales too.  While you like talked about like how to split up that million you and your campaign manager swindled. Like we gotta run Cortez but like hang loose. We have a casting call like yesterday ya know!!", "Lots of articles saying that you’re not serving your constituents and you’re serving yourself | News coming out that AOC was nominated by her brother to join justicedemocrats.  Then “they” select the best candidate and make them a puppet.  AOC is in this position becuase she was the best contestant they had.  Her Chief of Staff is also an expert tech social guy. #sofake", "...already spoken out to my #500friends not on #twitter who will speak to their 500 #peeps and so on... 'We the people support the right of the #DemocraticallyElected @Ilhan to voice #HER #Opinion as #Right to #represent her #constituency #InGodandFreeSpeech we #Trust not #Benjys", "Pls take a look at the “Accredited Investor” laws. They restrict non-rich people from participating in early investment rounds. If they want to invest in a startup, they must buy stocks at IPO from Accredited (wealthy people) at a much higher initial price point.", "so was that he was an accelerationist, looking to spark more widespread hatred and fan the flames of existing divides.\n\nI wish I could appropriately say \"don't feed the troll\", considering the gravity of it all and the very real consequences for his victims. | It's important to look at and understand how contradictory, broad reaching and \"out there\" his writing was. Nearly every demographic online had been given as \"inspiring him\", and everyone's flaming each other as a \"part of the problem\".\n\nHis actions were disgusting, but even more", "Aww, she can dish it out all day long, but look how triggered the poor lamb is now that she's getting ridiculed.\n\nYou're all hat and no cattle, sweetie. | Pure lies.\nShe didn’t make victims more vulnerable, she ensured that college men have due process rights, something your lord and saviour, Hussein Obama (PBUH) took away from them.\n\nIt annoys you that men have a right to defend themselves against false allegations. | \"I love humour\"\n\n\"Waah-Waah, how dare he mock my #GND with photos of dinosaurs and Aquaman\" | It would be cultural appropriation for you to celebrate #StPatricksDay."], ["Are you thinking MLK was a communist/Democrat just like your stupid intelligence that you don’t have thought Abraham Lincoln was a Democrat #IDIOT pic.twitter.com/rHROYobgWi | A drink of #SHUTTHEFKUP | Her youngest crowds are 16 year old illegals  | It was hilarious to watch him mock YOU F-C-K-G m MORONS  #LiberalismIsAMentalDisorder #RashidaTlaibIsAterrorist #OmarAndTlaibsupportISIS #Removethem | Yep! Including you going to jail pic.twitter.com/yy40UYguWS", "So you think our guns will.stop an army that can destroy the world 100 times with their arsenal.  Just take them out of the hands of the demographic of mass shooters.  It's not okay to go about killing masses of Americans of a fake potential threat. | And New Zealand doesn't have the gun violence or death like the US, so that's okay with you?  False equivalency. | I live in a country of known terrorist.  White men. pic.twitter.com/Zmg8gDSpDb | Because she didn't make an anti-Semitic remark.  This is another attack on POC, just like all central Americans and Mexicans aren't criminals and killers", "So like 100 people? | This? pic.twitter.com/HTNnSHeFd1 | How about addressing where these drugs are crossing into our country? One of the larger points of having sufficient border security. |  pic.twitter.com/0hsseJMLOM", "Clearly as our President has been saying, we have a crisis. Thank you for agreeing with him. No let's work together to protect our borders and keep these families from coming illegally. The problem is they are coming illegally in droves. | I agree! But doesn't negate my point, if we can't handle those who are here legally, how can we handle the many who arent? Yes, we need to hire more agents AND we must have some control over this process of entering our country! For their sake as well as ours. | Yes Kevin I agree! People need to read this new green deal. It's ridiculous. I'm all for caring for our environment but not like they propose! | Your arguement just shows how messed up it all is. You should be advocating for all who enter our country to work here should come thru legally. This is for their good!", "Why is it right wing? And what’s your broader point? | Throw money at the border and stop playing around with drug dealers. Take the drugs first. Then help the addict. | My grand parents were crippled. Granddad lost a leg in a coal mine. Grams had polio. she actually dragged herself around just to clean the floors. My dad lost an eye at 10. My mom had cancer and my dad died of cancer. Difference? They didn’t choose it. | Reject logic!???!!?? | Who’s not treated equal? Conservatives. Who’s rights have been diminished? Non-citizens men and Christians. Who’s angry? #Progressives #Millennials #Pampered. | Unions have outlived their usefulness. They corrupt everything. Need proof? Look at our education system. We’re dumber than ever. They strike during the school year. It’s not about the kids. They don’t pay dues or donate... | She can’t hold the drink she’s too busy on Twitter. | Whoopty doo. Do your staffers have to use the same insurance the rest of us do? No!", "This \"crisis\" is a bunch of people that are hell bent on destroying themselves.\nOnly these people can help themselves. What excuse does any human being have for not knowing the dangers of these destructive drugs?\nWe cannot fix the Illegal Immigration crisis ourselves. | We are not aksing for a border wall to prevent imbecilles form injecting tide pods to kill themselves.\nEducation and proper brainwashing will cure them.\nUsing Narcan brings them back to die another day. Maybe they'll succeed next time.\nWhy the Fek do they do it? | A sensible statement if ever I heard one.\nThe people that make laws and vote on them (our Representatives) will never make a law that would keep all big money (including Lobbyists) from interfering with our Government.\nThose bastardos are in it for the money and power!", "Without price ceilings, it had no teeth. With price ceilings, Republicans wouldn't vote for it. What can you do | So it's not illegal just immoral. Just goes to show Republicans have 0 values they claim to hold, but try to stand on the moral high ground against everyone else. It's ridiculous. NDAs to cover your crimes are immoral and if you're for that you have 0 values. | If the hush payments weren't illegal idk what is. What was the purpose of both moneys? One to pay for the campaign expenses, one to pay off a pornstar. One is legal, one is not. One was reported incorrectly, and one was never reported as a campaign contribution. You're a bigot.", "I hardly consider a circle jerk on live TV to be 'awesome'.  This woman is never asked a single hard question, and whenever she is and is forced to acknowledge it she cries sexism or racism. | Remember when @AOC said anything intelligent?  Me neither. | You never seem to answer the issue as to why it is a problem to know that money is going to AMERICANS instead of Illegal Immigrants.  The census is to keep track of American citizens to determine where our tax money goes. | LOW CREDIT SCORES EXIST FOR A REASON.  It means PEOPLE DO NOT PAY THEIR BILLS. | If only we could've been so lucky. | What dumb slogans?  You're looking for big brother government to save the day when people simply refuse to save themselves. | But she certainly makes herself comfortable by never, -ever- debating someone with different views than hers.  That would just be too much stress, racism and sexism, right? | This argument holds no water.  Usually the offenses are more than drug offenses and they plea down to lesser charges.  The fallacy of someone in jail for 'smoking weed' is all over the place when its a non-issue and incredibly rare. | Except none of you read further into the issue.  Mass Incarceration is not a problem.  Stop breaking the law.  The per student amount given to each school is pretty close and as far as banks?  STOP BORROWING more than you can pay.  Don't blame the banks for that. | Yes.  Lets see the transparency in that 850k that just went poof from her donations. | How dare people make their own money and be successful.  Because some people aren't we better drag everyone down to that level.  How dare you?", "Leave PRESIDENT TRUMP alone! Period! If congress would do their job there would be a wall and the statistics lower! A wall works! OUR president has been telling congress and the American ppl about the drugs coming from the southern boarders and other ports of entry! Pay attention | He has addressed it! It’s coming from Mexico through our southern boarder! What is wrong with u people? Don’t u listen? | AOC I believe people here are letting u know very nicely that ur ideas although they may look good on paper(not)they are ridiculous!You said in 12 years we’re going to be extinct Al Gore said the same thing years ago and we’re still here!Worry about ur borough, ur people need u!", "The citations all seem to be intact actually. It’s long since been agreed that we need immigration reform at least on the left and I repeat my earlier point to your insistence that somehow a percentage of ppl doesn’t matter: pic.twitter.com/rjNvNT5AxF | Well that’s just not an option when it comes to people’s actual lives. People deserve humanity and that shouldn’t be up for debate. | Support of policy that supports that morality DOES actually. It shouldn’t be up for debate that children don’t belong in cages or separated from their family. Gun control laws shouldn’t be up for debate when we have a shit ton of data proving they work. Etc etc. |  https://www.google.com/amp/s/amp.businessinsider.com/science-of-gun-control-what-works-2018-2 …\n\nhttps://www.google.com/amp/s/www.nbcnews.com/news/amp/ncna959791 …\nSee, that’s not what the data says. The actual numbers not pulled from your ass prove you wrong. And to be clear, ANY children separated from their families as a border policy is too many. And we shouldn’t be detaining period. | She said best"], ["Speaking as a union member, maybe it's because unions are  mob run protection rackets. They put a shiny label on it but they are anti-worker. Bypassing state labor laws to stuff their own pockets by screwing the laborers and the companies they work for.", "Stop spending Billions of dollars on illegal foreigners crossing US borders. Spend that money on the REAL citizens of this country who have paid into the system and have earned it. It’s wrong for them to pay taxes all their lives and have it go to people that have no right to it!", "So sea walls are ok to keep water out but not a wall to keep illegals out? #BuildTheWall #aocisamoron", "gotta stop the drugs coming IN ....... that's the beginning of the crisis. We stop the drugs. the ease of getting them is reduced. fewer people die.", "He already did and gave a bunch of money towards it.  $6B increase. Build the wall to slow the flow of drugs. https://www.whitehouse.gov/briefings-statements/president-donald-j-trumps-initiative-stop-opioid-abuse-reduce-drug-supply-demand-2/ … | It’s because they say dumber things and are much further left. Nothing else. Schumer is pretty centrist. | Makes sense 4 years to orbit and takes her 4 years to make sense. The astroid is 240 million miles from earth and AOC is about that far away on her green new deal plans and making them a reality. Very symbolic.", "What are you afraid of? It's your plan is it not? The plan that will destroy America & put us in the dark ages. The people NEED to know who is foolish enough to back this . Btw, votes dont cost a penny. We want transparency. | Wow! What a stupid tweet. How about #BuildTheDamnWall #EndSanctuaryCities make\n#VoterIDLaws and #ImmigrationReform and drugs wont flow into the country. Wtf does the Green New Deal (dumbest idea EVER) have to do with anything? It will cause despair like in Venezuela.", "What are you smoking?  ICE is good for United States we need more ICE agents.  We need to deport ALL of the #illegals.   You tell all of the family how had a family member killed by an #ILLEGALS", "Firstly, if ANYONE crosses our AMERICAN border illegally  (for you Sandy, no authorization by US) they are criminals. Get it?", "Its not just illegals who take advantage of IRS loopholes | Rich people take advantage of the IRS loopholes. Netflix made $850M last yr & paid $0 in taxes.", "Must have missed it. | Ha Ha Ha. Wise?  REALLY?\nStupid People | Msnbc is BS.  Junk no facts. | AOC is a Dingbat! | Absolutely. | Something like him to Make this Country Great Again...yes. Murders, Illegals living off workers, Turn blind eyes to law\nSex Trafficking to Slavery\nEvil, demented Congress.\nNo border Security.\n\nCatch and release\nYes Trump...Red like Reagan."], ["Since things like pipelines have to be approved by the government why don't we go straight to the source and say that if the pipe Springs leak then it's the government's fault for approving the pipeline in the first place \nhow's that?\nLet American taxpayers be responsible | And what if a retirement fund invested in the financing of the pipeline\n\nBased on what you're saying you would hold every passive participant retiree responsible and liable for the oil spill\n\n#youareanidiot", "@Alex_Gassier82 ", "anybody talk to boys lately? boys r at higher risk of dropping out of school, less boys in college, illiteracy, homelessness, unemployment, suicide, autism, all affect boys more than girls, yet there is 0 awareness for boys. How progressive!", "I am an owner of a gas station which has been mine and family’s main source of living. That being said, I can’t wait for fossil fuel corporations and banker to go the way of dinosaurs", "She is at an airport? Why? Between stopping fossil fuels and jets, I can't think she is popular there.", "I'm going to start sounding horns so that they can understand how loud the oceans are getting and we need all ocean creatures to survive or we WILL DIE.", "This will remain one of the most important policy decisions to work on globally. As we eliminate and re-define “work” how should we ethically divide the spoils (both for those who in theory no longer must work and those who innovated the need for that work away)?", "Sure can! Here u go! I can give u two. As per NASA #facts pic.twitter.com/0qQcnwPRJE | Under Trump CO2 emissions hit 67 year low & carbon dioxide emissions reduced by 41.8 million tons, the largest decline in the world. Ozone layer shrunk to record low. EPA hit 13-year high in deleting toxic sites. Earth is greener than it was 20 years ago. Glaciers are growing", "Setting at the airport because they didn’t have a government leader to get the foods and water to the people. But the press had no problem getting around taking pictures.  An attack on American soil. By another country is an act of war. Please go back into hole you come out of", "Pipelines bad,  solar good! pic.twitter.com/falhOIMgPS | Look at that easy BBQ, pick one up for a small price!"], ["And SMH so hard my neck hurts. pic.twitter.com/znDiWnRGPc", "This just made me love you 50 times more pic.twitter.com/ntbSBABzae", "Don't forget burning wood is bad for the environment too also cutting down trees. Oh and wearing your cloths because most is done with machines I hope you hand pick your cotton and make them by hand.", "HEY CLOWN  I guarantee you have no clue what caused the 08 resession. But I’ll tell you this your boy Obama played a huge role. He was one of the first people to start pressuring banks to give out high risk loans when he was a community organizer!!!!", "Ok how about addressing the THREE ethics violations plus your campaign mgr taking $1M for his business from campaign donations? Only months on office and already corrupt as Hades! https://twitter.com/11fortexas/status/1108695585685676032?s=21 …", " pic.twitter.com/lYw14Q6sHX", "How about the insane clown posse?", "Unfortunately you don't believe in positive thoughts and prayer to God, but you probably believe in magic and witchcraft. LOL.", "Yup pic.twitter.com/K3vT9q8Qoo", "Anything else you'd like to blame on middle aged white guys while you're at it? pic.twitter.com/bBzR9jq5jK"], [" pic.twitter.com/5GZliFcbOv | Jokes on you. pic.twitter.com/q2CDPmdqL9 |  pic.twitter.com/qWY5bRQRwK |  pic.twitter.com/1HQdm6mjsz | Opioids are coming from Mexico you genius. #BuildTheWall |  pic.twitter.com/TSERpzrtlL |  pic.twitter.com/OuPsf7g79k | Do you ever shut up? Your poor boyfriend...well not so poor since you are giving him free taxpayer money. pic.twitter.com/GMsUcdPPlP | @AOC you need to explain your campaign violations and tell us why you should not he sentenced to prison. You are a socialist, communist, anti-semite and now a corrupt fraudulent politician. Someone should have aborted you to save the Earth. | Worry about Canada you clown. |  pic.twitter.com/wxQPWgv7HR | Lol ok. I am sure another 25,000 jobs will just show up. | NY doesnt believe in tax cuts. |  pic.twitter.com/1fkEHt2stX | Not Amazon.... pic.twitter.com/Z9d9dmkEFX | This is why we need to #BuildTheWall | #babymurderer | Hahahahah! Moron..... pic.twitter.com/iFmY64VOro |  pic.twitter.com/ELTzXUpLRR | Why do you look like a man? | What is a peditentery??? | Sure if you are excited for another big loss. |  pic.twitter.com/EpIaysmPdr | Murdering babies is not kind though....... | Wow look at your fake chart! pic.twitter.com/Rl5NyiSpJS", "The higher you go on the corporate ladder the more of your common sense you leave behind. There is nothing common about common sense. | Taxes take money in and the government invest it. In roads, healthcare etc. It is called churn.\n\nRegulations create jobs like mine. \nSo you cannot defficate I the lungs and stomachs of children with your industrial and chemical waste | The GND will create jobs and help save the planet. Hopefully we are not too late. | Amen | This could be a song? | Cadet Bone Spurs is a Liar\nLiar\nLiar\nLiar\nLiar\nLiar\nCadet Bone Spurs is a Liar\nLiar\nLiar\nLiar\nLiar\nLiar\nCadet Bone Spurs is a Liar\nLiar\nLiar\nLiar\nLiar\nLiar\nCadet Bone Spurs is a Liar\nLiar\nLiar\nLiar\nLiar\nLiar\nCadet Bone Spurs is a Liar\nLiar\nLiar\nLiar\nCadet Bone Spurs is a Liar | You are wrong on just about everything. | The GND will create jobs and will increase economic growth. I worked and retired from a company involved in pollution controls. \nRecently I drove across the country and back and was amazed at all the large solar arrays and wind farms.\nWind farms employ more people than coal", " pic.twitter.com/djhXbgYO3j |  pic.twitter.com/yc1GE1M2NJ |  pic.twitter.com/MoRHpQsYBb |  pic.twitter.com/hu3qZlwaHb |  pic.twitter.com/CywNufkDbB |  pic.twitter.com/XZ4WkjkCgt |  pic.twitter.com/8ssYEUEDcK |  pic.twitter.com/DBF2c0aZDN |  pic.twitter.com/rYdDEs1ABO | I thought airports were going away?  |  pic.twitter.com/2ULrbue6Kd |  pic.twitter.com/5EtHRiAnxF |  pic.twitter.com/C6EykHMbQA |  pic.twitter.com/Mr6iMtQRWK |  pic.twitter.com/6Bd0mLQza9 |  pic.twitter.com/mOXfMW8e6J |  pic.twitter.com/0vGQMZAIEW |  pic.twitter.com/fHR6Eu2kCN |  pic.twitter.com/b0WmtnbqBe |  pic.twitter.com/tYH3J8c8wY", " pic.twitter.com/YDLGGHOqiD |  pic.twitter.com/OZQOIBYyYq |  pic.twitter.com/bQNsVHd1MY |  pic.twitter.com/Xyfx4KjZaA |  pic.twitter.com/jxy0H1pPMy |  pic.twitter.com/eBIzgwKkNv |  https://twitter.com/rosedixontx/status/1105986786810044417?s=19 … |  pic.twitter.com/kHVJnC0Bkd |  pic.twitter.com/Jdcptp0MZI |  pic.twitter.com/6OyyI6nOMB |  https://twitter.com/rosedixontx/status/1105986786810044417?s=19 … |  https://twitter.com/rosedixontx/status/1105986786810044417?s=19 … |  https://twitter.com/EcoSenseNow/status/1099332287282307072?s=19 … |  pic.twitter.com/12xgi9oPUr |  pic.twitter.com/6wXUYTndU7 |  pic.twitter.com/XAXatl9Ptm |  https://twitter.com/rosedixontx/status/1105986786810044417?s=19 … |  pic.twitter.com/TPcxJt1f7L |  pic.twitter.com/FwLrZc1hCJ |  pic.twitter.com/Smqak4vr0k |  pic.twitter.com/K2IGVqWsKK |  pic.twitter.com/BsvfdSsI5b |  pic.twitter.com/cyJ6FLMQif"], ["immaterial - I don't like my taxes funding schools I don't use, but that's how it works - get over it\n\nalso, there are usually non-party specific votes on the ballot during primaries that non-party affiliated voters can vote on | this happens all the time - except it's usually #CrookedDems arranging for voters to cross to the Rep primaries to help push the weakest candidate | you're independent - you get to vote in the general election\n\nif primaries are to pick each party's candidate - it seems reasonable that only voters affiliated with that party should vote in that party's primary | Nope - open primaries encourage corrupt gaming of the process - #CrookedDems voting in Republican primary for weakest candidates, etc. | good idea - start your own party & compete w/your own candidates - until then the party system provides a framework for people with commonality to pool resources\n\nWhat we need to do is institute #TermLimits to break the huge entrenched incumbent advantage & #VoterID to stem fraud | try being a red voter in a corruptocrat packed blue state like IL\n\nStart with #TermLimits and national #VoterID | there are no advantages | tax $s fund things you don't use/want all the time - schools, research of sex life of fleas, repulsive so-called \"art\", etc.\n\nit's how it is and it's completely fair to limit those choosing a party's candidate to those affiliated with the party - get over it | independents don't fund parties or party candidates during primaries - it's completely reasonable that only party affiliated voters get to pick that party's candidate | so apparently you DO take them out and parade them around!! | More lies and ignorant blather from Occasional Cortex | so your bitching that GOP wants to put your insane BS idea to a vote because you know it can't possibly pass?\n\nYou're upset that they're wasting time voting on something that won't pass\n\nYET - you're perfectly fine proposing this pile of bullsh!t knowing no one wants it? pic.twitter.com/WmZvR3R5Ym", "It's NOT about the contributors, IT'S ABOUT MISUSING & HIDING CAMPAIGN FUNDS!\n\nAnd by the way, your \"fact\" simply means that 38.4% PAID MORE THAN $200!\n\nSo WHO BOUGHT HER OFF! | Gee, maybe the democRATS THAT HAVE CONTROLLED PUERTO RICO FOR DECADES should do something to get people jobs instead of WELFARE!\n\nHow many TENS OF BILLIONS do the American taxpayers have to have stolen from them? | Actually, SHE'S WRONG!\n\nEven WaPo, which goes out of their way to support democRATS, gave her 3 Pinocchios!\n\nOh, by the way, TONS of illegal opioids are crossing our OPEN SOUTHERN BORDER every year. Yet liberals/democRATS say there's NO emergency there! | LOL\nShe's so \"stressed out\" at making $174,000 a year, PLUS BENEFITS, while pushing her ideology of government taking over everything in the entire nation?\n\nYou are such a Class Clown Cortez......It's shouldn't be \"AOC\", it should be \"CCC\"!!!! | Actually EVERY ONE OF YOU democRATS LOOKED LIKE DESPERATE FOOLS!\n\nYou declare that the United States of America can't actually ASK IF SOMEONE IS A CITIZEN OR NOT!\n\nWhat kind of nation hating LUNACY is that? | LYING democRATS at it again.\n\nThe long census form has been asking citizenship SINCE 1970 so please STOP LYING TO THE PEOPLE ABOUT CITIZENSHIP NOT BEING ASKED SINCE 1950!\n\n2000 CENSUS QUESTION: \"Is this person a CITIZEN of the United States\"?\n\nPLEASE STOP THE BLATANT DISHONESTY!! | This needs to be on Comedy Central! | Since ILLEGAL ALIENS AREN'T SUPPOSED TO BE IN THIS COUNTRY, WHY IN THE HELL SHOULD THEY BE COUNTED FOR \"apportionment\"?\n\nOh wait, because ILLEGAL ALIENS FLOOD democRAT districts & States so even though THEY CAN'T VOTE, democRATS benefit from their ILLEGAL PRESENCE!!! | Remember when Republicans ran Puerto Rico into the ground?\n\nOh wait, Republicans have NEVER CONTROLLED THE GOV'T OF PR!\n\nCORRUPT democRATS DESTROYED THAT COUNTRY & IT'S ECONOMY & NOW THEY BLAME GOP & WANT TAXPAYERS TO PICK UP THE TAB FOR THEM, AGAIN & AGAIN & AGAIN & AGAIN! | Your \"life experience\"?\nSheltered, entitled, self absorbed, spoiled, dumbed down, indoctrinated, children you mean?\n\nMeanwhile INTELLIGENT PEOPLE understand that government is NOT the \"answer\", socialism is NOT the answer, and Class Clowns are NOT the answer!", "So, let me get this straight: you call economics illiterate AOC, who became a member of congress via a casting call a 'visionary'? While at the same time you call former Supreme Court clerk Lee a caveman? Please tell me you're 12 years old and not able to vote. #Crackpot | Don't you mean it's been 'some of the GOP and the vast majority of American Citizens vs. Democrats and Illegal Alien foreign nationals for almost your entire life? | Says a Victim of today's Miseducation system #PleaseSeekProfessionalHelp | Learn History: 13 Democrats voted against MLK Day. | Learn History: There wasn’t a single Republican Governor who put in place poll taxes, literacy tests or embraced Jim Crow, not one. While Democrat Governors across the south put in place poll taxes, literacy tests and supported Jim Crow Laws | Learn History: It’s the Republican Party that fought Segregation. And yet the Democrat Party pretends to be the party of civil rights. When in Fact the Democrat Party is the Party of Power, the Party of Central Govt Socialism, Open-Borders, Infanticide and Illegal-Aliens Voting | Learn History: There was not a single Republican governor that stood in any schoolhouse doorway to block little black kids from going to school with little white kids, no one – ONLY Democrats blocked Black Kids from entering schools | Learn History: Every single civil rights act, going back to immediately after the civil war, up to and through the 1960s – the overwhelming majority of Republicans voted for every single one of them- while the majority of opposition to each were Democrats | Learn History: The Republican Party was effectively created to fight slavery, the Abolitionists. The Democrat Party promoted slavery. It’s the Republican Party that proposed the 13th 14th and 15th Amendments | Yes, we must give her miseducated economics illiteracy, distorted fairy tale knowledge of human history, deranged climate hoax obsession and lust for totalitarian Marxism 'credibility'. Her brilliant wisdom makes her the one we need to run our economy and instruct us how to live."], ["I'm sympathetic, but an infrastructure issue? Things breakdown. I don't think a law or legislation would prevent your elevator from ever failing or a part not being available to fix it right away, whatever the problem. Inconvenience is a part of life. | I understand your point, but laws don't prevent emergencies from happening. Elevators break down like other mechanical devices. I don't know the type of building she lives in, so I can't comment further as to how they are handling it. | Some places are better than others, and there is always room to improve.", "Solidarity, Jacinda. Prayers with the families and friends of the deceased, and those injured.  x", "So why are you flying around and driving in cars? | Bullshit. Venezuela was a wealthy capitalist country until socialism was implemented. With that came out of control corruption of the ruling class. | Can I get  an Amen?! | Just don’t be a Democrat.", "I might add Beto is overrated. His resume is so thin it could be sold at Victoria Secret. AOC is kicking ass as are a lot of dem freshmen Congresspersons. @RashidaTlaib @LaurenUnderwood @RepPressley @RepKatieHill @RepKatiePorter", "Hold them accountable for saving American lives! Talk to the Angel families that lost their loved ones or raped by those you want to shelter! | This Airhead does not consider important, the American lives lost over time due to murders, drunken driver killings and more importantly the 60,000 plus dying of drugs coming in from the south border!", "What can be done to make\nAll Federal Judges Elected\nAnd NO LIFETIME APPTS.\nSCOTUS I KNOW WOULD\nTAKE CONSTITUTIONAL\nAMENDMENT BUT lower\nCourts should NOT BE\nAppt or permanent..\nThe people should be able\nTo get rid of compromised \nJudges..", "We The People demand our tax payer money back! This was a corrupt investigation, led by McCains treason, and you Dims continually spouting false narrative! We The People should sue!!!! | OMG!!!! STFU with this bullshit!\nFloods happen and have since the Earth was formed! Goddamn! At 29 yrs old and a college graduate? You’re a fucking idiot!!!\nCORTEZ! You belong behind a bar, and back in school! Idiot!", "Protecting illegals? | Not true | Do they feel close to the 9 11 victims too? | I recommend you learn about socialism | Same for families of ALL prisoners............. stop the victim stuff. | P R has voted NOT to join the US.", "Nonsense is not a language | I think what you meant to say was the Obama era recession | You think to keep FDR from being re-elected they had to change the constitution? You know he died in 1945 and the 22nd amendment came in 1947 and wasn’t processed until 1951, six years after he died? How in heavens green earth did you ever get elected being such an idiot? ", "Stop it!! Your Radical Socialists ideas are putting our Country in Danger!! You're so Ignorant & corrupt!!  just advancing Soros agenda of Open Borders go back behind the Bar you're ill qualified to be in Congress!! | Wow! Not even the badics! How old are you 12? | You can't add 2+2 Let alone talk coherently about matters of National Security. I'm from a border Town & I can assure everybody people in both sides of the border live in constat fear.\nThe crisis is real & is been going on for too long!\n#BuildTheWall | Wrong quote, Wrong event, Wrong person to be tweeting about important issues. You're a fraud!!\nWhy are you not in cuffs??"], ["Here's that EVIDENCE that walls work.\n\"The number of deportable illegal immigrants located by the US Border Patrol plummeted by more than 89 percent\".\n\nThis town is proof that Trump’s wall can work.\nJanuary 13, 2018 https://nypost.com/2018/01/13/we-already-have-a-border-wall-and-it-works/ … | How Government Researchers Hijack Science for Political Purposes.\nFebruary 28, 2019 https://www.americanthinker.com/articles/2019/02/how_government_researchers_hijack_science_for_political_purposes.html … | Greenpeace Founder Global Warming Hoax Pushed by Corrupt Scientists ‘Hooked on Government Grants’.\n7 Mar 2019 https://www.breitbart.com/radio/2019/03/07/greenpeace-founder-global-warming-hoax-pushed-corrupt-scientists-hooked-government-grants/ … | Oh dear. You drank the Kool-Aid. \nU.N. Official Admits Global Warming Agenda Is Really About Destroying Capitalism.\n02/03/2017 https://www.zerohedge.com/news/2017-02-03/un-official-admits-global-warming-agenda-really-about-destroying-capitalism?fbclid=IwAR3sp8t8BpVLBqyrIFxuJH6ZHRU2B3i5YvJMFz6dKt4rvc-OAkxL2ov62_I … | Fentanyl seized by Border Patrol in record bust could have killed 57 Million people, officials say.\nJanuary 31 https://www.foxnews.com/us/fentanyl-seized-by-border-patrol-in-record-bust-could-have-killed-57m-officials-say … | Fentanyl Deaths Caused By ‘Mexican Oxy’ Pills Hit Arizona Hard.\nFebruary 15, 2019 https://davidharrisjr.com/social-and-political/fentanyl-deaths-caused-by-mexican-oxy-pills-hit-arizona-hard/ … | There's no dignity in being DEAD. | Anyone, ANY ONE, who ignores the MASSIVE women & child trafficking and the drugs killing our people, as IRRELEVANT, is not worth listening to.\n\nThey ARE however, relevant to be voted OUT of office. | My walls work too. \nAND i can keep people OUT. \nImagine that...  | The Brains Behind AOC. Part II https://www.youtube.com/watch?v=V-3_FGyhg4k … | The Brains Behind AOC. Part 1 https://www.youtube.com/watch?v=1h5iv6sECGU&t=0s&index=542&list=PL0xc4sPQzQ5CY5W80n1aZ_TsbBv7YM7iB … | The Stunning Statistical Fraud Behind The Global Warming Scare. https://www.investors.com/politics/editorials/the-stunning-statistical-fraud-behind-the-global-warming-scare/ … | Climate Change Theory What's Wrong with it?\nMarch 8, 2019 https://www.americanthinker.com/articles/2019/03/climate_change_theory_whats_wrong_with_it.html#.XIKMfuRozgQ.twitter … | Greenpeace Co-founder ‘Climate Crisis’ Not Only ‘Fake News’ — ‘It’s Fake Science’.\n12 Mar 2019 https://www.breitbart.com/clips/2019/03/12/greenpeace-cofounder-climate-crisis-not-only-fake-news-its-fake-science/ … | Or their chiropractors to get their necks stretched... |  pic.twitter.com/dO9T3pnF8J", "AOC wants to build sea wall. No water for burn.  Water rising AOC wants sea wall.  Illegal immigrants rising no wall or funding.  Thanks for supporting legal citizens giving us voice.  Illegals have more voice power than legal citizen in our own country...sad | Politicians have own agenda.  The people never in my lifetime represented.  You are taking kick backs STFU.  Do your job close mouth quit tweeting and represent the legal citizen.  That's your job.  Your all blow and no show.  Double std. Hypocrite | Literally xl pipeline happened under Obama Democrats Clinton, Pelosi and  creepy Joe.  Democrat big business.  Get facts straight quit pointing fingers unless at Democrats....lmao | It's unacceptable that millions of immigrants pass through border and Dems keep blocking.  Everything on illegals you support. You should step down if not representing legal citizen.  Not a right for legals to pay for them, take college $ scholarships of legals.  The broke law", "Yeah. If you read into the report you can see where the bias in the fact check you cited lies. When talking about Hillary losing track of our money they reported that using the word “missing” was wrong but when talking about this they say it’s true when the report states the kids | Weren’t actually missing. They just couldn’t reach the sponser housing the kid (these are kids who were sent to live with someone in the US not the ones in detention centers at the border) because they didn’t answer the phone immediately. It’s a bit misleading if you ask me | One. Temporary means not permanent so as long as they were the child’s parent it was temporary to my knowledge. Also I have seen nothing that shows those legally crossing the border at a point of entry being effected by the zero tolerance policy that applied to illegal crossings. | There are lawful points of entry they can go to if they are fleeing gang violence. They choose to violate the law by crossing illegally the same as the sex traffickers. So that is the cost of doing it illegally is a temporary separation for the safety of the child | My question is does that outweigh the trauma of being kept with a sex trafficker", "Where is the action against muslim invaders in EVERY sovereign nation. They take the cake for civil rights violations w/rape.\nAnd the cartel gangs exploiting our border? Your \"righteousness\" is misdirected & serves an agenda.\n https://www.thereligionofpeace.com/pages/quran/violence.aspx …\n&https://www.unhcr.org/news/latest/2017/12/5a27a4e04/male-rape-sexual-torture-widespread-syria-crisis-report.html … |  https://www.google.com/search?q=taqiyya+hate+speech&client=ms-android-verizon&prmd=niv&source=lnms&tbm=isch&sa=X&ved=2ahUKEwiloZS9hK7hAhUJnq0KHZaKCc4Q_AUoAnoECAwQAg&biw=360&bih=588#imgrc=KUmCkDcWeX7ksM …\n&\nhttps://www.thereligionofpeace.com/pages/quran/violence.aspx …\n&\nhttps://www.policemag.com/373934/the-hidden-agendas-of-latino-activists …\n&\nhttps://clarionproject.org/minnesota-terror-recruiting-capital/ …\n&\nhttps://www.meforum.org/5410/muslim-rapists-prefer-blondes …\n&\nhttps://centerforinquiry.org/blog/a-call-to-the-muslims-of-the-world/ …\n&\nhttps://www.dhs.gov/news/2019/03/06/humanitarian-and-security-crisis-southern-border-reaches-breaking-point#wcm-survey-target-id …\n&\nhttps://www.washingtonexaminer.com/news/non-us-citizen-pleads-guilty-to-role-in-scheme-to-make-thousands-of-fake-government-ids-immigration-records# …\n&\nhttps://www.google.com/amp/s/www.nytimes.com/2019/03/05/us/border-crossing-increase.amp.html …\nWhite robes https://www.hrw.org/report/2013/02/28/religions-name/abuses-against-religious-minorities-indonesia … | Rape crisis\n https://youtu.be/ZF71dZMdjyo \nGeorge Soros & UN funding caravans.\nhttps://youtu.be/HwAnqPoYdSg \n&\nhttps://www.city-journal.org/html/connoisseur-chaos-14954.html …\n&\nhttps://cloverchronicle.com/2019/03/14/reminder-beto-orourkes-2018-campaign-illegally-spent-funds-on-supplies-for-migrant-caravans/ …\n&\nCollusion delusion\nhttps://www.thegatewaypundit.com/2019/03/huge-new-information-ties-the-phony-anti-trump-russia-dossier-to-dnc-billionaire-far-left-donor-george-soros/ …\n&\nhttps://www.washingtonexaminer.com/washington-secrets/record-120-billion-sent-home-to-3-top-nations-flooding-us-with-illegal-immigrants …\n&\nhttps://www.meforum.org/5846/muslims-sexual-slavery …\n&\nhttps://www.meforum.org/7607/the-annihilation-of-iraq-christian-minority …\nGot it? |  https://www.gatestoneinstitute.org/9934/germany-rape-january …\nHostile takeover https://youtu.be/X5sIC3-Vm3w \n&\nhttps://www.google.com/amp/s/www.foxnews.com/world/video-from-egypt-shows-muslim-mob-attacking-christian-church-taking-down-cross.amp …\n&\nhttps://www.meforum.org/5188/ethiopian-christians-isis …\n&\nhttps://www.hudson.org/research/14295-armenian-genocide-reminds-us-christian-persecution-thriving …\n&\nhttps://www.google.com/amp/s/news.sky.com/story/amp/fifteen-men-charged-over-beheadings-of-female-hikers-in-morocco-11595382 …\n&\nhttps://www.city-journal.org/html/london-muslims- …“celebrate”-911-12387.html\n&\nhttps://www.google.com/amp/s/mobile.reuters.com/article/amp/idUSBREA2608F20140307 …\n&\nhttps://www.google.com/amp/s/www.cbsnews.com/amp/news/mexico-cartel-violence-tamaulipas-21-bodies-miguel-aleman-texas-us-border/ …", "\"Ocasio-Cortez Hit With Complaint Alleging She Laundered Money To Boyfriend\" https://www.dailywire.com/news/44095/ocasio-cortez-hit-fec-complaint-alleging-she-ryan-saavedra … | \"The complaint names Ocasio-Cortez and Chakrabarti as respondents. It asks the FEC to investigate and audit the two PACs, saying they were engaged in an \"an elaborate scheme to avoid proper disclosure of campaign expenditures.\" https://www.washingtonexaminer.com/politics/ocasio-cortezs-chief-of-staff-ran-1m-slush-fund-by-diverting-campaign-cash-to-his-own-companies … | Never Socialism! https://twitter.com/RedNationRising/status/1105562036724031488 … | What abt Pelosi & other Dem Reps ignoring CA homeless but wants even more illegals n US for taxpayers to have to support. Illegal immigration cost US Legal citizen taxpayers 116+ Billion per yr. Keep illegals out & they'll be more $ to take care of our own https://video.foxnews.com/v/6011822064001/#sp=show-clips … | & ICE didn't cage them. They keep falsely blaming ICE but it was BP. After they came across the border BP had to separate them at the holding facilities for their safety due to gangs and other potential risk to them. Dems need to stop complaining & build better & more facilities. | $?, Former FEC commissioner who's studied complaint against AOC & Chakrabarti concluded there is unquestionably more than enough evidence to justify FEC opening a civil investigation& seems to be enough evidence to justify opening a criminal investigation. https://dailycaller.com/2019/03/11/fec-commissioner-ocasio-cortez/ …", "In just two busts at our southern border, there was enough fentanyl to kill over 100 million Americans. Will open borders give us more, or less fentanyl?\n\n https://dailycaller.com/2019/01/30/fentanyl-drug-bust-southern-border/ …https://www.sandiegouniontribune.com/news/courts/sd-me-border-fentanyl-pills-20180802-story.html … | The number one opiate killer is fentanyl, by a long shot, most of which is brought through our southern border. Open borders advocates are essentially green lighting unlimited amounts of fentanyl as well as child sex slaves. | Oh sweetie, bless you heart. You are the gift that keeps on giving. | ABC, CBS, NBC, CNN, MSNBC, NYT, WaPo, LAT, etc., etc., all give you 100% positive coverage and even lie to protect you, yet you screech & cackle about one cable news network. It must be exhausting to be a professional victim. | Wow...the collective IQ of this team will be in the high ones. | Looks like Democrats owe you. They started a civil war to keep slavery, created the KKK, filibustered the Civil Rights Act and Jim Crow was a Democrat. Native Americans owe you nothing. | Could you provide us pictures showing the physical barriers (as required by law) between the numerous PACs that use the same address in a state in which none of you live? That would be helpful. | As part of the 53% of Americans who pays federal taxes, I often wonder why I, as a Native American, should have a portion of my tax dollars going to reparations of blacks. My ancestors farms were confiscated and given to recently freed black slaves. | 1. If I like my house can I keep my house, or does it have to be rebuilt?\n2. When you say EV charging stations everywhere, will we have room to roam about? Will you leave enough gaps to be able to walk past them or will they be like blades of grass? You"], ["Barnaby Joyce, Vikki Campion Part Of interview  https://www.youtube.com/watch?v=wnOQkbnKyGU … pic.twitter.com/U1VEBuEqe5 |  pic.twitter.com/jf9uDFjf31 | MALCOLM TURNBULL ROAST: The Sell-off, Energy Crisis, Sustainable Development  https://www.youtube.com/watch?time_continue=1&v=vtQuJhBsUE4 … pic.twitter.com/W1QZqdJzqv |  pic.twitter.com/htPOphMtYh | RothsChild and Rupert Murdoch wars  https://www.google.com/search?q=rothchilds+and+rupert+murdoch+wars&oq=rothchilds+and+rupert+murdoch+wars&aqs=chrome..69i57.21272j1j8&sourceid=chrome&ie=UTF-8 … pic.twitter.com/8v8qjksOJ2 |  pic.twitter.com/MXBuSdtxaj", " pic.twitter.com/e6I3MgBtYh |  pic.twitter.com/FiElRspMh4 |  pic.twitter.com/4BtegsjTIm |  pic.twitter.com/JchvkiTOl6 |  pic.twitter.com/OctesvzZQw |  pic.twitter.com/LcDZNxJjGo", "I have seen the blessings of his socialist government out there in Venezuela it looks pretty good to me I wouldn't mind burning my possessions to barbecue my chihuahua as long as the government stays solvent | Yeah you tell them girl and getting on Twitter to point out that you do have black people on your staff well that's tokenism mixed with a little bit of Showmanship I would say...#blackface pic.twitter.com/DgDIbXMNhu | You use the word norms #d platform |  pic.twitter.com/0NWCRjVEag | I think it's awesome that you pointed out the two biggest drags on our economy with the cartoon | Hitler inspired a lot of people to pic.twitter.com/EnxDPRrBnF | Hitler had the right idea ...... right comrade pic.twitter.com/W3lbSUirNX |  pic.twitter.com/HLRnzmiV0p | Why do you support a white supremacist organization like the Girl Scouts?#shame on you | You know it's funny that's exactly how I feel about being forced to pay taxes #get out of my life pic.twitter.com/DytH2S9f9o | I think you're completely and totally right white people are evil and should be burned alive.....#burn YT pic.twitter.com/cKj3nIpChm | Is there a violence against men act", "Rhodes Scholars, the lot of them | And they kept doing it because she kept RT’ing them. | Performance art. | Since when does holding a vote = delay? | Makes sense | It’s World News Daily. It’s a fake news site. I once had to tell an assistant of a client to stop sending articles from there TO my client who was RT’ing links stating she was up for the lead role in the Hunger Games 2. Don’t even want to tell you who it is because you’ll lol. | Because you’re lying. No one told you that. | #SAVETHEFARTINGCOWS | It definitively is. Those panicked kids in Feinstein’s office proved it; don’t know any any rational adult could look at that and not think “whooooo boy, maybe we should slow down a bit on the histrionics.” | Unbelievable. In the face of abject tragedy, your natural instinct is to be racially divisive and fear monger rather than be an inclusive healer. And all for personal gain. This serves no other purpose than causing further cultural division, and you do so willingly. This is sick. | I think anyone with actual experience (in literally anything) can refute tha kweeeen | This has to be the first time a sitting congressperson has ever advocated for NOT holding a vote on their own ideas. | *YOU* don’t pay them anything. | The strawman to end all strawmans |  pic.twitter.com/lxFOlyZlDW | Shame on Mitch for holding a vote on your own ideas! | Her arrogance is off the charts millennial | This is so painfully true | He’s “threatened” because he’s holding a vote on your own bill?? pic.twitter.com/kwgievCUWa |  pic.twitter.com/25hKRoDq9i | No fair minded person wouldn’t be. And rather than be honest about why they’re against it, they just insult the intelligence and abilities of black Americans. | White supremacist confirmed pic.twitter.com/ENIr5yX2CL | So you want to disarm your secret service detail? Because that’s what just one of these “proposals” would do. Or are they exempt for some reason? | PLEASE start debating people | What’s good for thee, but not for me. She couldn’t be any more clear about who she really is. | She’s backed herself into a corner. The moment she does that is the moment her rabid stan base dips. It’s only gonna get worse (thank God)", "Do you know what you're saying? Because noone else does! pic.twitter.com/bmHl23jHtB | Alex - you continue to show your arrogance! Calling our President \"horrific!\" How do you even begin debating that claim! You CANT! We ALL are so much better off w/ Trump than we were w/Obama! He doesnt take a dime in salary! Unlike you! You're a hypocrite wanting a pay raise! pic.twitter.com/h3oN4i7mpl | Better go to China, Japan and Russia - make sure they're doing their part! Good luck with that! | Dont know if you enforcing anyone is a possitive thing, AOC. May not want to do that! | You are a CRAZED person who seriously doesnt deserve to have the platform of Congress to spread your psychological bullshit rhetoric! Where do you even get off thinking that our Boarder Agents are doing this! YOU ARE PATHETIC!! I hope the Boarder Patrol comes to pay you a visit! pic.twitter.com/T9i15IWf7q | No. \"We the People\" are tired of your mouth! It's only been a few short months! We would like you to leave OUR Congress! Noone wants the shit your dishin' out! Noone! Not the left, not the middle, not the right! pic.twitter.com/wSHIyV1uWY | Hypothetically, Hypothetically...that's all the Democrats can live life with - \"hypothetical situations\" because they dont deal in facts! The facts dont go w/their narrative! Come on AOC you're dealing with highly educated people - you're going to have to actually READ something!", "And yet, they’ve allowed themselves to do it 15 times, and substantially (not even mentioning all of the covered expenses), during the past 30 years - a big raise every other year.! | Hit every pointAnd, are we supposed to think that was her excuse for funneling over $800,00 in campaign $$ for her and BF’s personal use? | That isn’t the only way.. | Spot on. | Exactly. What happened to the Founders’ intention that they were supposed to be going there to represent US?!! | Spoiled, unrealistic brat goes to Washington.. | Absolutely. They have no intention of living like the masses they propose are in need of Social Restructuring. | Make it work for you, Socialist with no intention of living under Socialist agenda.. | Here’s the art of maxing for her: \nSHUT YOUR WHINING PIE-HOLE! | Those alone, financially drain this country. | It’s easy to see some of Business Insider’s slant, with some articles, but was interesting to see in this one,that most Americans polled, disagreed with the idea of raises, and already assumed Reps made less yearly, than they already do | Spoiled brat mentality. | Her head would take up too much room.. | RIGHT ON! | A joke? | Being as you’re already being paid 10 times more than the average American makes in salary (paid by average American’s tax dollars), and you’re already exposed for funneling campaign money to personal use via your live-in boyfriend.. As in the Smollett case, have you no shame?!? | Best reply of the day | Truly, Fox won’t care less, and this girl’s whiny rhetoric is getting old fast. A damn raise certainly isn’t in order.! | (Go to Congress-Become a millionaire) | Cry me a river, and bring out the tiny violins.. | I can only hope you’re being satirical | Awww..", " pic.twitter.com/QRDH53HchL | Guess the missing word! \nYou're talking out your _____! \n pic.twitter.com/sCq0TNtryz | What size do you wear? We may need to send you a straight jacket after today!  pic.twitter.com/C9CIy4TiSs |  pic.twitter.com/opgiKelOYI | You're not taking our guns, Cortez! \n\n\"A well regulated Militia, being necessary to the security of a free State, the right of the people to keep and bear Arms, shall not be infringed.\"\n\nYou will not infringe on my right to bear arms! \nBy all means move to NZ or Venezuela. pic.twitter.com/lXPosNVIQT | Odd,  you would say that.  \nWomen are beaten or killed for not wearing a hijab, in your religion! \n\nThat is oprression, not what you are  claiming it to be?\n\nHow can you hide this fact? pic.twitter.com/5nj0ES6wLc", " pic.twitter.com/DYGtqpn1Bl |  pic.twitter.com/qC8h1Y8a36 |  pic.twitter.com/FR6JDfIs6k |  pic.twitter.com/lLP784ap3H |  pic.twitter.com/4qL7EPAFRm | Green new deal! pic.twitter.com/CglINYhRRt |  https://www.naturalnews.com/2019-03-30-socialism-is-already-collapsing-in-the-usa-as-residents-flee.html … |  https://www.naturalnews.com/2019-03-30-socialism-is-already-collapsing-in-the-usa-as-residents-flee.html …", " pic.twitter.com/zo45JUrOIh |  pic.twitter.com/aBRwpJOKgP |  pic.twitter.com/7Yk9pkJ6Zs | Lunatic pic.twitter.com/whpoVPW1tR | Ignorant and sad!  Tick tock pic.twitter.com/KOHmsrAXCG |  pic.twitter.com/uTH591I2Qw |  pic.twitter.com/jUQ8O6JA2b | More Crazy ramblings from a socialist pic.twitter.com/rphMRQQVqT |  pic.twitter.com/JTpd36xI52", "Ocasio-Cortez is so hyper sensitive to criticism. And it’s hilarious. pic.twitter.com/bm124q7zLe | I studied Econ 101 at UT.  Not trying to be a snob but that Wikipedia reference makes you look like a -6 year old paid by Ocasio-Cortez’s media team to cheerlead support for their twitter game.   | Not sure you’re studying the same Econ 101 as the rest of the world.  LOL | I just find it equally disgusting and amusing watching a naive and inexperienced @aoc coming of age into reality at everyone else’s expense.  Seriously, haven’t we all been self righteous judgmental 20 somethings at some point in our lives? To be 29 while acting 16.. | Well they get paid to tweet anti GOP texts. basically, it’s barely legal election meddling. | Exactly. And yet @AOC followers have no idea that not a single democrat voted in support of her green new deal. Or they chose to believe it’s some sort of hoax by the GOP. Smh | PS The rest of the country could care less about your stupid ideas and absurd movements.   Dear NY, Grow the F up no one cares.  Signed, everyone else. | And thanks for showering your narcissism Ocasio-Cortez | But when the head of greenpiece called her an airhead twit the other day? ..  | It’s not a conspiracy ya dope, look for yourself lol | There is a reason AOC supporters are young people and teenagers. They don’t know any better.  Sad really. | Idiot. | I realize this is off topic, but can she comment on why she so quietly had to remove herself from the Board of Justice Democrats due to looming campaign finance violations? | Pivot pivot pivot pic.twitter.com/j2QPabOlu2 | And then there’s this.. https://www.foxnews.com/politics/greenpeace-co-founder-tears-into-ocasio-cortez-green-new-deal-pompous-little-twit … | So brave and legit of her to read so inspiringly from a script. | In 2 words: @aoc deflection. | This isn’t even true.  Despite Waleed’s pandering and stroking of racism , the reason the networks  criticize Ocasio is because she is an endless gaffe.   GTFO with those plain lies and that racism Waleed | Because twitter is where the real stand-for-something occurs right?  "], ["If it were not for DJT the democrat party would have gone extinct... as it is, even with the fake news and witch hunts, you guys are leaping off the cliff all on your own...when Mueller crashes and burns what next? Moving to MARS, I hope? | Unions were once necessary to stop child labor, employee abuse etc...then they became worse than management...controlled by the mafia in most cases..I can give you fifty horrific stories in business that I experienced with unions...high wages, thievery, incompetents kept on etc | 3) do any of you ever study the impact of sun spots or volcanoes on climate?  Know what the Maunder Minimum was? betcha dont and you claim to know it all esp in climate change arena...lol  well let me DEFINE it for you so you can learn you might need more research time...contd | 1)IN the documentary LITTLE ICE AGE THE BIG CHILL the earths ambient temp was much higher than today?  Go rent it and learn...MAN had NO IMPACT on that huge warming period before 1350 known as The Medieval Climatic Optimum” or the “Little Climatic Optimum”. contd | Why dont you get off your ass like my church does and go over to places like Cambodia and save young gals from the sex trafficking trade..OR there are 3 MILLION in the USA, kids, who go to bed hungry each night..bet the ONLY thing you do is try to tax others dontcha? | He is a flaming liberal and activist..blinded by emotion and unwilling to make changes unless they are HIS changes..AFRAID of change?   lol  what the F is he now a mind reading psychologist?  Compromise does not exist in the dem party for the last fifteen years..my way or highway | No, these are questions of the rule of law, or partisan politics, of irrational behaviore, of NO probable cause, of NO due process, of beating the constitution to death with opinions and falsehoods..etc...and the tragic phenomenon shrinks are now calling Mass Trump Hysteria synd | When people want 2push buttons to get an overreaction they use certain  hot terms...the C word for women, the C sucker word for men, insult ones mom, etc etc...it is the sad nature of most humans to lash out with such comments..success in life is to IGNORE the fools..they hate it | 2 products we can sell overseas..this creates a brand new income stream to enhance growth...it adds to the service jobs that only keep money circulating, important but not like a mfr job...its like america gets a second job..a new revenue stream that helps immensely. wow.. | NOT YOUR POSITION to do it- then you go ahead and do it anyway..when racist comments are made against whites, do you think their feelings are hurt? Or against MEN, do you think their feelings are hurt? Or does it matter with you since you never seem to mention them in your rants | Sensitivity is all relative aint it?  grow up...it is not my job to make sure your iddy biddy feelings are not hurt..hey...PC is on the way out..failed big time..along with helicopter moms, women rule and Hillary would make a great POTUS..all false and failed words | It is the same with each generation. we know it all and are going to save the world...she does not realize that ten years from now many things and ideas will change..they do each ten years of our lives..nothing new there..she is still WET BEHIND THE EARS..too young.. | 1 Ah again the left shows their lack of understanding of even basic terms...shovel ready infrastructure jobs are NOT NOT NOT manufacturing jobs..hellooo...got it?  Once the bridge is built the job is over except for a few maintenance contracts..got it..MFR jobs produce products | 3) you are so desperate to keep the MASS TRUMP HYSTERIA SYNDROME going that you reach for everything no matter how minor..NOTHING in two years and two dozen investigations found ONE thing wrong...dont you trust the LERNER auditors to find out anything wrong during the audit? | Did  u KNOW that China  India pollute at a rate MUCH more than the USA..that we have come a long way in four decades?  That just the use of new clean burning gas has dropped our negative env impact by lots?  OIL and GAS has and will seeps to the surface on its own..PRUDHOE BAY? | historic victories...wow you live in a dream world...YOUR Heroes, Obama and HRC etc lost the HOUSE< SENATE< POTUS< SCOTUS and over ONE THOUSAND State dem seats ...lol...and ya won back forty or so? WOWW  a freaking chimp could have done better...lol | Your party has a long history of lying and trying to fix elections..know who Mary Mapes/Dan Rather are? FIRED FROM 60 minutes for forging documents re GW BUSH MILITARY career, or Debbie Wash Her Mans Shorts forced to resign for her unethical behavior re HRC..continued | REALLY???? pal you had best go read two of her previous posts here where she cites polls in IOWA shoe ninety plus percent of voters there favor this ridiculous new deal...isnt that showing she is more interested in POPULARITY??? oh noooo!!! lol | U activists need to start a business with YOUR OWN MONEY...see how long yu would stick to political correctness, hiring based on color, not using actuarial tables etc...many whites have very low scores ...so what...do you want the rest of the policyholders to pay MORE for them? | Ur a classic example of childish uniformed dissonant reasoning, convoluted logic who determines what is bigoted or not? U?  your constant stereotyping is dangerous.HISTORY for 6 thousand years reveals that stereotyping as you do is the precursor to ethnic cleansing and genocide! | The majority disnt want it??? prove that and no polls please...I can give you one for one that reads the opposite...again , your fantasy land of opinions and beleifs has no place in the world of truth and facts ..but keep bashing your party...ya aint gonna do well in 2020 anyway | so she got the convicted liar, bank fraud dude to admit WITHOUT ONE SHRED OF HARD EVIDENCE, that yada yada yada?  do you girls KNOW what HERESAY is in a court like that? INADMISSABLE...never mind the shitty character of the witness..you all should win gullible trophies...lol | 3) rehired by MSNBC, the propaganda machine of the left right up to the man I voted for, Wild Bill Clinton who is the second POTUS in history to be impeached by the House for what? LYING UNDER OATH...want more...I have plenty.start with R BAGOYAVICH still in jail!! lol | the investigation phase WITHOUT some evidence or probable cause./..dictators and the British we overthrew would do that...or folks in Salem did that in their witch hunts...to investigate to try to find a crime, ANY crime, w/o probable cause is unamerican and unconstitutional... | Wow what a gal!  What a woman!  Any chance the alleged heckler was a plant so she could write this bit?  dont tell me they dont do such things...happens all the time..stack the crowd with a shill to make it seem like you are something else than yu are...unethical? yup | another blatant false equivalency...in fact, the phrase should be FOR EVERY action there is an opposite and equal reaction...or NATURE HATES A VACUUM...or ROBBING PETER TO PAY PAUL...these have long and deep meanings...unless you can create something from nothing..well...lol | 1) Hajib usually means SHARIA law which is so anti woman in so many ways...and thus it is UNCONSTITUTIONAL...like when DT made that comment about the Muslim and wife you guys dragged onto your DNC stage..TRUMP said she was probably under his thumb and you folks went ballistic.. | Source? anonymous I bet...and even if not it is ONLY ONE FREAKING OPINION..she rants a lot...style but not one bit of real meaning substance...proof will be in the pudding...wasnt the pilot who just crashed the ethiopian jet the same age as she? OH NOOOOOOO lol | Have you sought any professional help???NO QUESTION?  hell, what facts, evidence did he show...nada...a convicted liar who screwed over banks and others in his own life and now he goes on a witch hunt set up by uber Clinton Loyalist Lanny Davis...wow...and you saw all that? | C'mon....who read it to ya? | The left had the worst election record in history..in eight years they lost the house the Senate, the POTUS and SCOTUS plus over ONE THOUSAND LEGISLATIVE seats...hell a monkey could have won more seats than the left did...lol...they are a broken penniless party..divided! | The RIGHT WING? uh..is that the sixty five MILLION folks who vote GOP? so how many of the 65000000 did you interview to make such an incredible stereotyping statement?  jsut give us the names and addresses of the first two million you talked to, ok? | did you know that over three MILLION children in the USA go to bed hungry each nite?  Puerto Rico has been a third world counrty for decades with no effort by their government to change except demand more from our government teat...study HISTORY will ya? | How incredibly hateful and shallow and ignorant for you to take one mans statement and put words into his mouth..my god the white supremacy bullcrap was HUGE in my college days in the sixties..there are very small groups who believe that ideology and U give them more credit..wow | What children, what records  how many? who said it was that drug?  do you beleive everything you read or are told?  you make bold statements with not one bit of sourcing or names or dates or details...just puke them out there and they MUST be true because U said them?? lol | OBJECTION YOUR HONOR...HERESAY!  INADMISSABLE...the jury will disregard the last testimony by the witness , a convicted liar. and the court clerk shall stirke it from the record...now THAT is reality...perhaps a remedial course in LAW 101..? wow...and you get to vote? damn | Harvard U reported that FOX is now fifty percent liberal...it is true...Shep Smith, gay, is so anti-Trump it hurts...Chris Wallace is a registered democrat...and more..much more..to stereotype the entire network is so typical and incorrect of you...MSNBC is the propaganda machine | and HOMOPHOBES< DEPLORABLES< ISLAMOPHOBES< BIGOTS< FALSE WAR ON WOMEN< ETC ETC AD NAUSEA>..you lefties excel at labels and namecalling hell ya changed global warming, Boston M bombers to manmade disasters, fort hood shoot to workplace violence etc etc etc etc etc puke puke puke | \"Let every nation know, whether it wishes us well or ill, that we shall pay any price, bear any burden, meet any hardship, support any friend, oppose any foe to assure the survival and the success of liberty\". John F. Kennedy Hussein was a killer and tyrant. | 7) of baby boomers...no such luck...evil exists as Bertolt Brecht warned and it is growing...so you have seen the effects of war...so what...go tell Ghenghis Khan or Napoleon or the Vikings, Greeks, Romans etc your rose colored dream..honey, yu dont have the slightest clue..scary | Wow  u sure are good at taking a minor incident and blowing it up into a huge daily occurence...mountains out of molehills?  False equivalencies again?  ADVICE..ya oughta wait two days and read your tweets or emails before you post them...your ship is sinking fast and NO CLUE. | I did not know you were Irish? lol | Would the departed all be MEN?  rhetorical...lol..I already know your answer...do you have any men working for you?  rhetorical again...proof...see cover of Rolling Stones magazine and title of it What is the term 4a FEMALE MYSOGINIST? none? lol  We used2call them male bashers | bullshit...sadamm was a killer, his sons raped underage girls, he killed over 175000 kurdish men, women and kids.  He gassed even more in the Iran/Iraq war, he invaded helpless Kuwait, he killed relatives and friends who disagreed..he had torture chambers...do some gd research!!! | One bitter lesson U will hopefully learn as you age is you must EARN RESPECT...civility is given due to the mores of society but I dont have to respect you for anything on this planet nor you me...we all have free will..if nothing U can say is meaningful then adios!!!  my call | Did you know the Greeks coined a term that was only used to describe women? HYSTERIA...learned that from the great Marcia Clark during the OJ Simpson trial...the left is the master of labels and name calling...from HRC deplorable comment to all your labels for men or the right.. | u clowns need to watch the LITTLE ICE AGE the BIGCHILL...the earth was much warmer before ca 1350..why? no planes no boats no cars or trucks and few people..how can that be...? MAN DID NOT CAUSE that warming period..but you folks refuse to discuss it..why is that? | More of your FALSE EQUIVALENCY...quesitoning in a knowledgeable, informed polite way is not the same as making racist comments to make a point...or anit semitic in this case...I guess if a MAN had said her words you would be pooping out the other end of your mouth..eh? | Kinda like keeping a convicted liar, impeached by the House, philanderer, adulterer etc in the office of POTUS...oh nooo...not a comp?  Did you ever READ and UNDERSTAND history?? except for the liberal revisionist crap?  there are folks out there who want you and me dead!!  hello | How about anti white? How about attacking OLD white males?  Is racism only white against blacks?  Hell, there are more black racists now per capita than white by a long shot...do you EVER think outside the box or do others think and write for ya? | Yu keep leaving out WHITE RACISM (Racist against whites) and the bigoty against men, especially OLDER WHITE MALES>..or are they ok in your dictionary? rhetorical...I already KNOW how you think on those two topics...does HYPOCRITE mean a thing with U? | No problem with critiquing if ya have one iota of training in foreign policy, know the lessons of history well, and understand strategy and the dangers in the world...go read BERTOLT BRECHTs quote on hitler..or JFK on standing up for freedom, and so so many more. NO clue eh? | The only real numbers that count internationally accepted to measure the health and growth of an economy is the quarterly change in GDP...UNDER OBAMA, he left office with the FOURTH WORSE GDP RECORD with all other POTUS..go google it..his fake jobs were all low income burger flip | Also, I and a dozen or so friends have no clue what the H your third bullet even means???  INVESTING HOW?  DIGNIFIED JOBS?? what does that mean? who declares my job has no dignity but yours or theirs does.. your wild butt rants steeped in non reality with no facts are scary... | its good to see youre doing your job and not wasting my dollars on fundraising..oh nooooo...oops...what is the ratio of fund raising time spent to actual work for constituency?  lol  rhetorical  dont bother | Kinda like the chauvinistic like photo of four of you on the cover of RS magazine?  parading an agenda with a false title and narrative? How did women do with their first big move...PROHIBITION?  we got organized crime, the Mafia, bootlegging, Murder INc from that abortion"], ["Also Evident in #GentrificationOfCulture™ #bias + #exclusion in #Arts + #media ; #Cultures r now #connoisseurs of #music + #movies : BOTH #jaded + #gullible : 'worshipping' #CorporateArt + perpetuating #Greed which = #Misogyny #Racism #ClimateDenial https://itunes.apple.com/us/movie/eve-n-god-this-female-is-not-yet-rated/id1447735793 … | Also #GentrificationOfCulture™ #bias + #exclusion in #Arts + #media ; #Cultures r now #connoisseurs of #music + #movies : BOTH #jaded + #gullible : 'worshipping' #CorporateArt + perpetuating #Greed which = #Misogyny #Racism #ClimateDenial   https://itunes.apple.com/us/movie/eve-n-god-this-female-is-not-yet-rated/id1447735793 … #GreenNewDeal pic.twitter.com/og9d94B2Tf | Also Evident in #GentrificationOfCulture™ #bias + #exclusion in #Arts + #media ; #Cultures r now #connoisseurs of #music + #movies : BOTH #jaded + #gullible : 'worshipping' #CorporateArt + perpetuating #Greed which = #Misogyny #Racism #ClimateDenial   https://itunes.apple.com/us/movie/eve-n-god-this-female-is-not-yet-rated/id1447735793 … pic.twitter.com/IjlcMVRUdr | BluePlanetGreenSpaces™MotherEarthSisterOcean™CaliLiliIndies™VenusBeach CuttingEdgeOfThePacific™  #MotherEarth #SaveOurMotherEarth™ #SaveOurSisterSea™ #ClimateChange #Oceans #sealife #SaveOurSeas #SaveMotherEarth https://itunes.apple.com/us/movie/eve-n-god-this-female-is-not-yet-rated/id1447735793 … | #GlobalFeminism = #GlobalPeace  #DiaDeLaMujer\n#RockTheVote \n#VotingRights \n#WomenInJournalism  #WomenInLaw #PlannedParenthood #LGBTQ #BLM #WOC #QWOC #HR1 #WomensHistoryMonth #InternationalWomensDay\n#IWD2019\n#WomensDay  https://itunes.apple.com/us/movie/eve-n-god-this-female-is-not-yet-rated/id1447735793 … #GirlsVote #DiaInternacionaDeLaMujer | BuyMoviesFromTheMaker™  #Support my #tiny feMt0™studi0 born from #MeToo\n+ #evolved into my #1OfAKind  PoeticJusticeProjeX™  #femalecrew #NoBigDough™$ SupportTheARTSustainTheARTiST™ #WomensRights #LGBTQ #BLM #WOC #QWOC  #WomensHistoryMonth #IWD2019 https://itunes.apple.com/us/movie/eve-n-god-this-female-is-not-yet-rated/id1447735793 … | BuyMoviesFromTheMaker™  #Support my #tiny feMt0™studi0 born from #MeToo\n+ #evolved into my #1OfAKind  PoeticJusticeProjeX™  #femalecrew #NoBigDough™$ SupportTheARTSustainTheARTiST™ #WomensRights #LGBTQ #BLM #WOC #QWOC  #WomensHistoryMonth #IWD2019 https://itunes.apple.com/us/movie/eve-n-god-this-female-is-not-yet-rated/id1447735793 … | #NOH8meansNOH8 #NoLabels \n#GlobalFeminism = #GlobalPeace  #DiaDeLaMujer\n#VotingRights \n#WomenInJournalism  #WomenInLaw #PlannedParenthood #LGBTQ #BLM #WOC #QWOC  #WomensHistoryMonth #InternationalWomensDay\n#IWD2019\n  https://itunes.apple.com/us/movie/eve-n-god-this-female-is-not-yet-rated/id1447735793 …   #DiaInternacionaDeLaMujer @LatinoUSA | As a #culture we must address this : the message sent out to #Women + #Girls #FemaleVoters #GirlVote  #WomensHistoryMonth  #DoubleStandard : that it was ok 2 affect #candidacy + #privacy of @HillaryClinton ; but now we're more careful?  #MuellerReport ; #GirlTheVote #GirlTheGov pic.twitter.com/PFg5OStSP0"], ["Hey there pretty lady, don't speak to which you know nothing about! The #YellowVests protest are about over reaching of authoritarian governments. It's not just in France you Twit! Phony Crony Socialism masquerading as Capitalism. Read a Book, damn it! |  https://twitter.com/CraigRSawyer/status/1111380565758865408?s=19 … |  https://www.pscp.tv/w/b1Z9vjFBbVF6T3lXbGdQS2V8MW1yR21ZYWRPeURHeUXBxJjcaFqG3RlnY7DVgWaJordy83gK9lYhQe7O1xYJ … |  https://www.pscp.tv/w/b1Z9vjFBbVF6T3lXbGdQS2V8MW1yR21ZYWRPeURHeUXBxJjcaFqG3RlnY7DVgWaJordy83gK9lYhQe7O1xYJ … |  pic.twitter.com/8bOgFakknc |  pic.twitter.com/sg5trCSaOc |  pic.twitter.com/9yzaE00qUO |  https://www.pscp.tv/w/b0__xjFBbVF6T3lXbGdQS2V8MVlxR29yUmxwWU5LdkFNACSxgDsvgzERiciaFq-znY6861gagM0rHaKxC6Rz … |  pic.twitter.com/O0lH2yS0SB |  pic.twitter.com/dEAEmxlIaK |  pic.twitter.com/pOJ9xlp4ta |  pic.twitter.com/CCqMrK2hsA |  pic.twitter.com/JTNzSsZWgn |  pic.twitter.com/AwTrNkWMGs |  pic.twitter.com/UzNNfXfmV3 |  pic.twitter.com/Csn77jmDTm |  pic.twitter.com/scerhr4eL4 |  pic.twitter.com/fdO3gmc7qN |  pic.twitter.com/GGAccH3SXR |  pic.twitter.com/GjFS7GAV2Z |  pic.twitter.com/nJZ8BAVhlm |  pic.twitter.com/EsrlrCcMmp |  pic.twitter.com/69DOYB4DfW |  pic.twitter.com/dhw7Nr6EWK |  pic.twitter.com/kMYlhwreOV |  pic.twitter.com/CzhYDPLulP |  pic.twitter.com/bvv1kaiJIi |  pic.twitter.com/gYY9YmfnDr |  pic.twitter.com/YB2m55qO1o |  pic.twitter.com/qEvkW5TbZ0 |  pic.twitter.com/4mABtkaHVz |  pic.twitter.com/8JPBnMZ4J6 |  pic.twitter.com/60GscxhQIC |  pic.twitter.com/bRiy4OttwA |  pic.twitter.com/pwMnKYtUAZ |  pic.twitter.com/NWVzGphX6r |  pic.twitter.com/EKVQKYzMOq |  pic.twitter.com/wxMJA0kQ8P |  pic.twitter.com/cdcw1MpJpF |  pic.twitter.com/Kh1GvHyVhL |  https://www.pscp.tv/w/b1Z9vjFBbVF6T3lXbGdQS2V8MW1yR21ZYWRPeURHeUXBxJjcaFqG3RlnY7DVgWaJordy83gK9lYhQe7O1xYJ … |  pic.twitter.com/DwZNREw7EB |  pic.twitter.com/DeA4tB3rFN |  pic.twitter.com/OgJiXafj2u |  pic.twitter.com/Dp333LgAfK |  pic.twitter.com/9fzMtKCWUx |  pic.twitter.com/YZZXAtPkFj |  pic.twitter.com/jLt7ALZ5vZ |  pic.twitter.com/RbUmwE3sFl |  pic.twitter.com/k2qyFXt0J7 |  pic.twitter.com/PfzP69l5WA |  pic.twitter.com/B9lsKsoEbW |  pic.twitter.com/t8cN93QVxg |  pic.twitter.com/z3RLMprfrV |  pic.twitter.com/uyTTBzDNpe |  pic.twitter.com/hW5S1Pub59 |  pic.twitter.com/ZIdPOEtKhY |  pic.twitter.com/Qthcus9V7k |  pic.twitter.com/pF3qlQp7jt |  pic.twitter.com/xTwnFhZqYf |  pic.twitter.com/g8LqDmFSVt |  pic.twitter.com/KFkGMl8SSI |  pic.twitter.com/P4xFlKWQRQ |  pic.twitter.com/tNSxMbkNux |  pic.twitter.com/mZTF01pF8h |  pic.twitter.com/mDTVUzT37c |  pic.twitter.com/QyK5dz7Ngv |  pic.twitter.com/QtbPCZ5lRS |  pic.twitter.com/WMiPGYYXfx |  pic.twitter.com/sqdhLxSN15 |  pic.twitter.com/iu2CTdi1sV"], ["Holy shit. The incoherent rambling stopped and I noticed that she was going on script which was obvious. Omg | I didn’t want to download the book?  What is the book about and when was it published? | 2/4 That bill by Marino went unopposed by the house and the senate. And the DEA agent that spoke up lost his job. I don’t want my taxpayer money going to drug addicts who don’t have the ability to say no. Drug addicts  should have to deal with insurance like everybody else and... | Ppl with cancer get all the health care they need. It’s the neurological conditions like Parkinson’s, Alzheimer’s,, MS or RS D they don’t get the help. Only 2 to 5% of pain patients become addicted. Their pain medicine cut off and they’re committing suicide and an alarming rate. pic.twitter.com/FHKumkxA4S | 4’4 pain medication is being taken away from pain patients that are now committing suicide at an alarming rate. Only 2 to 5% of pain patients become addicted. Many towns can no longer afford to save these drug addict life’s because they’re overdosing three or four times a week. | I don’t want my taxpayer money going to drag Alex. I would rather the money go to people that will take the help and do something useful with it. I think the revolving door on rehab is incredibly high. | White or brown I don’t care. I don’t want my taxpayers money going to drug addicts. They should have to deal with insurance like every other person with an illness in this country and not be given health care because our healthcare in America sucks. | They’re going to cut food stamps in America soon we’re not far behind | Thank @justicedems  it is their agenda. | There are ppl in USA that do not eat there are homeless people, mentally ill, jail overcrowding, poor education, unlivable apartments, there are so many things in America that we need help with why don’t we focus on America and try to pretend for one moment you are  not a racist. | What is the question being added. | Being a condescending ******* on social media doesn’t help. The reason for those numbers is because I didn’t put in an email. It’s an anonymous account. She didn’t have the intelligence to understand what a tax abatement is yet she wants to change the tax code. | AOC doesn’t have the cognitive ability to think through all the parts of what she’s trying to say or do. The document is extremely juvenile and she excludes Americans and white men. she hates anybody that is  more successful than her. | Great your supporting an Indian in Texas and a White man in Tennessee. Now we have the left being supported by money and the right being supported by money and the agendas are going to destroy democracy why don’t you give another $100. | @AOC is run by @justicedems . She doesn’t do any thinking on her own. They script everything and practice with her. Her brother sent an audition tape to that group. They interviewed her. 10, 000 people for a branding position. @AOC had no . aspirations beyond bartending. | I am well versed with the events surrounding Bernard madiff I assure you with my background thst document means nothing, And it was not timed stamped.  No way to prove if you sent it before or after . Please be am idiot and give more.  There are homeless children in this world. | Clowns to the left, jokers to the right. I’m stuck in the middle you’re not because you gave her $100.  And I don’t believe for a minute you did that. | The @justicedems  might be wrong. . In that statute f3 used the word”or”. That indicates that a report must be filed under f1 or F2 not both.. it’s possible @justicedems might be wrong and they’re right. The content between F1 and F2 is vague. Most statutes are very badly written | No we hate her now. | Only 2-5% of Pain patients become addicted To narcotics.  Drug addicts make a choice to say no. Mental health, decades. Homelessness, healthcare, education, and the hungry are  crises. drug addicts like everybody else should deal with insurance pic.twitter.com/PnKdhWtxfx | I’ve worked with victims of domestic violence and my heart goes out to them because Many can’t leave for financial reasons. Passing a fed law does not mandate that each state follow. federalism is not working and I believe we should have one set of laws that everybody follows..", "So @nypost, I’m a New Yorker and for the green deal. How do you suggest we all get around in the dead of winter & going forward while we pressure companies to become more eco-friendly... I’ll go first, purchase a Spiderman suit and pretend I can swing from building to building? | Well stated. The Republicans are truly the anti-everyone agenda party. Just when you think they can’t sink any lower. \n\nThankfully they can halt it... to everyone who voted in the midterms, thank you, this is why your vote matters. | So discourage them to vote since they now have the right to vote with a #PollTax so Florida continues to swing red. That’s shady AF. | @MarkRuffalo =  | The sad reality is, Republicans will think 7 students of color is progress. | I’m just tired of seeing Tucker Carlson’s face/name in my feed. \n\nMake it go away. | Thank you @AOC for despising him just as much as we do. \n\nfake president. | Boxed soup to go with my boxed wine tonight... anybody want to join me? | Last night at the Great Lakes “rally” they were chanting “@AOC sucks” with their red cult hats on... \n\nThanks for displaying civility with your platform. | @AOC you are crushing it! Start dancing in there and drive them all fucking nuts. | Change is in the air... \n\nCongrats @AOC! | LIKE* this if you will be watching @AOC tonight/or later via streaming on @LateNightSeth! | Facts don’t lie. \nConservatives ignore them. | LIKE/RT to get #AOCAllin top trending... \n\n@AOC deserves it & conservatives won’t be able to sleep tonight. | In my lifetime, 2 out of 3 presidents have lost the popular vote but still won the election. The majority has been silenced by the @GOP, but that’s all about to change. | It’s scientific fact the climate change is real and @AOC is here to stay. | I’ll be watching with a glass of wine... who’s with me? | To all the haters... \n\nClimate Change is real. \n#facts | You slayed this... period! | So many trolls & clout chasers in here. \n\nKeep up the clapback @AOC  | The system is rigged and it’s not in our favor... The living wage is a joke. Salaries are stagnant and nothing is “trickling” down from the top. The middle class is all but extinct. Change is needed and change is coming. | It’s definitely normal to question yourself. Someone asked me yesterday, “what are we even resisting anymore?” You are quickly reminded that liberty, our climate, and humanity are at stake. \n#Obamacare is under attack again. \n\nWe must continue to fight for future generations. | @DonaldJTrumpJr is toxic masculinity minus the masculinity. \n\nThanks for having our backs cuz we have yours. | Wilbur Ross is getting caught up in all his lies like all these crooks do. \n\nLock them all up. | I stand with @AOC \n\nWho’s with me? | The Resister Sisters  | Not only admissions... countless times while working in the office of judical affairs I saw kids that should’ve been handed big punishments (expelled), were simply let off the hook cuz their parents were big alumni donors. \n\nMoney talks. | Twitter > Facebook & Instagram \nand yes it’s still down.\n#FacebookDown | @AOC and @IlhanMN are the future, they expose corruption, and they’re not going anywhere. That scares the shit out of conservatives and rightfully so. | My morning jam is David Bowie on my headphones as I walk the streets of NYC. \n\nWhat’s your morning jam? \n\n#FridayFeeling | I Agree Judi.  | Que the @AOC Twitter troll bots... Always hating cuz haters gonna hate. | It’s also leadership that hasn’t been bought by the @NRA. | We stand with you @AOC. Continue to lead and scare the shit out of all those who oppose and oppress. \n\nWe will prevail! | A honest conversation is all we ask of all our elected officials. Thank you for being an example of civility. \n\nIt’s an example most politicians can learn from. | Republican climate change plan: \nME, MYSELF, & I. | You just lassoed this rodeo troll. \n\nowned by @AOC | Realistic vs. unrealistic:\nI was with my relatives not to long ago & they were talking about the weather. Talking about how in all their years they’ve never seen anything like this. The twist is, for them it fulfills prophecy of the Bible & they are excited about the end times. | The wall (if it’s built) will still be there after we are all gone. A lasting legacy of conservative stupidity for future inhabitants of the earth to figure out why it exists. This may sound stupid but it’s more stupid not to believe in climate change. Climate change is real. | Ideal roadmap: \nGet rid of Trump 1st... \nThen the Green New Deal. \n\n#MuellerFriday | Paul Manafort is what’s broken. \nWe elected @AOC to fix this shit. | If they call me a socialist cuz I stand for: \nMiddle class tax relief\nBillionaire tax increase \nUniversal Healthcare\nEnvironmental Justice\nRacial Justice\nLGBTQ Equality\nWomen’s rights\nA living wage\nGun Reform\nAffordable college\nClimate Change \n#ClimateStrike \n\nThen go 4 it!", "There is no larger supremacist group than anyone practicing Islam. It's a totalitarian theocracy & it should not be running roughshod against our constitution. People need to stop being afraid to offend Islam. We are protected by the 1A. Anyone putting sharia above constitution.. | So glad I missed it! | Omar is working on another aspect of jihad by claiming persecution she is seeking pity & the weak in return will convert if she presses hard enough. | ??? | Taqiyya is actually a little different. It literally means \"deception\" & those who practice taqiyya like Tlaib take off their hijabs with the blessing of Islam so long as they are working to advance Islam. They drink, wear bikinis, eat pork & uncover their heads to infiltrate | Shouldn't be allowed 1A rights | I've read that Jews have been sworn in on the Torah & some atheists like to be sworn in on their law degrees. It's the literal oath that matters. She wasn't the first to swear in on the Q'ran either. Keith Ellison had too. | I've been asking to find out where she denounced sharia before taking the constitutional oath of office & nobody has an answer... | It really doesn't matter what book they use for a religious higher power to bless the oath they take, what matters more is if she condones the laws of Islam over the constitution. Islam isn't merely religion. It's a theocratic political system so the oath to put constituion first | MUST be put before any & all other laws in her life. | Well, I don't see the book people swear on as anything other than seeking God or Buddah or Mother Nature as their higher power for strength when upholding the constitution. I totally agree that if she hasn't denounced sharia while swearing on the Q'ran she's betrayed the oath | Ok debate me! Let's talk in 13 yrs when your name is synonymous with John Napier & Herbert Armstrong k? | Now, which party has been continuing such enslavement? ..gee find that out & you discover the entire ruse teaching gen z & milenials (because the idea wasn't passed around until 90s) there was a party switch in the 60s | Codependence on government via consent of the governed. (Democrat) So why do they consent to give up their independence? Well, scare tactics, thinking the world is going to face catastrophic damage without their money in 12 yrs, they don't make enough, telling them their props... | In the 60s Plessey v Furgeson was finally overturned by decision of Brown v BOE. SCOTUS decision of Plessey v Furgeson made \"Jim crow\" segregation \"constitutionally\" legal. There isn't even a \"race war\" as people like to call it. It's simply maintain independence (Republican) vs~ | I've never been a leftist. I'm certainly not 90. It was the leftists, back when I was in high school who pushed me away because they were forceful, controlling know it all who tried using scare tactics the means of AOC back then only they didn't wear vaginas on their heads. | Good to know. Thanks for making me go back & see where I err'd in reading your tweet. I was way off base after I reread the convo, lol.. | All democrats especially AOC need to go away. | Lmao! The democrats couldn't have a more perfect \"token\" for a female member of ethnic background than YOU! | She quite literally brands herself as a \"token\" female, \"person of color\"on the democrat side but condemns people as \"tokens\" for republicans against all rational thinking or truth. That's brash & quite frightening because it's so obvious too! | Full o' crap. Sorry but fear mongering & scare tactics like the chicken little induced \"Green New Deal\" & Medicare for all don't work in flyover country. We know & respect work ethic by the Grace of God here. Values of independence are higher than those who need to be codependent", "LMFAO he must of really burned patience I only muted so I can dive in for more when I have time. | Can you say God! He created all and belongs to Him and Him alone! He's not happy with satanic minded and per His past uses climate to warn to change your ways! So proud of Senate's vote yesterday that keep the cows farting and happy!! Your a joke. #Maga \n\n https://www.suijuriscourtangels.com  pic.twitter.com/TBL7mvFk6Y | Brainwash being feed by illiberals, we've all gotta story to tell... an #Americans story... #KeepAmericaBeautiful #LandOfTheFree and #HomeOfTheBrave send these hashtags viral it's truly what #America is has been about!! #Communist need to get packing!!\n\n https://www.suijuriscourtangels.com  pic.twitter.com/ZQZ2J0mRGR | Lol see the troll moved on you instead... good luck and if looks interesting I'll un-mute to join in. | Me too was having fun but began to bore me as he isn't about learning but trolling. | Ditto | So much disrespect and antisocial response from you! Give you benefit of doubt, you bring dishonor to parents who conceived (thank God you weren't late term after born abortion), @POTUS who works hard for you and a Country of #love #GodBlessAmerica #MAGA \n\n https://www.suijuriscourtangels.com  pic.twitter.com/S50KqLpWVK | She was... big money was paid to put her in there as in: #DrainTheDeepStateSwamp | What would you ask and for whom? Not me but you should! I can tell you first hand (my son) and show you how illiberals operations in all phases of crisis. You're being played along with the first muslims banging multitasking. Are you a political assassin?\n\n https://www.suijuriscourtangels.com  pic.twitter.com/wOrinEgDee | \"If the American People ever allow private banks to control the issue of their money the banks and corporations that will grow up around them will deprive the people of their property until their children will wake up homeless . . . \" Thomas Jefferson\n\n https://www.suijuriscourtangels.com  pic.twitter.com/VbCUKVxbHP | A liberal democracy is a representative democracy with protection for individual liberty and property by rule of law. An illiberal democracy has weak or no limits on the power of the elected representatives to rule as they please. Strong is liberal #MAGA \n\n https://www.suijuriscourtangels.com  pic.twitter.com/UpRnEeFs7M | Re-education is American problem before go further with \"#liberalshitshow\" what if told you your liberal and don't know it? Google illiberal vs Liberal Democracy get ready to #WakeUp I'm a Liberal Conservative AOC is illiberal democrat. Prove me wrong!\n\n https://www.suijuriscourtangels.com  pic.twitter.com/3bUgKLVrwK", " pic.twitter.com/y5SpdaZNpL | Says you | A party that calls itself \"Democratic\" abhors \"Democracy\", the irony is so rich. | Great role model for young girls, especially young girls of color who often don't get to see people like them in positions of power.  | Done! Donated to all 3. |  pic.twitter.com/jcsPf0ojjF |  pic.twitter.com/oaRq64WUpU | She maybe single-handedly keeping CSPAN afloat. If you look at her hearings in CSPAN in YouTube, she has a lot views. | Keep calling the shots ma'am.  pic.twitter.com/4OhtLhhHM3 | It's the \"maid is getting uppity\" attitude that he has. He has probably never had to answer for his actions let alone from a 29 yr old Latina. | And I see you're also tremouring from all those earthquakes caused by fracking. | Trump and Reagan, your right wing saviours are from Hollywood/TV. | Yeah, he won by the majority of the American voters right? | Sexism, misogyny and male chauvinism was cool in the 50s not 2019. |  pic.twitter.com/1MHuGwVm0p |  pic.twitter.com/Opm4xpdOFy |  pic.twitter.com/fve8jhqWjj |  pic.twitter.com/bFOfJz8uGL | Seems like you are not aware of NY Dem politics and how it's deliberately meant to suppress the vote and discourage turnout, in favor incumbents. But now that the New majority Dem State House's making it easy to vote, yeah let's see who the 87% will vote for in 2020? Bet. | Yes, her voters. |  pic.twitter.com/uEQwesPD10", "I didn't.  What the hell are you talking about |  pic.twitter.com/KtheGgIhHX | No, that's what you JUST SAID.  'Diverse group' | She is such a joke. | Making me laugh ... stuff like that is so funny!  She's so fake!   | Cool cat! | ♫ We're only just the cheap seaterssss ♫ | No, the dems in VA have all the sheets, and the black face   | IKR, 'boxed soup' ... you made me laugh    love your comment! | I know, gag   | Yes! | Racist | She should 'reshape' her brain. | Let's dig into this and get to the bottom of it. | Yes. | What did she have to be so hurt about? | Wasn't asking you, dum dum   | Scary pic   | God, that scary face .... | 'Scary' .....  lol | Threw away 25,000 jobs and all the tax revenues, dishonest funneling of $$, new green ripoff ... the BIGG boss strutting and hamming it up to the suckers in the cheap seats  :D | Yes!   | You will never 'squash' the truth.  We can be stung, but we can sting back. | Number 5   | No way.  We laugh at her   | She's 'in charge', we're 'in the cheap seats' | Lol | Need an independent investigation. | Oh, WOW.  Sooo funny   | We will, from the cheap seats   | Lol, good one!   | You got that right | “Pompous little twit,” “You don’t have a plan to grow food for 8 billion people without fossil fuels, or get food into the cities. Horses? If fossil fuels were banned every tree in the world would be cut down for fuel for cooking and heating. You would bring about mass death.” | I call them 'AntifaCrat' to their 'racist' | CNN and etc  =  BuzzFeeders | She is corrupting the young with her evil lies. | Yes, she is   | She is an egotistical fool. |  pic.twitter.com/noSNCpbyvb | She's dishonest, phony | That's what I was thinking. | That's a bunch of crap.  Your MSM are the Ministry of Propaganda. | Yes, and I've been paying mine off for years, but the freeloader deadbeats want to be let off the hook. | OMG.  Give this tool the Academy Award   pic.twitter.com/W0OaNKJPeC | LAUGHING ! |   he heh | Ugly, outside and in.   | Scary mouth | That's disgusting   | This is the sad truth. | Lol ! | Oh, THAT was a good one !!  Best name for it yet.   | This is so funny, so true!  :D | Ha ... remember that song:  ♫ I'd rather rip my heart right out of my ribcage with my bare hands and throw it on the floor and stomp on it till I die ♫  Al Yankovitch | Sure thing my friend  :) | Terrifying ...  lol | YES | Lol | NO | So do I   | No, you | Not scared.  Snickering   | No, you are |  pic.twitter.com/pLT1L9MwlS | Eileen, the investigations are starting into the dems' involvement into the beginnings of this crime.  The republicans are not going to let it go, going back to Obama's DOJ, FBI, and HRC.  Their time is coming  :) | Lol ! |  pic.twitter.com/SHFgYLd573 | Yes, that hand-waving and grandstanding was a riot. |  pic.twitter.com/5UZN0IVJMB | No big loss, hmmm?   ;) | Laughing! | Pretty sick, hmmmm? | I agree.  Dishonest bullies. | You're right. | IKR, Lol  :D | Yes! | No, he is right | She's drunk, I think ... | YOU are the bigot, the race-baiter, the hater. | Thank you!  The muslim extremists beheading Christians, burning people alive in cages!  She just hopes to stir up hate towards whites, she's despicable. | Lol  ! | And the Beatles are responsible for inspiring Manson's killings | Omg ...... | Egomaniac | Queen ... lol | Aaackk ...  | Racist | Yeah, right    | Yeah, 'The Queen'   | You're right   | I know, they are so stupid  :D | \"You cheap seat fools!\"  lol | Yes, what a nightmare   | I am, too. | Awesome comment. | You are right, Lilly.  We've heard this crap before.  I will never believe it!  It's an attempt at a big government power grab by the libs. | You nailed it  :) | I agree with you, Paula | She's ignorant as hell. |  pic.twitter.com/TtXm4bftmW | Yes! | LOL !!  Best comment yet  :D | Lol | Made me laugh  :D | That is well said !! | No one is afraid of that idiot, we can't believe out luck in having her blabbing stupidity all the time  :D | Back to the cheap seats   | ... And she's draggin the tin cup back and forth across the cell bars, \"Kill Whitey\" like in that Leslie Nielson movie, Naked Gun ...   | Ha.  You don't even know what you're talking about   q | Or else, it's \"The List\" for YOU !!  Lol | It was awesome!   | OK | Yes!  Put them all on ... \"The LIST\"  !!   | No one is scared of that...... or bitches about it.  We have a good laugh  ", "If you have not seen the video of how Alexandria Cortez is a fake Representative then you’re missing out.\n\nAlong with others who are directed by the @justicedems, Cortez spews socialist nonsense meant to destroy the Democrats.\n\nWatch, enjoy and share: https://twitter.com/bubblebathgirl/status/1105551916564664321?s=21 … | Now just because I call her \"poor\" that doesn't mean she actually is.\n\nRemember she's now earning almost $200K a year.\n\nShe also lives in a fancy apartment, better than most Americans, while being chauffeured around by gas guzzlers wherever she wants to go.\n\nOh, and we're paying! | Your story is a lie Cortez. | Let's NOT do socialism.\n\nPoor Alexandria Cortez still thinks that it can work even though it's always failed.\n\nWhy does she still push such nonsensical ideas?\n\nBecause her controllers tell her what to say, that's why.\n\nThe poor thing doesn't look healthy either. Too much stress. | Alexandria Cortez, you blamed the pathetic rollout of your #GreenNewDeal on your staff.\n\nThis was truly a pathetic display by you: https://twitter.com/Julio_Rosas11/status/1111789908094578688 … | FEC violations incorporates?  | What’s wrong with you?\n\nThe loon read words, that someone else wrote for her, off of a piece of paper.\n\nWhenever she speaks on the spot she shows her lack of intelligence.\n\nShe also always lies. | AOC is racist.\n\nShe’s also clueless.\n\nThey’re both bad. | Of course. Most people in politics are.\n\nBut she’s really just vapid.\n\nWe can all watch her plethora of gaffes when she’s been put on the spot.\n\nShe has no real idea what she’s taking about.\n\nShe’s just playing her part for the @TheYoungTurks. | You’re joking right AOC?\n\nPreparedness?\n\nYes you took the words that were written for you and you read them.\n\nWe’re so impressed  | Better yet, maybe Cortez should just enjoy her $200K/year salary, her luxury apartment, her airplane flights, her SUV rides, her hamburgers, and all of the other ways she pollutes the planet, on our dime, because the world will end in 12 years according to her. | Sounds like Cortez should probably figure out how she’s going to evade her $1M FEC violation.\n\nMaybe Cortez’s handlers at @justicedems will give her another script to act out to explain why she laundered money to her boyfriend @rileylroberts.\n\n@saikatc, Cortez needs her lines! pic.twitter.com/iIdmGMSJqH | That said, Cortez is doing a great job destroying the Democratic Party from the inside out with her socialist nonsense.\n\nShe also got ZERO VOTES for her #GreenNewDeal debacle.\n\nAnd she proved she knows zero about finance, healthcare and science.\n\nMaybe try bartending Cortez?  | AOC continually embarrasses herself by reciting rhetoric that is provenly false.\n\nShe also constantly contradicts herself as she speaks.\n\nIt’s hilarious to watch.\n\nThe Dems are doomed. | She really is. Kinda like ... pic.twitter.com/37f2glmyXP | It makes perfect sense really. That’s why she fumbles all over herself when she’s forced to improvise.\n\nBest part is, all the evidence is publicly available. | That’s because she’s a paid actress.\n\nDid you read the thread of mine I linked or did you you know all that stuff I wrote already? | BINGO!\n\nShe’s completely wrecked by all of this and has ZERO explanation for it.\n\nShe actually won a contest to get nominated  \n\nShe never knows what she’s talking about unless it’s scripted. Thus her constant gaffes when thinking for herself.\n\nEnjoy the show! | Cortez finally admitted that her GND flopped.\n\nOf course she blamed everyone but herself for the failure.\n\nTypical far left loon. | Cortez, why did you cost NYC 25K jobs?\n\nCortez, why did you back policies that put your last employer out of business?\n\nCortez, why do you destroy the environment with your own choices?\n\nCortez, why do you live like a rich girl but say everyone else should give away their money? | Cortez, why won’t you show us what your credit score is?\n\nCortez, why are you under investigation for FEC violations?\n\nCortez, why do you take your marching orders from the Justice Dems?\n\nCortez, why did you launder money to your boyfriend? | Cortez, why did you lie about where you grew up in order to get elected?\n\nCortez, why do you think socialism can work when it has always failed?\n\nCortez, why do you want to destroy our booming economy and the lives of all Americans except you?", "She is too stupid and dangerous to put the needs of the people above her own political agenda- did you not see what she did to her own state?! | Not a bot! Just an American with a vote! | You mean misinformed. She is a mouthpiece for Chakrabarti!!! Get a clue! | Now they have nothing. | AOC is a joke!! She has proven that she is a wreckless activist that causes financial harm to her community! The founder of GreenPeace called her a pompous twit who has no idea what she is talking about! | She is a total train wreck. Her destruction is unprecedented! She has cost her state more jobs and more opportunity than any Congress member in history! That’s why they are talking about her!? Trump will win landslide if she keeps it up! Republicans love AOC! | Lol! Give her cookies and crayons! | Really? The founder of GreenPeace called her a pompous twit who has NO idea what she is doing! | She has already managed to have a detrimental impact on her community. GreenPeace, along with the unions and 31,000 scientists disagree with her proposals. I have yet to hear her speak in any real terms. She spouts ridiculous poetry. | You should worry about your own campaign finance violations!! Chakrabarti, too! | AOC was just hit w a complaint from the FEC for funneling money through her Political Action Committee which then illegally paid her boyfriend!  | AOC was removed as a governing member of the PAC Justice Democrats! Why?! Because she and Chakrabarti broke the law and had legal control over the PAC while it supported her campaign! OMG- talk about dark money! Jail house for these two!! | Yes! | GreenPeace founder just called her a “pompous twit” who has NO idea what she is doubg!  | What about reparations to all the Chinese and Japanese slaves from Hawaii that worked on the plantations until the early 1900s? What about the white slaves? | I wonder how AOC would hold up debating Tucker Carlson or Ben Shapiro?  | AOC is a detriment to all people. So far, she has accomplished nothing constructive. She cost her state 25,000 jobs. Her GND has split the Democrat party. Now, under investigation by the FEC | Maybe she will learn how to use the term “Freudian” -just another example of her blatant ignorance. | MLK was a staunch Republican and would cite you as an example of “conscientious stupidity” and “sincere ignorance”. | 31,000 climate scientists, including the founder of the Weather Channel disagree with AOC’s ideas. | So, you think the GND actually solves any of the world’s problems? The co-founder of GreenPeace said AOC’s ideas are foolish and dangerous because her plan does not even address the logistics of how food will be grown and made avail to the population -resulting in mass starvation | Why go on late night when you could debate Shapiro? Tucker Carlson? GreenPeace? The founder of the Weather Channel or any of the 31,000 scientists that disagree w the GND??? | She lost, 57-0! OMG, that’s demonststrates the incredible STUPIDITY that is the GND. | I just read the FEC complaint against her for laundering money through her campaign to her boyfriend  | Fear AOC and her ignorance! I just read the report-I don’t think SHE read the darn thing! | Omar’s exposure to war only proves that she has become a hate-filled anti-Semitic woman w a vendetta. Get her out of my Congress! | She doesn’t question policy! She peddles hate! | Yes! | That’s true, actually. | OMG! What a hypocrite! You put a ceiling of 80k on your Chief of Staff! Chakrabarti is LIMITED to 80k because it serves to protect him from the transparency laws!!! You are full of crap!! | Yet, you constantly do it to groups that do not agree with you. You friend, Omar, just referred to someone she did not like as “not a human”. Where is your outrage?! Oh, there is none-because u agree with dehumanizing some people. | AOC should worry about the FEC complaint against her PAC and her payments to her boyfriend.", "Again, how do we pay for it, deflection, no solution, just scare tactic politics. Come with a plan, actually submit a full bill! Which means how it will be funded! No one in your party voted for it. A sound bite from you changes nothing! pic.twitter.com/Yrk6fbrQIC | Her bill is a joke. She never has any idea how she is going to pay for any of her ideas and never tries to answer the question! Her own party has made fun of her bill. Seriously, the sponsor wouldn’t vote yes for it! They voted present so they weren’t on the record for election. | Every incident? This is the third incident since she has been in the House, the first time she apologized and then took it back the next day! Not only has she been anti-Semitic, she has openly admitted she is pro-Palestine, our allies enemy in the region, a pro terrorist country. pic.twitter.com/pcx0bq8TnP | Overall all ratings?  most of us follow you for comic relief! You keep a smile on our face because we can count on a gaffe a day at least!  #narcissist | Implementing, as you fly everywhere instead of take a train, drive gas guzzling SUVs instead of electric cars and don’t have the time to recycle! Why is it politicians always tell us what to do but never take their own advice? More #LiberalHypocrisy! pic.twitter.com/ati3cuSqPx | She spews hate and gets hate back and can’t figure out why? Quit trying to protecting terrorist, quit spewing anti-Semitic remarks, don’t choose to support a dictator in Venezuela that acts like the one you escaped from in Somalia or a girl that made isis recruiting videos! pic.twitter.com/jBLtZeasC0 | Bad faith? Maybe do some research instead of listening to the fake MSM or people that have an agenda to promote it! https://www.nationalgeographic.com/environment/2019/03/one-part-of-greenland-ice-growing/ … | Just in case you missed it, not one yes vote! Aren’t there some Democrats in the Senate? Not even the Bill’s sponsors voted Yes! It’s because it’s ill conceived bill, no funding, no plan! Just your standard answer, “You justbpay for it”! https://twitter.com/senatemajldr/status/1110675494909956096?s=21 … | Why sponsor a bill, cry that they won’t bring it up for a vote and then once they do bring it up for a vote tell everyone to vote present? Deflection from the fact most if not all the Dems did not want to go on record supporting the bill! No way to pay for it! pic.twitter.com/CYNLHTnL5B | Here’s the best clip of the day! https://twitter.com/timrunshismouth/status/1110652393488826375?s=21 …", "So what would you like to dispute or debate? pic.twitter.com/ittCyDSpml | These are people who operate in light shadows, it's very easy to find out a great deal even via public records. Did you know Saikat bought a $1.6M house in DC area in June 2018, and put a deposit in roughly feb/march? | We, the people, are the investigation. It's important to remember that. We can't wait around for someone else to look into it. I implore you to help. We must organize like they have in a peaceful manner that exposes them based on fact and findings. | *based on a guess | Go further. You gave me a \"probably\" scenario based on fact. Keep going. | Wasn't he just elected a few months ago? That would make his next election when?  21 months? You didn't start bringing in money until a few months before primary so why begging for money already for your Commrades? | Can't imagine how you accomplished that! pic.twitter.com/mtZZ6A1i5i | He was involved with fundraising how exactly?  If he goes down you by necessity would go down given your involvement with Justice Democrats... so... \n\nAlso, don't act like you didn't take foreign money too. I'll disclose shortly. \n\n@ltthompso @jtLOL @AndrewKerrNC  @alanagoodman | Can't allowed to be governed by fear.\n\nAlso #AOC: the world is going to end in 10 years. People shouldn't have babies. Don't eat hamburgers whenever you'd like/chose. ICE is gonna get you. | \"By our party\" \n\n??????????????????????????????????????????????????????????\n\nYOU AREN'T PART OF THE DEMOCRATIC PARTY \n\nBNC / JD ran with party affiliation only to win the primaries. You know this because you literally talked about it on the orientation.\n\nYOU'VE GOT TO STOP | Get your stopwatch ready, I'm gonna start a campaign with them. Let's see how quick they cut me off. | You fight this bc Exley prob just pulled the alarm. Your entire Cult is not Rep or Dem yet you run in both for the party affiliation.  This is documented FACT from your own people on many videos which have all been backed up. From Corbin, from Saikat, from #ExleyRuler etc | Wait, where is your line of questioning? Oh yea, you questioned the guy on your side. #cakewalk | Also, it's not a hidden gem if people watched their Congress in action. But they don't. Instead they watch Twitter feeds. And you and Pressley want 16 year olds voting. Wonder why... |  https://twitter.com/DickJackman1/status/1105795843007963143?s=19 … | Leaks ranging from 20 gallons to 168 gallons.  Not saying that is good, but stuff happens. Get over yourself before they reduce or eliminate their goal of $100B (Billion) in Clean Energy by 2030 goal. \n\nAnd stop saying etc all the time. It's an obvious clue you ran out of script. | Come on over Alexandria. More than enough info to share. pic.twitter.com/6K20Jk9UNs | This is about Marine Life safety... what does it have to do with Climate outside of its relation to searching for oil? | Who loves themself more?"], ["Climate propaganda \n\nStop lying to these kids | Your projections are a farce. \n\nAlways have been.", "Karma!", "Can you please speak English? | I'm not sure,  because that would have to be a dumb mother fucker", "But he still challeneged an incumbent right?", "Looks great when my dog shits on it!", "YOU ARE A BABBLING IDIOT AND A COMMUNIST WE WILL VOTE YOU OUT AND BRING YOU TO JUSTICE FOR FEC VIOLATIONS.", "I agree.. she is a clueless mole, and her 15 minutes is about up", "Tank and the bangaz are slept on. Props aoc", "Ew, why are they so gross?", "All 3,\nBut mostly 3)"], ["Stopped donating to @dccc and @DNC bc of their egregious practices before the last election. In fact I’m no longer a registered democrat bc of how they handled the last election. No that doesn’t mean I vote republican or for the  crazy  in our WH. Vote for the individual!", "Democrats too AOC. Establishment Dems like Nancy Pelosi use POC as puppets to win elections.", "That's EXACTLY what they're doing. Just like the party bosses will do anything necessary to thwart Bernie's rise to Dem primary | I believe to run in the Dem primary, you are a registered Dem.", "There is no climate change! All BS created by democrats to fund their own pockets! Only climate change you want is socialism, that is NOT going to happen! The democrats use DES to manipulate weather creating hurricanes and fires to make the ppl think there is a problem! All Lies", "She may not be rich yet, but boy she's getting there really really fast.  Learned the Democrats' method of getting rich thru corruption the second she got into office!  The only difference between her and old school dems is she's TOO STUPID to hide it well. | Yep..lots of them on here.", "As a baby boomer and protester on the 60's, it does my heart good to have all the young representation in our Democratic party turning to the liberal side of the party and getting away from the corporate owned side.", "What @SpeakerPelosi doesn’t understand is progressives won’t vote for an establishment dem candidate even against trump if they keep operating like this. We refuse to be taken hostage by dem establishment and will prefer to stay at home till dems hear us.", "They willingly call themselves deplorable. | But the people it is working for want the rest of us to know that everything is just fine. | Has anyone ever tried to give you a free house? Do you know anyone who was given a free house? | No one gave me a free house. How did I miss out? | But who got the free houses? You said they were giving houses to everyone. I had to pay for mine.", "The Democratic Party as it appears hasn’t learned the lessons of 2016. If they continue on this path history has shown that it can be repeated. But I’m very optimistic that the progressive base will not relent not backdown from spoiling there plans. We will triumph.", "Out of site, out of mind.  Why do you think people start fundraisers and raise awareness of illness or disease?  Because they are directly affected by it in a very clear, in your face way.  You will never get the general pop to care about something as indirect as climate change | I voted for Bernie in the primary, when he lost due to your parties corruption I left the US and now live overseas.  The mess is on both sides of the isle so stay humble and work for the side of good/happy and not republican or democrat.  Stay Golden AOC | Maybe, maybe not.  Why do you care?  Hateful sad man"], ["We will make them understand. Never stop fighting. Corrupted Republicans? Corrupted Democrats? Doesn't matter. Fight for the people AOC. You're an inspiration around thr globe. Love from a Canadian. #NeverStopFighting #PolicyOverPolitics #PeopleOverProfits", "No not fraud. Minnesotans would elect a Stray cat running as a democrat over any republican. Especially in that district. They are jaded by all the free stuff they are “entitled” to", "They were rejected by their low test scores, that is it. @AOC is pandering for the Black vote, this is a #FakeNews post.\n\n\"Admission to Stuyvesant is based solely on a candidates scores on an entrance exam; race and ethnicity are not considered. \" http://blackyouthproject.com/why-are-there-so-few-black-students-at-nycs-specialized-high-schools/ …", "They know it's nonsense.  I'm trying to tell you, that you don't belong there.  You simply are not qualified to be in Congress.  You are fast becoming the joke of the Democratic party.  Please.  Just go back to serving drinks.", "Fine but those words weren’t written by AOC.  Justice Democrats all the way", "AOC, Do not speak at Liberty University. That so-called school has no more credibility than Trump University. | AOC, ignore Falwell. His comments and thought have no more relevance than the flatulence of his 100 cows. | Liberty University is \na Trump University.\nIt has no credibility.\nIgnore it.", "You have a point there. I'd like to keep that 'ol \"big tent.\" There's more NUMBERS in there to defeat Trump. Just \"leftists\" aren't enough. Suburban housewives, who were on our side in the last election, aren't all \"leftists.\"", "I bet she taught her students FDR was dead before the Constitutional Amendment limiting Presidential term limits was passed by Democrat majority votes.", "So why did Obama and the democrats build all of that wall a few years ago? Clinton’s even pushed for it to back in the day. | You getting rid of 25,000 good jobs kinda sound like ruling, not serving. Self serving is the phrase I think you were looking for.", "Good for you. I commented regarding your scholarship. \nClearly, these young people understand the value of life-long learning. \nThe Republican party can never be accused of such an unorthodox attribute."], ["LBJ also would have had us out of Vietnam before he left office, but for Nixon’s effort to delay signing the treaty so he could get credit for it. Not saying LBJ was a saint, but Nixon was dirty from day 1. | Which sorta starts to look like an institutional problem with the GOP....", "Libraries are also frequented by the homeless. Why is not one Democrat addressing the concerns of the homeless?", "AOC is like a great reality show contestant!   Already  50% more followers than Pelosi who is #2 democrat on social media.    Not alot of smarts but boy does she have the followers! | guarantee that AOC doesn't write even 1 of 10 \"her\" tweets.  This is strictly a millionaire techie's social justice warrior tweets (Saikat Chakrabarti) -- she wasn't even in office before she started running a $1 million slush fund w/ Saikat --- | Millionaires running 'grassroots' isn't exactly 'grassroots'!  These millionaires recrutied aoc to run ... not b/c of ideas but b/c she fit a look --- just like reality show producing.", "Welcome to the New Right party, we know the leftist dirty trick and will use all of them to expose shitty communist ideals, our conservative brethern are hampered by the high road  approach but we say fuck all leftist.", "FoxNews-Hufsa Kamal and Rep. Omar are grooming American girls to be  Sharia Compliant by observance of Sharia Law via Hijab, rather than by  condemnation of Sharia Law which is morally repugnant under the U.S.  Constitution.", "Eliminating. | Yes, if you would like the initial proposal which was taken down within minutes, I can send to you. | Yes it does. The original one that they took down does state this. | It is so illogical, there is no point. | They are! #msm does not report on it, it is buried, hushed. #woke #WalkAway", "Driving is a privilege while voting is a right. And the people just voted to give these people the right to vote last election cycle", "The Candidate, actress. The congressmn, pupet.", "Smell like Nazi traitors | AOC only cares about money and power just like all Socialist she only cares how much money she can still from us #fucksocialism\n#socialismisslavery | Yeah that what the demnazi do decide us so they can conquer us and at the head is Bernie Hitler, Alexandria Ocaiso Hitler, Nancy Pelosi, and Omar", "David Duke praises anti-Semitic terror sympathizer Rep. Ilhan Omar, calling her “the most Important Member of the US Congress!”  ⁦@SpeakerPelosi⁩, ⁦@WhipClyburn⁩, and the rest of Dem leadership remain silent.   https://www.washingtontimes.com/news/2019/mar/7/david-duke-praises-rep-ilhan-omar/ … …"], ["It means not invading an entire nation without end. Doesn’t mean “do nothing,” it means perhaps we could have leaned more on the larger role of other agencies (intelligence, state dept, diplomatic teams, etc) before Congress decided to invade a nation without a concrete end plan. | Solidarity > “civility,” bc you can very civil while arguing for the inhumane + unacceptable. You can be “civil” while locking up kids & drugging them in detention camps, or stripping people of their insulin or civil rights.\n\nCivility is abt appearance. Solidarity is abt action. | (But honestly we shouldn’t have been in either, and we should end the AUMF now while we’re at it) | Thanks for clarifying the source tweet. \n\nTreatment is still completely different. | My deepest condolences, Soledad. Thank you for sharing her important story with us. | The Bishop’s tweet is corrected for context here. Still wondering what the standards are for what merits a resolution and what doesn’t.   https://twitter.com/parkermolloy/status/1102991021762404354?s=21 … | (As always, shout out to CA’s Rep @RoKhanna for being so on point.) | This is progress, and there is still work to do.\n\nThere should not be a for-profit industry behind the detention and incarceration of human beings.\n\nThe US locks up more people than anywhere else in the world, incl China. For-profit caging shouldn’t be legal in the first place. | When your bodega cat is also a bachata cat: https://twitter.com/bodegacats_/status/1086048362137354241?s=21 … | I think that our decision to enter unlimited engagement in Afghanistan, particularly through the AUMF + Congress’ abdication of power + decision-making w/ passage of the AUMF, was a mistake.\n\nOther options: targeting the network itself, limited engagement, non-intervention. |  https://www.marketwatch.com/story/tucker-carlson-offers-no-apology-for-saying-naughty-things-in-a-radio-interview-2019-03-11 … | This is a time of great vulnerability for our communities.\n\nWe must come together, fight for each other, & stand up for neighbors.\n\nIsolation, dehumanizing stereotypes, hysterical conspiracy theories, & hatred ultimately lead to the anarchy of violence.\n\nWe cannot stand for it. | Afghanistan War* my apologies | .@MikeLevinCA: A swing-seater who‘s a principled, tough advocate on climate change. He consistently speaks about the issues facing his community, and had a genuine passion for service that’s clear to anyone who meets him:\n\nGive here: https://secure.actblue.com/contribute/page/mikelevin … | (To also be fair, sometimes committee hearings overlap and you have to choose which one you’re going to. Happened to me earlier today - had to leave this hearing earlier so I could ask questions on Oversight about the opioid crisis) | The reason people know more is bc Fox News has turned into “AOC TMZ” (no offense to TMZ), so awareness is growing w/ GOPers.\n\n@JaneMayerNYer has reported deeply on this propaganda machine + it will be aimed at any Dem they want. Nothing changes that.\n\nWe can’t be scared by that. | !!! | We can have ideological differences and that’s fine. But these tactics allow a small group to force the other 200+ members into actions that the majority disagree with. I don’t think that’s right, and said as much in a closed door meeting. | “At [DHS immigrant detention] facility, children recounted being held down for forcible injections, which medical records show are powerful antipsychotics and sedatives.” \n\n https://www-m.cnn.com/2018/06/21/us/undocumented-migrant-children-detention-facilities-abuse-invs/index.html?r=https%3A%2F%2Fwww.google.com%2F … | What I DID say was that I had to go back to my district & share the MTR vote to explain why a pro-ICE amendment was slipped into a gun safety law.\n\nMaybe they’re mad bc I don’t believe pro-ICE expansion votes should be cast in the dark, and people deserve to know what happened. | #MomsDemand & #MarchForOurLives activists, who flew in from across the country, were watching from the gallery, crying + confused.\n\nI ran up to them *during the vote* and explained that the gotcha amendment pinned gun safety against immigration advocacy. Its intent was to divide. | If you’re mad that I think people SHOULD KNOW when Dems vote to expand ICE powers, then be mad.\n\nICE is a dangerous agency with 0 accountability, widespread reporting of rape, abuse of power, + children dying in DHS custody.\n\nHaving a D next to your name doesn’t make that right. | .@katieporteroc is a Financial Services hearings badass (look up her questioning) and her story as a survivor is a story of resilience.\n\nShe speaks truth to power on special interests and predatory banks.\n\nDonate to her campaign here: https://katieporter.com  | @LaurenUnderwood: A nurse by training and one of the straightest shooters in the freshman class. I love her frank, up-front, style about what’s important to her community and the country.\n\nShe’s a phenomenal, compassionate public servant.\n\nGive here: https://act.myngp.com/Forms/1159474659983231744 … | And don’t even get me started on misogyny. \n\nIf we called resolutions on sexist statements, a good chunk of Congress would be gone.\n\nTo jump to the nuclear option every time leaves no room for corrective action.\n\nSo I ask *everyone* that we practice calling in before calling out. | PS I am extraordinarily proud of the role my constituents have played in helping to establish + support Troop 6000, the first-ever @girlscouts troop for girls experiencing homelessness: https://www.npr.org/2017/07/26/538551816/a-nyc-scout-troop-provides-homeless-girls-a-place-of-their-own … | The majority of Americans live in safe districts, where gen election isn’t competitive.\n\nBy stymieing primaries, you deny most voters their best chance at choosing their representative. We also deny the party the opportunity of training up a future bench, something we badly need. | The  in the room here is big money & lobbyist donors.\n\nOur current system incentivizes *all,* no matter the party, to place big donors before voters.\n\nNo primaries means lobbyistwill have even *more* influence over policy, bc voters will have one less avenue to pursue change. | Folks often try to make this convo abt members from mod, swing districts.\n\nWe get that those members do what they need to rep.\n\nBut many members of Congress got there via safe primaries. It’s how many working people, women, + poc folks overcome institutional bias to get elected. | If House leadership is creating a standard & committing to calling a resolution for every incident - whether it’s the Congressional Black Caucus, CHC, etc, then thats a clear way to address the issue & we can all understand.\n\nBut if they’re not, I think it’s valid to ask why not. | It’s not zero-sum + we have a serious responsibility to listen to communities when they feel pain.\n\nWhere I struggle is how we deal with that pain: the “how” after the “what.”\n\nI also fear brooding resentment,bc PoC are *always* promised that ppl will “work harder”w/o commitment. | This is different than being moderate on policy. I may disagree w/ approach (keeping the ACA as-is w/small tweaks, etc), but at least that’s a policy convo.\n\nBut to make decisions based on the political efficacy of a bigoted argument gives that bigotry power, & that’s a problem. | We can’t gloss over it, or quietly consider that the “shrewd” thing to do is nominate someone who won’t be subject to bigoted attacks.\n\nMorally, we can’t give a pass to this dangerous tactic.\n\nBut even politically, the Dem base is all the people you demoralize by not standing up. | - HIV/AIDS crisis and demonization of LGBT+ community\n- Union-busting\n- Ending the Fairness Doctrine, which launched the polarized media environment we’re suffering from today\n\nWhy are we not supposed to talk about these things? | This is the one we’re inquiring about! | (“Thoughts and prayers” is reference to the NRA’s phrase used to deflect conversation away from policy change during tragedies. Not directed to PM Ardern, who I greatly admire.) | ”...but who does actually strive to do the deeds; who knows great enthusiasms, the great devotions; who spends himself in a worthy cause;who at the best knows in the end the triumph of high achievement, and who at the worst, if he fails, at least fails while daring greatly...” /3 | Congress’ insider trading problems used to be worse - and the good news is that some laws have been passed to tighten things up a bit.\n\nBut there’s still a lot of work to do:  https://www.bloomberg.com/amp/opinion/articles/2018-08-10/congress-s-guide-to-insider-trading-and-corruption … | The entire PREMISE of a wall is not based in fact.\n\nIt’s based in a racist + non-evidence based trope that immigrants are dangerous.\n\nYet some Dems are willing to “compromise” & spend BILLIONS on a trope because we’ve accepted some kinds of racism as realpolitik in America. | Same w/ member pay.\n\nMembers are paid more than avg - but job reqs 2 residences + we can’t take tax deductions for work costs.\n\nNo one wants to be the one to bring up increases, so instead ppl take advantage of insider trading loopholes & don’t close them for the extra cash.  | And before conservatives start whining that I refer to tax cuts (aka revenue cuts) as costs, here’s a reminder that the world recognizes that they are costs too: pic.twitter.com/5xxLNBFXhy | WE ALL can play a role in recognizing + preventing spread of white supremacy, especially our white friends.\n\nThere are lots of community orgs, writers + groups that help people learn to spot white supremacy.\n\n@SURJNYC is one in NYC, but please share others: http://www.showingupforracialjustice.org/white-supremacy-culture.html … | If we truly want to address the problem of white supremacist violence, we have to learn how to recognize it + how it shows up in our culture.\n\nSurprisingly to some, signs of white supremacist culture are NOT easy to spot early for those aren’t aware.\n\nBecause it’s everywhere. | (& no to the trolls, not suggesting that this ex. be met with leg - though the quoted tweet certainly could be. What ex. shows is we ALL should ask questions about accessibility in our everyday lives, of ourselves + others. That’s how we figure out solutions, leg or otherwise.) | I respectfully disagree. The disproportionate treatment is what is exacerbating the situation.\n\nI think this moment is a good opportunity for an intersectional approach. | It’s not my position to tell people how to feel, or that their hurt is invalid.\n\nBut incidents like these do beg the question: where are the resolutions against homophobic statements? For anti-blackness? For xenophobia? For a member saying he’ll “send Obama home to Kenya?” | None of this is “whataboutism.” Racism and bigotry of all forms is inextricably linked.\n\nWhen you don’t address them as a system and attempt to pick them apart as though they are distinct and separable issues, eventually the thing that gets advanced is white supremacy + classism. | In this administration + all others, we should actively check antisemitism, anti-blackness, homophobia, racism, and all other forms of bigotry.\n\nAnd the most productive end goal when we see it is to educate and heal.\n\nIt’s the difference btwn “calling in” before “calling out.” | Next, let’s send some coin to @KatieHill4CA!\n\nRep. Hill is a strong, principled fighter on getting money out of politics. Her fortitude is one part of what makes her a great Vice Chair on Oversight.\n\nShe’s also kept her word on M4A. Let’s have her back: https://secure.actblue.com/donate/bolddemocrats?refcode=tw_20190331 … | White supremacists, like many extremists, get radicalized online. There is a well-documented digital rabbithole that young men fall into: they often go in frustrated young people & come out w/a formed hateful ideology.\n\nThat’s the way radicalization works. https://www.nytimes.com/2018/11/24/opinion/sunday/facebook-twitter-terrorism-extremism.html … | “...could have done them better. The credit belongs to the man who is actually in the arena, whose face is marred by dust and sweat and blood; who strives valiantly; who errs, who comes short again and again, because there is no effort without error and shortcoming...” /2 | This is why we advocate for:\n- Medicare for All\n- Tuition-free public college\n- Investing in dignified jobs that build our nation + get us to 100% renewables before it’s too late.\n\nThese are investments in people, not profits. Corps aren’t incentivized to ensure people’s health. | I didn’t say that they were putting themselves on a list for primaries.\n\nI said that by Dems distinguishing themselves by breaking off on procedural MTR votes, they were inadvertently making a list of targets for the GOP and for progressive advocates on their pro-ICE vote. | “Calling out” is one of the measures of last resort, not 1st or 2nd resort.\n\nWe do it when repeated attempts to “call in” are disrespected or ignored. And I believe that Ilhan, in her statement a few weeks ago, has demonstrated a willingness to listen+work w/impacted communities. | I often think about how I work with white or male allies when they say something insensitive.\n\nThe 1st thing I do is pull them aside + say “hey, you may not be aware of X thing regarding Latinx people, but here is the history and it’s hurtful. If you want to learn more, read Y.” | I remember a time when it was “unacceptable” to question the Iraq War. \n\nAll of Congress was wrong, including both GOP & Dem Party, and led my generation into a disastrous + wrong war that virtually all would come to regret, except for the one member who stood up: Barbara Lee. | No problem! Thanks for taking my replies into consideration. There’s a ton of press inquiry volume so we can’t always get to everything, but we try as much as we can! | Or now, even with a disastrous choice like Elliot Abrams at the helm (a man guilty of crimes related to Iran-contra, including misleading Congress) - it still seems like critiquing US interventionism is taboo.\n\nHistory shows that making some questions “unacceptable” is a mistake. | In order for us to heal as a nation, we ALL must pursue the hard work of addressing these root causes.\n\nIt’s not as easy as voting. It means having uncomfortable moments convos w/ loved ones, w/ media, w/ those we disagree, and yes - within our own party, too.\n\nIt’s on all of us. | The cases we can help with the most are cases regarding federal agencies and programs: immigration visas, social security, military service members, EPA, Post Office, etc. | It’s not all about elections, though much of it can be. It’s also about slowly creeping member positions to be more conservative, tradeoff communities of color, or weaken important legislation - no matter your party. | He can stay, he can go. He can be impeached, or voted out in 2020.\n\nBut removing Trump will not remove the infrastructure of an entire party that embraced him; the dark money that funded him; the online radicalization that drummed his army; nor the racism he amplified+reanimated. | Word. But someone’s got to care about growing the Dem base: the thing ppl don’t realize is that the House is where you can build turnout infrastructure to win Presidentials. When we don’t invest in blue-seat organizing in the House, we don’t get the turnout we need every 4 years. | 3rd for today on the tandem is @MikeLevinCA.\n\nI sang his praises yesterday, but his gutsy stance against fossil fuel lobbyists and bold work on climate change is seriously worth our support.\n\nLet’s go in: https://secure.actblue.com/donate/bolddemocrats?refcode=tw_20190331 … | To learn more about this topic, I recommend reading MLK’s “Why We Can’t Wait” or his essay: The case against tokenism, by Martin Luther King Jr: https://www.nytimes.com/1962/08/05/archives/the-case-against-tokenism-the-current-notion-that-token-integration.html … | And for those wondering, you can read a bit about our staff here: https://www.washingtonpost.com/us-policy/2019/02/14/heres-system-it-sucks-meet-hill-staffers-ocasio-cortez-has-tapped-upend-washington/?noredirect=on&utm_term=.a894057903d4 … | In my opinion, it’s all in the execution:\n\n- Why is the program being implemented (bc current lack of diversity looks bad, or bc you’re actively trying to cultivate talent?)\n- Does the program put people in positions of consequential decision-making power or are they just around? | - Does the program make selected individuals feel lucky just to be there?\n- What’s the curriculum?\n- Big one: Is the org actively learning + adapting their processes based on experiences w/ program members?\n-What is the org trying to learn and what internal weak spots does it ID? | ”...so that his place shall never be with those cold and timid souls who neither know victory nor defeat.\" /4\n\n- President Theodore Roosevelt, “Citizenship in a Republic,” 1910. | At first, learning about white supremacy can be confusing or challenging.\n\nThere’s a lot there, + it can be emotionally hard to realize one may have done or participated in something racist in the past (& still may slip up!).\n\nThat’s okay. The whole point is learning + improving. | There are plenty of means of targeting beyond campaigns. One is procedural targeting on the floor, AKA more tough MTRs like the one we were discussing in mtg. Or targeting by way of advocacy, AKA getting a ton of constituent lobby days, crushing your office with phone calls, etc. | Siri, show me the brand of ‘economic anxiety’ that mocks Americans of color as unintelligent + unskilled, while *also* mocking those same Americans for speaking more languages than you: pic.twitter.com/HXBC7Osexu | First up: @JahanaHayesCT.\n\nJahana Hayes is a fmr Nat’l Teacher of the Year and has been kicking butt in Congress.\n\nShe ran a tough, bold campaign and hasn’t shied away from championing children and families.\n\nLet’s go in and have her back: https://secure.actblue.com/donate/bolddemocrats?refcode=tw_20190331 … | Update 2: @USPS is on it! That was oddly riveting. We’re fixing mail! Solving problems! \n\nIf you‘re in the Bronx, you know how big a deal the mail issue is here. This is big stuff people!! | Update: Calling the @USPS to figure out why my Morris Park constituents are only getting mail once every 2-3 days!\n\nThis look like a systemic issue. We’re on the case y’all  https://www.dnainfo.com/new-york/20170425/mott-haven/south-bronx-postal-service-audit.amp … | Thank you for recommending it! Several others had been DMing me on IG about it, but I had lost the name of the app in the sea of messages. When you told me in person I was able to recall& download it.\n\nYou + those advocates are the main reason why I started captioning when I did! | (I do have a soft spot for humor activism. Marie Antoinette also showed up to Secretary Wilbur “Let Them Eat Bridge Loans” Ross’ hearing, as well): https://thehill.com/homenews/administration/434053-marie-antoinette-activist-attends-house-hearing-to-protest-trump … | By the way: Fox News likes to say my name (incorrectly) as “Cortez,” which I can only imagine is bc that sounds more ‘stereotypically’ Hispanic + probably incites more ‘anxiety’ for them.\n\nPro Tip:\nMy last name is not “Cortez,” just as theirs isn’t “Ingra” or “Carl” or “Hann.” | & 3:01:47 | (Rather same guy who operated at the org) | The difference here is that we *already know* abt climate change. \n\nWe know that more fossil fuels will harm us. Banks know. Fossil fuel cos know. Gov + politicians know.\n\nIt’s not an accident. It’s cause+effect. We knew DAPL would leak. And we know the next gen is in danger. | The key here is in the advance knowledge. When you *knowingly* do something that you know *in advance* will do harm, and do it anyway, you open yourself up.\n\nCompanies *know in advance* that climate change will get worse if we keep growing fossil fuel consumption and production. | Remember when all the left did was finger-wag & make cynical assumptions, instead of showing up despite an imperfect moment?\n\nWhen the main defense is rooted in telling others how to feel - especially when you’re not from that community - it’s not solid ground. I ask other Qs. | For the curious, in Latinx culture children take *both* their parents‘ names.\n\nIt’s not a “progressive, new thing.” It’s just how some names work. PR hyphenates, others mark differently. Your last name = the families that came together to make you.\n\nAOC is also fine though :) | My last name is Ocasio-Cortez. Full stop. That’s my name.\n\nNo, you can’t say “Cortez.” I’ve never used that in my life. “Cortez” is referring to someone else.\n\nEven if they‘re trying to be rude + wrong, my dad’s last name was Ocasio anyway.\n\n(His name was hyphenated too, though.) | Thanks for taking the time. I’m thankful we could share a compassionate and productive conversation that hopefully lays the groundwork for future dialogue. | Literally nowhere did I say that. If you’re not going to read and listen to what I’ve been saying all day, then misinterpret + jump to a wrong conclusion about it, then I don’t know what to tell you.\n\nYou’re not going to falsely pit me against her, or anyone else for that matter. | Source: https://www.reuters.com/article/us-jpmorgan-settlement/jpmorgan-agrees-13-billion-settlement-with-u-s-over-bad-mortgages-idUSBRE9AI0OA20131120 … | Sea walls will have to go up as seas rise. Wildfires to put out. Roads repaved. Nascent technology to explore. Electrical grids replaced.\n\nIt’s too late for us to not have to deal w/ the impact of climate change. At this point we shouldn’t be debating IF we do it, it’s how. | Everyone’s last names are hyphenated - so you children take the first names of each of their parents.\n\nex: my dad was Ocasio-ABC, my mom’s was Cortez-XYZ\n\nSo I am Ocasio-Cortez\n\n(When they married, my mom became Ocasio-Cortez too - wives keep father’s name + take husband’s too) | Follow tonight’s convo using the hashtag #AOCAllin - the best part of tonight is the panelists and experts we’ve gathered to discuss our possibilities.\n\n(Even a Republican came! ) | Your* | Yes, I dispute it. It’s tricky to nail down exactly what happened when reporting on closed-door meetings.\n\nI did say Dems voting to expand ICE powers were creating a list, but not for primaries. It’s the MTR vote list that GOP and immigration advocates alike can use to lobby."]]