{"origin":["1102925532604391425","","Alexandria Ocasio-Cortez","AOC",false,"One of the things that is hurtful about the extent to which reprimand is sought of Ilhan is that no one seeks this level of reprimand when members make statements about Latinx + other communities (during the shutdown, a GOP member yelled “Go back to Puerto Rico!” on the floor). https://twitter.com/peterdaou/status/1102901102297731072 …","peterdaou","The GOP under Trump has run roughshod over our norms and values. They've kidnapped babies from breastfeeding mothers. They've stolen health care from the sick to enrich oligarchs. They pollute our air and…","47853","11053"],"replies":[["1102925534781161473","1102925532604391425","1551792913","Alexandria Ocasio-Cortez","AOC",false,null,false,"It’s not my position to tell people how to feel, or that their hurt is invalid.\n\nBut incidents like these do beg the question: where are the resolutions against homophobic statements? For anti-blackness? For xenophobia? For a member saying he’ll “send Obama home to Kenya?”","en","","22334","3914"],["1102927183134277633","1102925532604391425","1551793306","Alexandria Ocasio-Cortez","AOC",false,null,false,"In this administration + all others, we should actively check antisemitism, anti-blackness, homophobia, racism, and all other forms of bigotry.\n\nAnd the most productive end goal when we see it is to educate and heal.\n\nIt’s the difference btwn “calling in” before “calling out.”","en","","13756","1810"],["1102928794279702528","1102925532604391425","1551793690","Alexandria Ocasio-Cortez","AOC",true,null,false,"“Calling out” is one of the measures of last resort, not 1st or 2nd resort.\n\nWe do it when repeated attempts to “call in” are disrespected or ignored. And I believe that Ilhan, in her statement a few weeks ago, has demonstrated a willingness to listen+work w/impacted communities.","en","","17330","1873"],["1102929545928282113","1102925532604391425","1551793869","Alexandria Ocasio-Cortez","AOC",false,null,false,"I often think about how I work with white or male allies when they say something insensitive.\n\nThe 1st thing I do is pull them aside + say “hey, you may not be aware of X thing regarding Latinx people, but here is the history and it’s hurtful. If you want to learn more, read Y.”","en","","20353","2133"],["1102931265123168257","1102925532604391425","1551794279","Alexandria Ocasio-Cortez","AOC",false,null,false,"And don’t even get me started on misogyny. \n\nIf we called resolutions on sexist statements, a good chunk of Congress would be gone.\n\nTo jump to the nuclear option every time leaves no room for corrective action.\n\nSo I ask *everyone* that we practice calling in before calling out.","en","","30774","3518"],["1103158079045038080","1102925532604391425","1551848356","Vision Creation Failson","viperwave",false,"AOC",false,"Gibberish.","en","","26",""],["1103159469637287936","1102925532604391425","1551848687","🌇vole, mighty digger🌆","anti_minotaur",false,"viperwave AOC",false,"AOC should corner Ilhan Omar, tell her to cool it with the antisemitic remarks, and hand her a book by Moishe Postone.","en","","7",""],["1103291666318938113","1102925532604391425","1551880206","Pacnov","pacnov14",false,"AOC",false,"That's all Democrats do is shout out all kinds of crazy off the chain theories.  Of course you're going to stick up for the anti-Semitism Muslim rep. If you didn't you would have to put your own name on your own list. Your political run will be short. Can't wait!","en","","9","2"],["1103315989565972480","1102925532604391425","1551886005","Boulot Dodo 🌹","Boulot_Dodo",false,"AOC",false,"@aoc this is an intervention by your old best friends, who are telling you as true friends that your new rich, powerful friends won't stand by you, they are changing you for the worse, have distorted your vision, remember where you came from. We'll be here for the old you.","en","/AOC","9","2"],["1103305946292502529","1102925532604391425","1551883610","For the Defense","AvinashSamarth",false,"AOC",false,"This is basically “All Lives Matter.”","en","","8","1"],["1103188764757815296","1102925532604391425","1551855672","Karin Fox","KarinFox",false,"AOC",false,"Except that it’s been pointed out to her MULTIPLE times and it doesn’t stop. She has been making these hateful comments for YEARS. She not only doesn’t stop, but she digs in.","en","","8","1"],["1103160856777580545","1102925532604391425","1551849018","gram on line","i_am_gram",false,"AOC",false,"pick a side","en","","10","1"],["1103316102048821250","1102925532604391425","1551886032","TheseLongWars","TheseLongWars",false,"AOC",false,"Are these tweets necessary? Maybe logging off would be better, Congresswoman. Take care.","en","","4","1"],["1103314649800499201","1102925532604391425","1551885685","Griffin Lussier","griffinzoth",false,"AOC",false,"Yeah she didn't do anything wrong though. The \"republicans do it too\" argument shouldn't be our go-to when we get wrongly accused. Ilhan doesn't need to demonstrate willingness to listen+work, she needs support for being brave and correctly calling out people.","en","","5","1"],["1117520292216287233","1102925532604391425","1555272574","Elijah Fox","DavidAlanMay",false,"griffinzoth AOC",false,"She is using the words to cover up her hatred for America and those who love it.","en","","",""],["1103284659998330880","1102925532604391425","1551878535","byc","brettyancy",false,"AOC IlhanMN",false,"Umm... @IlhanMN was already pulled aside, spoken to and reprimanded at least two times already. What I find amazing is your blindness for a friend.","en","/IlhanMN","14",""],["1104768396183461888","1102925532604391425","1552232285","Keelin Madden","KeelinMadden",false,"brettyancy AOC IlhanMN",false,"Anti American, Self Righteous, Co conspirators AOC, Omar & Tlaib","in","","",""],["1103279854059950082","1102925532604391425","1551877389","Lamarx Odom","IamJackieLegs",false,"AOC",false,"You're a flat out traitor for not unequivocally supporting her original statements about AIPAC and the Israeli lobby influence that weren't anti Semitic at all \n\nIlhan should get all the credit and fame that you do. She's way more progressive and brave.","en","","7","2"],["1103358791976923137","1102925532604391425","1551896210","(((Charlie Hall)))","charliehall613",false,"IamJackieLegs AOC",false,"The statements about AIPAC were slanderous lies. AIPAC does not contribute to candidates. \n\nAnd there is nothing more vile and an accusation of disloyalty.","en","","",""],["1103368125582663682","1102925532604391425","1551898435","Lamarx Odom","IamJackieLegs",false,"charliehall613 AOC",false,"Members of AIPAC donate to candidates through other means so who gives a fuck, regardless that is totally irrelevant to what Omar said and pro Israel politicans and people are all bad people no exceptions.","en","","",""],["1106024487315755009","1102925532604391425","1552531761","(((Charlie Hall)))","charliehall613",false,"IamJackieLegs AOC RepEliotEngel",false,"You would include @RepEliotEngel as a bad person even though he is a cosponsor of the Green New Deal, Medicare For All, and Net Neutrality -- and an opponent of Trump's budget cuts?","en","/RepEliotEngel","",""],["1103169363480174592","1102925532604391425","1551851046","Zach Gee","theZatchery",false,"AOC",false,"I really don’t like that you pile on her as well here. She said nothing wrong.","en","","5",""],["1103306286542786561","1102925532604391425","1551883691","Kip Rogers","amazingkip",false,"AOC",false,"If you had half Ilhan Omar's courage, you'd admit you screwed up in not supporting her. The Republicans dragged you guys into a bad faith argument and you fell for it.","en","","9",""],["1109571003066257408","1102925532604391425","1553377316","Bill TheCat","BillTheCat22",false,"amazingkip AOC",false,"Ilhan is a raging anti-Semite. That is not courage.","en","","",""],["1103390794042535944","1102925532604391425","1551903839","Erik L. Mann","ErikLMann1",false,"AOC",false,"Im from Northwest Georgia in a part of country thats predominately conservative and  from a generation thats very bigoted. I have been following your career since before you were elected. All i can say is i wish you were the representative that  i could vote for.","en","","7",""],["1109571294062960640","1102925532604391425","1553377385","Bill TheCat","BillTheCat22",false,"ErikLMann1 AOC","true"," pic.twitter.com/5bQOLMLHtt","und","https://t.co/5bQOLMLHtt","",""],["1103192581511376896","1102925532604391425","1551856582","robert affinity","affinity292",false,"AOC",false,"According to many, she has had  a lot of calling in first and it has gone nowhere.","en","","1",""],["1103193111608639488","1102925532604391425","1551856708","SuperJewGirl","SuperJewGirl",false,"affinity292 AOC",false,"I just unfollowed AOC. She retweeted Bishop Swan. He's an antisemite and raging homophobe.","en","","1",""],["1103193908153004032","1102925532604391425","1551856898","robert affinity","affinity292",false,"SuperJewGirl AOC",false,"Yikes. Yes. I've seen some of his comments about Jews. Nasty.","en","","1",""],["1103242209720184832","1102925532604391425","1551868414","Michael McDowell","MichaelMcDowel6",false,"AOC",false,"It’s not listening when you repeat the same stupid shit. I believe she’s beyond redemption now and should be expelled from Congress. She doesn’t represent the values of Americans.","en","","4",""],["1103330828132761601","1102925532604391425","1551889542","Linda A. Abernathy","onmybroomnow",false,"AOC","true","For once shut ur mouth I am not even in Congress and know she has repeated this again AFTER her reprimand!Personally I don't believe her or you!Here is the next young generation of naysayers that haven't a clue what is truly going on in the world but trying to make it change! pic.twitter.com/TC2CS9pcL7","en","https://t.co/TC2CS9pcL7","1","1"],["1103358328154005504","1102925532604391425","1551896099","(((Charlie Hall)))","charliehall613",false,"AOC",false,"No, calling out needs to be done early and often. We do it with the Republicans and we need to hold Democrats to an even higher standard. Rep. Omar needs to shut up until she learns more about bigotry.","en","","4",""],["1103363343233044481","1102925532604391425","1551897295","#BDS Feral Sherry Green Dream","ProFromWithin",false,"AOC",false,"#IStandWithIlhan did nothing wrong to begin with. Too bad you don't just say that.","en","/hashtag/IStandWithIlhan?src=hash","3",""],["1103266255224619008","1102925532604391425","1551874147","Anna marie","anna_moak",false,"AOC",false,"You call our president a racist with no proof or offering no supporting evidence! but defend a anti-semite who by her words has condemned herself! One termer! Never Dem again!","en","","2",""],["1103246691388588032","1102925532604391425","1551869483","Randy Stephens","RetiredNavy1994",false,"AOC",false,"She is only a model for anti Semitic ppl. Her alligence is only to allah not the  http://usa.plus  socialism has no place in the usa either. Try it and the ppl will rise up in fight.are you getting ready for prison yet","en","https://t.co/l4wVdGMOKy","2",""],["1103278040895889413","1102925532604391425","1551876957","LawAbidingCitizen","IntrepidUSA2018",false,"AOC",false,"And just how many times does she need to openly state hate for Jews, support of terrorist organizations, etc. etc. etc.??? She has done it on MULTIPLE occasions...get a grip, she hates America, Americans, Israel & Jews...she makes no bones about it either.","en","","2",""],["1103159770674941952","1102925532604391425","1551848759","Cathy Weston","CathyWeston6",false,"AOC",false,"Just look at her tweets years ago, she displayed an obsession with negative and misguided tweets on Israel and the Jewish people. She lacks the education and empathy on this whole subject unfortunately. We will not tolerate this type of behavior in America!!! ","en","","2",""],["1103252875105320960","1102925532604391425","1551870957","ProPoleVault","Survivor_9",false,"AOC",false,"She made numerous Anti-Semitic statements. Don't try to save someone that is Anti-America and aligned with terrorists.","en","","2",""],["1103313504289808386","1102925532604391425","1551885412","someone something","richsuckass",false,"AOC",false,"If you gotta not criticize Israel so you can be president someday, maybe sit this one out. This doesn't means anything or make any sense.","en","","",""],["1103379008790675456","1102925532604391425","1551901030","Chris Hurley","ChrisHurley44",false,"richsuckass AOC",false,"This dumb twat will NEVER be president. She cant even name the 3 branches of government and constantly shows her low IQ. I know someone will respond \"if the idiot trump can be than...\". Save it. Hes a business man. Shes a bartender.","en","","4",""],["1103462578464804864","1102925532604391425","1551920954","Sheetzmt0","Geta_Clue19",false,"ChrisHurley44 richsuckass AOC",false,"So true. Thank you.","en","","",""],["1103192932696256512","1102925532604391425","1551856666","Andrew S.","shoutingboy",false,"AOC",false,"The thing is, since her statement of a few weeks ago, she’s doubled down on the sleazy Jew-baiting, which ought to be taken into consideration","en","","2",""],["1103193232979091457","1102925532604391425","1551856737","Andrew S.","shoutingboy",false,"AOC",false,"I mean, it’s cool. Omar hates Jews. You don’t hate Jews exactly, but you don’t mind when your friends do. Just own it and we can all move on from there ","en","","",""],["1103270033290129408","1102925532604391425","1551875048","Stephen Greenfeld","BoSoxFan1971",false,"AOC",false,"And she continues to make the Anti Semitic statements.  She is going to say and do what she wants, no matter what.","en","","1",""],["1103475586918477824","1102925532604391425","1551924056","Kamart","kamart160",false,"BoSoxFan1971 AOC",false,"Her staetements are not anti Semitic. Her comments are regarding the Israeli government not religion","en","","",""],["1103666397270495232","1102925532604391425","1551969548","Stephen Greenfeld","BoSoxFan1971",false,"kamart160 AOC",false,"Yet she keeps making statements that many take as anti-semitic.  If you had family members in the concentration camps, like I had, then come talk to me.  Otherwise, you are shouting from the cheap seats.","en","","",""],["1103732487396777984","1102925532604391425","1551985306","Kamart","kamart160",false,"BoSoxFan1971 AOC",false,"Many take those statements as anti Semitic by choice bc they get lots of $$$ from aipac. \nSo are you ok with lobbyists? How about Netanyahu and his government?  That’s what it’s about but some choose to hide behind anti Semitic rhetoric. I choose to listen to what she’s saying","en","","",""],["1103828473775378432","1102925532604391425","1552008190","Stephen Greenfeld","BoSoxFan1971",false,"kamart160 AOC",false,"I am 100% against lobbyists in our country.  Think they should ALL be banned.  There should also be term limits in Congress in our country.  But they will never vote in anything that goes against their best interests.  Can't get rich when you are out of D.C.","en","","1",""],["1103245760961880064","1102925532604391425","1551869261","Micah Neil","neil_micah",false,"AOC",false,"Unless you are a democrat calling out a republican or conservative. Then it's the first thing you do. Try to publicly ruin their life and reputation. Double standards.","en","","1",""],["1103287898705707010","1102925532604391425","1551879307","scott","scott6144",false,"AOC",false,"But apparently you believe that impeachment should always be a first resort option so why not bring her up on hate crime charges?","en","","1",""],["1103390930378387459","1102925532604391425","1551903872","Erik L. Mann","ErikLMann1",false,"AOC",false,"I have high hopes for your future and what you can do for our country.","en","","1",""],["1103278623937695744","1102925532604391425","1551877096","Bobby Dwayne Elrod","Derwin0000",false,"AOC",false,"In other words you want to hide racism within the Democrat Party.  But of course have no problem calling out the same thing when it's Republicans.  Or do you just not care because it was against Jews?  So that means you're either a hypocrit or an anti-semite.  Gotcha...","en","","1",""],["1103309667025838080","1102925532604391425","1551884497","Mario Diaz delaRosa","MADdelaRosa",false,"AOC",false,"This is pure word salad nonsense and you know it.","en","","1",""],["1103161818078359554","1102925532604391425","1551849247","jsok1948","jsok1948",false,"AOC",false,"I wish this was true but she has doubled down. As a progressive Jew who supports a two-state solution to the conflict between Jewish and Arab nationalism, I find the use of anti-semitic memes offensive whether engaged in by people pn the left as well as the right.","en","","2",""],["1103326285395386371","1102925532604391425","1551888459","foolie","PapaDocStrunsee",false,"jsok1948 AOC",false,"A two-state solution is impossible. Israeli policy for decades now has been to make any potential Palestinian state unviable. Unless you agree with returning all of the illegally settled land, anyways.","en","","",""],["1103331616061980673","1102925532604391425","1551889730","jsok1948","jsok1948",false,"PapaDocStrunsee AOC",false,"Both sides must compromise. Neither side will get all it wants.","en","","",""],["1103822783312609280","1102925532604391425","1552006834","John Bradley 🌹","jbmorrill",false,"AOC IlhanMN",false,"This entire controversy is manufactured to stifle dissent around Israel. I wish you would have stood up for @IlhanMN with courage rather than lending credence to the smear by talking about calling people in and implying she was ever in the wrong.","en","/IlhanMN","1",""],["1103282354607587328","1102925532604391425","1551877985","Ben Thompson","ChefBenT",false,"AOC",false,"It’s good to know that you support moderate penalties for rabid racism. I wonder what your reaction would be to someone saying things about Hispanics or Blacks... I’m betting it wouldn’t be tolerant in the least. But antisemitism, well that’s just not so bad, right? DISGUSTING!","en","","1",""],["1103158302559485952","1102925532604391425","1551848409","Kindergarten cum commune","D_A_Clarke",false,"AOC",false,"meaningless drivel","en","","1",""],["1103157414474469376","1102925532604391425","1551848197","Rowdy Rob","cowboysfansc1",false,"AOC",false,"Because she is ur friend! She's done it multiple time in her public office career n she should be booted from our government n country!","en","","1",""],["1103159288816521216","1102925532604391425","1551848644","Jolie ❤️🇺🇸👠💋","JolieToTheRight",false,"AOC IlhanMN",false,"\"Call in\" is NOT a thing just like your Green New Crap is not and NEVER will be a thing #NonsenseTalk\n\nBesides, @IlhanMN had not 1 or 2 but several \"call outs\" #VoteOutOmarTlaibAOC","en","/hashtag/NonsenseTalk?src=hash /IlhanMN /hashtag/VoteOutOmarTlaibAOC?src=hash","1",""],["1103262635603255297","1102925532604391425","1551873284","Brian D","bkdwweights",false,"AOC",false,"All she has demonstrated is that she is as big a hypocrite as you.","en","","1",""],["1103161608019292160","1102925532604391425","1551849197","Stephanie Berland","hephanie_stelen",false,"AOC",false,"But, after her statement she didn’t learn did she?  And saying “well we don’t do this for other communities” doesn’t justify the actions.  We SHOULD be calling people out (or “in”) for their prejudices no matter what.","en","","","1"],["1103287259963539460","1102925532604391425","1551879155","Sara Leon","saracleon",false,"AOC",false,"What communities.  Anyone who does not love America first does not deserve the honor.  Our soldiers put their lives on the line everyday to protect and defend America.  2020.","en","","1",""],["1103310380384772096","1102925532604391425","1551884667","shunting","thehuntinghouse",false,"AOC",false,"This is just identarian bullshit.","en","","1",""],["1103301369463824384","1102925532604391425","1551882519","Madeline Morrow","Maddlehead",false,"AOC IlhanMN",false,"@IlhanMN was \"called in,\" and she kept doing the very thing she apologized for: using antisemitic tropes. The strength of the \"call out\" against her may be too much, but she needs to be called out somehow. Even at the risk of minimizing others' bigotry.","en","/IlhanMN","",""],["1103326604053352448","1102925532604391425","1551888535","foolie","PapaDocStrunsee",false,"Maddlehead AOC IlhanMN",false,"She spoke the truth, and never uttered a bigoted or hateful word. If some people say they’re offended by that, what of it? That’s life, somebody will always have a cynical reaction to the truth.","en","","1",""],["1103175677489106944","1102925532604391425","1551852552","romcommie","romcommie1",false,"AOC",false,"Ilhan is acting like MLK while you're acting like the moderates MLK talked shit about.","en","","",""],["1103178493490212864","1102925532604391425","1551853223","RUSSIAGATOR","django_stiglitz",false,"romcommie1 AOC",false,"I think Nog would disapprove too","en","","1",""],["1103338140402561024","1102925532604391425","1551891286","Robert Albee","robertalbee",false,"AOC IlhanMN",false,"@IlhanMN is RACIST against Jewish people. You are all rightfully outraged when any group of people are insulted but you all have NO problem with being RACIST against Jewish people.","en","/IlhanMN","",""],["1103306644111413250","1102925532604391425","1551883777","adrian","adrian_harwood",false,"AOC",false,"stop accepting the aipac narrative. you’re betraying your constituency with this crap","en","","",""],["1103372733897859072","1102925532604391425","1551899534","Al Tobin Jr","AlTobinJr",false,"AOC",false,"One bitter lesson U will hopefully learn as you age is you must EARN RESPECT...civility is given due to the mores of society but I dont have to respect you for anything on this planet nor you me...we all have free will..if nothing U can say is meaningful then adios!!!  my call","en","","",""],["1103356061333958656","1102925532604391425","1551895559","Derek Osenbach","DerekOsenbach",false,"AOC",false,"B.s. your anti Israel buddy who I refuse to call by name (for I can) will not stop her anti-Israel talk so she either gets reprimanded or steps down.","en","","",""],["1104097491539185665","1102925532604391425","1552072329","wtfevr","orb11111",false,"AOC","true"," pic.twitter.com/XGSTZlfMJH","und","https://t.co/XGSTZlfMJH","",""],["1103281984413949957","1102925532604391425","1551877897","Dee Dee","wizardenai",false,"AOC",false,"So you agree, w/incest, & to marry your brother to gain citizenship in a country. What makes you & Ilhan Omar, Jayapal, Tlaib & the Radical Rogue Democrats, scary is that you are supported by Rothschild's,Soros, & the Young Turks Terrorist Network. Your boyfriend was the ..&..","en","","",""],["1103283250665938944","1102925532604391425","1551878199","Dee Dee","wizardenai",false,"AOC",false,"... you yourself was on the board of Directors. Your a Socialist Terrorist & Justice Democrats, help put people like you into office, to take over our Government. You & the people that backed you belong at Gitmo. You will get a sealed indictment & be sent to GITMO. Bye Bye Alex","en","","",""],["1103302790984679424","1102925532604391425","1551882858","T-bone","Tboane1",false,"AOC",false,"Was the congressman who questioned the blackface words wrong? If so then she did do something wrong.","en","","",""],["1103338517705515008","1102925532604391425","1551891376","Jamshid Bayat","Jamshidbayat",false,"AOC",false,"No calling in, no calling out, just #StandWithIlhan. This is the right thing to do, if you really care. She has done nothing wrong.","en","/hashtag/StandWithIlhan?src=hash","",""],["1103464582784405505","1102925532604391425","1551921432","Sheetzmt0","Geta_Clue19",false,"Jamshidbayat AOC",false,"Nobody cares & willing to bet everyone wants her & you for posing as a congresswomen with zero experience & everything out of your mouth is what other people say or tell you to say.","en","","",""],["1103292145505570822","1102925532604391425","1551880320","Willie Vanderbrink","OilFart1",false,"AOC",false,"Ilhan should be in prison, not Congress.","en","","",""],["1103835825450692608","1102925532604391425","1552009943","Johnathon Justice","jdjustice8912",false,"AOC",false,"And so when you're only seeing white dudes just like, running the world, you think you need to act like a white dude to run the world.\"— sounds racist","en","","",""],["1106357628467363840","1102925532604391425","1552611188","Eddie","Eddieelectric",false,"AOC","true"," https://www.youtube.com/watch?v=1h5iv6sECGU&feature=share …","und","https://t.co/L3AYRyZKkU","",""],["1103306697601400832","1102925532604391425","1551883789","unlern","unlern",false,"AOC",false,"We know that you are from New York and Zionist are very strong in New York .... please don’t compromise your values, we will support you all the way!","en","","",""],["1103642294706753536","1102925532604391425","1551963802","Andrea Allen","andreaallennyc",false,"unlern AOC",false,"Good grief. If you’re not from NY, from her district specifically, maybe it doesn’t matter if you support her all the way. Maybe she’s upholding her values, not compromising them. She has a strong, nuanced position on this, as she should. (Says an AOC constituent.)","en","","",""],["1103647578481139712","1102925532604391425","1551965062","unlern","unlern",false,"andreaallennyc AOC",false,"It does matter, I a several other outside of her district support her on social media and give her money, don’t pigeon hole her she is a national leader!","en","","",""],["1103673313400967173","1102925532604391425","1551971197","Andrea Allen","andreaallennyc",false,"unlern AOC",false,"I’m not pigeon holing anyone. I COMPLETELY disagree with your comments about/to. I also disagree with your apparent sense of your own importance.","en","","",""],["1103683604511629313","1102925532604391425","1551973651","unlern","unlern",false,"andreaallennyc AOC",false,"I believe in standing up and be counted and that is the extent of my importance in my opinion other than that we agree to disagree.","en","","",""],["1103550219247972353","1102925532604391425","1551941849","Cameron Bailey","Kosomot",false,"AOC","true"," pic.twitter.com/EsREzTsLxh","und","https://t.co/EsREzTsLxh","",""],["1103245054687105025","1102925532604391425","1551869092","nickjglover","flipit321",false,"AOC",false,"The way you talk or try to talk is very annoying I think it's an attempt to show that you're smart but it comes off as really stupid and makes no sense... lots of generalizations and platitudes...","en","","",""],["1103348169977413635","1102925532604391425","1551893677","Jessica Love","Jessica18895141",false,"AOC",false,"You make absolutely zero sense. Recall","en","","",""],["1103293174527619073","1102925532604391425","1551880565","William Harvey","WFH1970",false,"AOC",false,"Oh, whoops, Dummyx!  Ha ha. Latinx, not even a word.","en","","",""],["1103382877163737090","1102925532604391425","1551901952","Bauer","BauerRage",false,"AOC",false,"What the hell are you talking about? You sound incompetent. I'd be embarrassed to be represented by you...","en","","",""],["1103292950916685825","1102925532604391425","1551880512","William Harvey","WFH1970",false,"AOC",false,"Dummy","en","","",""],["1103651855463178241","1102925532604391425","1551966081","JayLefbreve","JLefbreve",false,"AOC",false,"Nice of you to scold your friend in public. But your career calls, right ?","en","","",""],["1103261496207986689","1102925532604391425","1551873012","3:16","2H_316",false,"AOC","true","AOC is terrorists anti American   . A poor excuse of a human bein... pic.twitter.com/MNY6r4lmZo","en","https://t.co/MNY6r4lmZo","",""],["1103344159983845376","1102925532604391425","1551892721","TheTruthHurts","TexasTruth2019",false,"AOC",false,"She has publicly stated she doesnt take back any if her antisemitic comments. And you continue to support her. #hypocrite","en","/hashtag/hypocrite?src=hash","",""],["1103343456301146113","1102925532604391425","1551892553","Robert Albee","robertalbee",false,"AOC IlhanMN",false,"How is it that anyone in Congress does NOT know that making Negative Generalizations about a whole group of people is NOT racism?? It is because @IlhanMN does NOT care about the Jewish people whatsoever. To Democrats the Jewish people do NOT matter. @IlhanMN HATES the JEWS.","en","/IlhanMN /IlhanMN","",""],["1103276504476196864","1102925532604391425","1551876591","Cole","RobertMcwhirte1",false,"AOC",false,"You should be in jail","en","","",""],["1103247206327422976","1102925532604391425","1551869605","WWCD","cjm1018",false,"AOC",false,"You truly live in an alternate reality...the level of hypocrisy is so high as to be both disturbing and disrupting to my being as an autistic person who, through nature and nature, has a true sense of reason. I would be happy to debate you on your views,but you won't...","en","","",""],["1103333384653291529","1102925532604391425","1551890152","Greg C (Bernie 2020)","greg06897",false,"AOC",false,"You are botching this like crazy.  Do much better.","en","","",""],["1103305057322307584","1102925532604391425","1551883398","Sharon","Sharon28721754",false,"AOC",false,"She publicly stated her hateful views on the Jewish people so she should be admonished publicly . Remove her from foreign affairs committee immediately!!","en","","",""],["1103287282579263490","1102925532604391425","1551879160","top secret","earthboundagain",false,"AOC",false,"You are a representative of the US government, you no longer get the soft touch. If you can't handle the criticism...resign.","en","","",""],["1109570733544480768","1102925532604391425","1553377252","Bill TheCat","BillTheCat22",false,"AOC",false,"Horse poo. Ilhan is a raging anti-Semite and you are an enabler.","en","","",""],["1103253427855843329","1102925532604391425","1551871089","ProPoleVault","Survivor_9",false,"AOC CNN seanhannity FoxNews TuckerCarlson",false,"@cnn @seanhannity @foxnews @TuckerCarlson Your site is full of Anti-Americans and Terrorists and you're not smart enough to see that.","en","/CNN /seanhannity /FoxNews /TuckerCarlson","",""],["1103310147030577152","1102925532604391425","1551884612","Garo","gsdduke27",false,"AOC",false,"Yes listen to the bartender. She is all knowing. We should follow her example. We can start hiding money to.","en","","",""],["1104259223947489281","1102925532604391425","1552110889","Jason Baker","JasonBa14784838",false,"AOC",false,"Ur middle name is disrespect that is like the pot calling the kettle black.","en","","",""],["1103406915328110596","1102925532604391425","1551907683","andy levicki II","hamboney69",false,"AOC",false,"Bullshit","en","","",""],["1103272894866620418","1102925532604391425","1551875730","ComeOnNow","ComeOnN70575850",false,"AOC",false,"“Call in”  .... now your just making shit up........ you suck and so does your district","en","","",""],["1103428280177303553","1102925532604391425","1551912777","Dino De Rosa","fjderosa",false,"AOC",false,"Really?? Your first term in office, as a \"freshman\" representative, you're going to tell people how it's done? Don't you think you're being a bit arrogant?","en","","",""],["1105777025791520768","1102925532604391425","1552472761","Billy","WECjrRIP",false,"AOC",false,"Double standard - god forbid this was a Caucasian male. Any discrimination should be condemnable, but I agree it should met with a degree of intolerance and education/support.","en","","",""],["1103333581378777091","1102925532604391425","1551890199","Tracy pecora","PecoraTracy",false,"AOC",false,"Ilhan is biased, this is only to start more conflict. We are Free and will always stay free. Bring your anti-Simic somewhere else.","en","","",""],["1103250319948034049","1102925532604391425","1551870348","Bernie 2020 or FYM","RehashdLftyMems",false,"AOC",false,"Stop defending her from the right. Defend her from the real left, she did nothing wrong, stop buying into their false narrative","en","","",""],["1103270293861269504","1102925532604391425","1551875110","Lee Heard","LeeHeard5",false,"AOC",false,"Yeah calling out is a last resort. I'll agree. That's because most guys don't remember you're name to call it out. #metoo #libtard #vegancat","en","/hashtag/metoo?src=hash /hashtag/metoo?src=hash /hashtag/libtard?src=hash /hashtag/vegancat?src=hash","",""],["1103303119486812161","1102925532604391425","1551882936","Suck it Schrödinger, I'm alive","swb2328",false,"AOC IlhanMN",false,"Not really true as @IlhanMN has repeatedly done the same thing. She has never really apologized for her words or actions. She is an anti-semite and a bigot.","en","/IlhanMN","",""],["1103297972618444801","1102925532604391425","1551881709","David Partington","DavidDbparti",false,"AOC",false,"Total Garbage, Ilhan has a long history of anti-semitic remarks. Here hate for Jews runs deep.","en","","",""],["1103280122608668673","1102925532604391425","1551877453","I don't wanna B Venezuela","FamilynCountry",false,"AOC",false,"Calling out seems to be your only go to resort","en","","",""],["1103616524131205120","1102925532604391425","1551957658","carla tillman","carla_carti41",false,"AOC",false,"Pot calling the kettle black I see. Illan dislikes Jews. She should just come right out and say it.","en","","",""],["1103286254332981248","1102925532604391425","1551878915","Brad Carr","BradCar75381527",false,"AOC",false,"The thing that annoys people about you is that you have assumed a leadership role and you are a newbie who should be listening and learning rather than shooting your mouth off like you’ve earned respect. You have earned that right.","en","","",""],["1103276700115353601","1102925532604391425","1551876637","Unc dig","dig_unc",false,"AOC",false,"And yet she didn’t change the 1st time or the 2nd time or the 3rd time. Just more ofbthe liberals living their mantra of “do as we say not as we do “.","en","","",""],["1103315549487067136","1102925532604391425","1551885900","George Reznick","GeorgeReznick",false,"AOC",false,"that is all you do - typical hypocrite politician","en","","",""],["1103386256740765696","1102925532604391425","1551902758","chris online","chrisonasty",false,"AOC",false,"What","en","","",""],["1103421019036024832","1102925532604391425","1551911046","Don Fredrick","Colony14",false,"AOC",false,"Please stop your anti-capitalism and anti-liberty bigotry.","en","","",""],["1103445071616200705","1102925532604391425","1551916780","Daniel Price","danprice",false,"AOC",false,"Yes...but then she did it again. And then she did it again. So we are on at least the third resort.","en","","",""],["1103477732900507648","1102925532604391425","1551924567","Markus henry","MattSco87800368",false,"AOC",false,"Thanks for the psychology lesson. Idiot. Come on","en","","",""],["1103332294981496837","1102925532604391425","1551889892","Karen Walkerman","KarenWalkerman",false,"AOC",false,"Umm. She's made more than one statement since then that proves that she doesn't really care.","en","","",""],["1103687460251406336","1102925532604391425","1551974570","Ted Dendinger","TedDendinger",false,"AOC","true"," pic.twitter.com/GyUjddMeLW","und","https://t.co/GyUjddMeLW","",""],["1103292292620865536","1102925532604391425","1551880355","Erin Mitchell Hitt","Hittman1650",false,"AOC",false,"Your an idiot, your like a dizzy blonde cheerleader twirling her hair like omg, I need to put more lipstick on, not a politician. You and the other two in your clan of idiots are typical participation medal winners","en","","",""],["1103291948079681536","1102925532604391425","1551880273","Eric Henderson","erichen87523087",false,"AOC Ilhan",false,"Please, move out of the USA. How dare you not condemn @Ilhan for her over the top anti-semitic/anti-American values. You, @AOC are the problem, not the solution.","en","/Ilhan /AOC","",""],["1103251511918936065","1102925532604391425","1551870632","TedZiaja","TedZiaja",false,"AOC",false,"You're in a party, not a team. Do your job and help us and stop trying to be a one team one voice party","en","","",""],["1103770522129760256","1102925532604391425","1551994374","Libby Shipman","FeelinGroovy2",false,"TedZiaja AOC",false,"She is doing her job. It is the old-guard dems who haven't been doing their job for decades. They are the problem ( you know, aside from IQ45 & the thugs).","en","","",""],["1103449298858057730","1102925532604391425","1551917788","David","David94709755",false,"AOC jjconceptsinc","true"," pic.twitter.com/8aLdgp5fHr","und","https://t.co/8aLdgp5fHr","",""],["1103476732823105538","1102925532604391425","1551924329","Karlynn","Karlynn77",false,"AOC",false,"You mean like \"Calling out\" members of your own party & putting them on a Nixonian \"list\"  for trying to work across the isle in an attempt to do a job that your hubris prevents you from doing? You're the biggest hypocrite in politics, & that's up against some stiff competition.","en","","",""],["1103201517849505793","1102925532604391425","1551858713","Hiram","REBELGALLANT",false,"AOC",false,"What’s the 4th resort?","en","","",""],["1103301987456684035","1102925532604391425","1551882666","JOSH","tellme234",false,"AOC",false,"You get all those things and thoughts in check before you run for office, any office.  What did the people in her district think they were going to get ?","en","","",""],["1103264717907337216","1102925532604391425","1551873781","Lisa Harris","KearMartina",false,"AOC",false,"Hmmm. She called herself out!  Hoping she is removed from her post.","en","","",""],["1103293736069578753","1102925532604391425","1551880699","Mark Tilley","MetalHead42",false,"AOC",false,"You believe her statement from a few weeks aago yet she goes out and makes the same type of statement again. But thats ok because she says she didn't mean it, or is it because she is not a GOP member? Or white? Or male? You are a hypocrite","en","","",""],["1103380129986854914","1102925532604391425","1551901297","Chris Hurley","ChrisHurley44",false,"MetalHead42 AOC",false,"Its because shes brown. Theyre allowed to treat people based on the color of their skin but if the other side does it its racism. Its the height of hypocrisy.","en","","",""],["1103413840417644544","1102925532604391425","1551909334","Mark Tilley","MetalHead42",false,"ChrisHurley44 AOC",false,"Actually I believe that she truly believes what she is saying. Rather than take responsibility for her on actions and thoughts it’s always some one else doing her wrong or that they are out to get her.  I personally don’t care about her skin or sex I care about her bad ideas","en","","",""],["1103316286229151744","1102925532604391425","1551886075","Hokiesfan","hokiesfan74",false,"AOC",false,"like, omg, like, what can you say? like, it's, like all bad, you know? Like, stop bullying me","en","","",""],["1103293600480268288","1102925532604391425","1551880667","not sure why","notsurewhybut",false,"AOC",false,"AOC that dark money makes you say the silliest things babe","en","","",""],["1103301388262612993","1102925532604391425","1551882523","Jeff Wilson","JeffWil28194073",false,"AOC",false,"you make me want to puke.","en","","",""],["1103269007115894787","1102925532604391425","1551874803","Robert Sable","RobertSable2",false,"AOC",false,"Calling out is what she deserves.  You should be ashamed of your behavior.","en","","",""],["1103268989155844098","1102925532604391425","1551874799","Mark Quesnell","quesnell_mark",false,"AOC",false,"Your 'calling in' (making up phrases again) is just other words for 'hiding it in private'.","en","","",""],["1103279288990740487","1102925532604391425","1551877255","Brian Gay","opnsesnonlibs",false,"AOC",false,"Got your bags packed for jail yet?","en","","",""],["1103766547938463744","1102925532604391425","1551993426","dorierez سلام שלום","Dorierez",false,"AOC",false,"Wrong again, she went back to her uneducated declarations!","en","","",""],["1103303689165508614","1102925532604391425","1551883072","Tkaufman","Tkaufman18",false,"AOC",false,"She keeps doing it b","en","","",""],["1103314629504262144","1102925532604391425","1551885680","Bretty Boop","brettyfcknboop",false,"AOC",false,"Lmao only communities that bow down to your cause","en","","",""],["1103291376668598272","1102925532604391425","1551880137","steve hughey","stevehughey9",false,"AOC",false,"Total ignorance and delusion; like a child at the adults table.","en","","",""],["1103275203222818816","1102925532604391425","1551876280","Vic","Vic60556693",false,"AOC SpeakerPelosi",false,"Who are you to make the rules???? Pretty sure @SpeakerPelosi knows what she is doing. Sit down, shut up, and learn. STOP CAUSING DIVISION!!","en","/SpeakerPelosi","",""]]}