{"origin":["1103998951227838469","4:40 AM - 8 Mar 2019","jodikantor","jodikantor",true,"When people say reparations are impossible, I think: well, I know someone who gets them. My grandmother. A Holocaust survivor, liberated almost 74 yrs ago. Gets a check every month from Germany. Has for decades. It's made a huge difference for her. https://nyti.ms/2Ckssqz ","","","26098","7452"],"replies":[["1104004022154027008","1103998951227838469","1552050044","Joe R. 🌐","JoeR42",false,"jodikantor",false,"I don't really have a position for or against reparations, but will say, there's a big difference: your grandmother was a Holocaust survivor herself; any survivors of slavery are long since dead. The societal impact of slavery is still felt, but the situations aren't analogous.","en","","284","6"],["1104019631021404161","1103998951227838469","1552053766","Fayola Alibey","falibey",false,"JoeR42 jodikantor",false,"It’s no different than when the estate of someone sues to get what is owed to that someone. The challenge with them not being alive is determining whose estate is owed. I’m pretty sure the government with some effort can figure it out.","en","","215","8"],["1104042780085628933","1103998951227838469","1552059285","Matt Pociask","matt_pociask",false,"falibey JoeR42 jodikantor",false,"Executors of estates sue people when they are  in process of closing estate, so it is still different.  Those estates (of former slaves) closed anywhere from 150-60 years ago.  I am for reparations, including for Jim Crow, but the estate process really isn't a good fit.","en","","23",""],["1104043714995998720","1103998951227838469","1552059508","Fayola Alibey","falibey",false,"matt_pociask JoeR42 jodikantor",false,"Sigh - I just meant the principle is the same. Whether or not someone is dead doesn’t deprive the family of what is owed to them. But go ahead and focus on the semantics.","en","","143",""],["1104062961537167360","1103998951227838469","1552064097","Matt Pociask","matt_pociask",false,"falibey JoeR42 jodikantor",false,"Not trying to argue semantics or nit pick, and sorry it came across that way.  I agree with you that it's something we can figure out - a) identify former slaves, b) identify living descendants, c) pay reparations","en","","50","3"],["1104064486649024512","1103998951227838469","1552064460","Matt Pociask","matt_pociask",false,"falibey JoeR42 jodikantor",false,"And as a brief follow up, because genealogy is difficult, I don't think payments should be limited to only people who can name direct line descendants - you can come at it from other direction, also, and pay people who more likely than not are descendants","en","","18","1"],["1104073249179271168","1103998951227838469","1552066549","Squash","joshuamcsee",false,"matt_pociask falibey JoeR42 jodikantor",false,"Can you imagine the fraud? If the standard for receiving a chunk of cash from the government is \"there's a decent chance someone in your family tree 150-350 years ago was a slave\" you're gonna have a helluvalot of people lining up. White people too.","en","","11",""],["1104093102808158208","1103998951227838469","1552071283","Southlake","zipcity22",false,"joshuamcsee matt_pociask falibey JoeR42 jodikantor",false,"Given the overwhelming correlation, maybe we can just leverage the same sophisticated metric cops and twitter guys use to decide whether a 16-year-old is a kid or a \"thug\" and \"no angel\"","en","","31","3"],["1104118985279369216","1103998951227838469","1552077454","Sandro 🇺🇸🇦🇴♌️","droskiwoooski",false,"zipcity22",false,"Fire take ","en","","6",""],["1104107849318260737","1103998951227838469","1552074799","BlackParentingMagazine 👶🏾","BlackParenting1",false,"jodikantor AOC","true","Everyone but for descendants of slaves. pic.twitter.com/RXnImKLGUK","en","https://t.co/RXnImKLGUK","771","253"],["1104220679455428608","1103998951227838469","1552101700","BlackParentingMagazine 👶🏾","BlackParenting1",false,"jodikantor AOC",false,"I'm stepping out of this conversation. The rabbit hole is too deep for some to grasp. Reparations are in order and people know it. Some are mad that Black folks might get ahead if reparations are paid and that's the bottom line. Have a great day! ","en","","504","53"],["1104387952086536192","1103998951227838469","1552141580","Sugandese","zappafoom",false,"BlackParenting1 jodikantor AOC",false,"I never owned a slave and nether did anyone in my family tree. I am not paying a fine for something I never did. GFY","en","","3",""],["1104391583477035008","1103998951227838469","1552142446","BlackParentingMagazine 👶🏾","BlackParenting1",false,"zappafoom jodikantor AOC",false,"You do realize you are CURRENTLY contributing to reparations that are active today already, right? The War on Poverty obviously failed (more impoverished white families on welfare than Blacks) and that still isn’t reparations.","en","","3",""],["1104411243371290626","1103998951227838469","1552147134","Sugandese","zappafoom",false,"BlackParenting1 jodikantor AOC",false,"In the same sentence you say the war on poverty \"is\" reparations, but a few words later it \"isn't\" reparations. How am I supposed to respond to that? Not even you have any clue as to what you're saying.\n\nYou just want free shit. Just admit it.","en","","1",""],["1104021358885900288","1103998951227838469","1552054178","Oregonian in Florida","hastingst17",false,"jodikantor",false,"I don't think any sane person disputes that survivors of slavery should have received financial support while they were still alive.  But those people are long gone now, as are their immediate descendants.  So the Holocaust analogy is not really relevant.","en","","216","8"],["1104167620457177088","1103998951227838469","1552089049","Dexter Cumberbatch","DexterC73",false,"hastingst17 jodikantor","true"," pic.twitter.com/f9C39VAfbk","und","https://t.co/f9C39VAfbk","167","28"],["1104294934029381633","1103998951227838469","1552119403","WesleysMomOfGU","WesleysMomOfGU",false,"DexterC73 hastingst17 jodikantor common JohnFugelsang deray shaunking RepMaxineWaters BarackObama maddow CharlesMBlow",false,"If you listen to this speech, you’ll understand why Dr. Martin Luther King was assassinated. Economic facts and factors don’t lie.  \n@common @JohnFugelsang @deray @shaunking @RepMaxineWaters @BarackObama #reparations #BlackLivesMatter @maddow @CharlesMBlow #MLK #racism #Trump","en","/common /JohnFugelsang /deray /shaunking /RepMaxineWaters /BarackObama /hashtag/reparations?src=hash /hashtag/BlackLivesMatter?src=hash /hashtag/BlackLivesMatter?src=hash /maddow /CharlesMBlow /hashtag/MLK?src=hash /hashtag/racism?src=hash /hashtag/Trump?src=hash","7",""],["1104470395074289664","1103998951227838469","1552161236","Who's Your Gaddy?","gad_E",false,"WesleysMomOfGU DexterC73 hastingst17 jodikantor common JohnFugelsang deray shaunking RepMaxineWaters BarackObama maddow CharlesMBlow",false,"My family seems to have missed out on that land grab. Do I get anything?","en","","",""],["1104473453065916418","1103998951227838469","1552161965","Dexter Cumberbatch","DexterC73",false,"gad_E WesleysMomOfGU hastingst17 jodikantor common JohnFugelsang deray shaunking RepMaxineWaters BarackObama maddow CharlesMBlow",false,"They also missed out on slavery and Jim Crow.","en","","5",""],["1104960564642660352","1103998951227838469","1552278102","Christy Robinson ☕️","christyrobinson",false,"DexterC73 gad_E WesleysMomOfGU hastingst17 jodikantor common JohnFugelsang deray shaunking RepMaxineWaters BarackObama maddow CharlesMBlow","true"," pic.twitter.com/7FaHr3uZTz","und","https://t.co/7FaHr3uZTz","1",""],["1104140926702764034","1103998951227838469","1552082685","debraj1121 expand a child's world w a diverse book","debraj112",false,"jodikantor",false,"It would make a huge difference for black ppl tool. The Holocaust happened. Japanese internment happened. Slavery and years of legal oppression happened to black people. Emphasis on legal. Civil Rights in 1965.","en","","74","10"],["1104148262964129794","1103998951227838469","1552084434","Matrix Moma","MatrixMoma",false,"debraj112 jodikantor",false,"By now, there are people 7 generations removed from slavery. That's a lot of checks.","en","","18","1"],["1104151769385455616","1103998951227838469","1552085270","debraj1121 expand a child's world w a diverse book","debraj112",false,"MatrixMoma jodikantor",false,"Who said it had to be checks?  Who said it only covers slavery.  I grew up during the Jim Crow era.  There were jobs you could not get as a black person. There were places you could not go. Schools were not funded. All of this was done under the law & by the government.","en","","72","6"],["1104202422958866432","1103998951227838469","1552097347","Major","skiprocks21",false,"debraj112 MatrixMoma jodikantor KeriLeighMerrit","true","don't forget when social security began it excluded many blacks on purpose.\n https://www.washingtonpost.com/news/wonk/wp/2013/06/03/a-second-look-at-social-securitys-racist-origins/?utm_term=.31fe2039a254 …\nand homesteading in the 1860's also excluded blacks. great article by @KeriLeighMerrit forget 40 acres & a mule.  I want my 160 acres.https://aeon.co/ideas/land-and-the-roots-of-african-american-poverty …","en","https://t.co/DvqKxTPXhs /KeriLeighMerrit https://t.co/uzKJKetoEz","23","8"],["1104213614653779970","1103998951227838469","1552100015","debraj1121 expand a child's world w a diverse book","debraj112",false,"skiprocks21 MatrixMoma jodikantor KeriLeighMerrit",false,"Not withstanding the race riots & expansions of cities that took land from African Americans.","en","","14","2"],["1104519445257568256","1103998951227838469","1552172931","StoChastic","stochastic84",false,"debraj112 skiprocks21 MatrixMoma jodikantor KeriLeighMerrit",false,"I’m sorry you had to deal with that, I truly am. Clearly a dark time in American history. So if not checks, how would the reparations be composed off? And who all gets them? It just seems like a fair idea, but not a practical one to me.","en","","1",""],["1104537642685870080","1103998951227838469","1552177269","debraj1121 expand a child's world w a diverse book","debraj112",false,"stochastic84 skiprocks21 MatrixMoma jodikantor KeriLeighMerrit",false,"There would be commissions. Education, which was denied or substandard, is a good place to start.  There's no one answer. And it would likely be done incrementally. The question is not who qualifies. It is how do we stop anti-black racism now?","en","","",""],["1104144877707816962","1103998951227838469","1552083627","CJ Foster","CJFoster2",false,"jodikantor AOC",false,"There is NO case for reparations as no slaves are currently living, and no American alive has owned slaves. \nBut I do really really hope the left continues down this insane path and continues to judge the past by the moral standards of today. You'll never hold power again","en","","73","4"],["1104184641118863360","1103998951227838469","1552093107","Dusana","DusanaMichaels",false,"CJFoster2 jodikantor AOC",false,"What about: \"promote the general Welfare, and secure the Blessings of Liberty to ourselves and our Posterity, do ordain and establish this Constitution for the United States of America.\" And then: All men are created equal and life, liberty and the pursuit of happiness stuff.","en","","26",""],["1104361592181923841","1103998951227838469","1552135296","Daria Neal","darianeal1881",false,"DusanaMichaels CJFoster2 jodikantor AOC",false,"psssst He doesn't think the Constitution applies to me. Nor does he believe the government codified financial discrimination like Redlining, Black vets not getting benefits of the GI bill or a host of other benefits of whiteness as detailed in When Affirmative Action Was White","en","","72","4"],["1104405629651759104","1103998951227838469","1552145795","Dusana","DusanaMichaels",false,"darianeal1881 CJFoster2 jodikantor AOC",false,"Okay, and I won't let him know you are now more than 3/5 of a person. That must be another one of those crazy modern day standards.","en","","14","1"],["1104680632687288321","1103998951227838469","1552211361","Noneofyourbusiness","HaleQueen34",false,"DusanaMichaels darianeal1881 CJFoster2 jodikantor AOC","true","He'd also be pretty outraged at the fact that we can read and write. That we don't also have to move off the sidewalk to make room for our fairer skinned counterparts.  Oh well whatcha gonna do about it pic.twitter.com/OKH3T9QhU5","en","https://t.co/OKH3T9QhU5","2",""],["1104046997189902337","1103998951227838469","1552060290","Katie","OhWeeBeasties",false,"jodikantor",false,"Would be great if we truly boosted assets across generations to make up for the stolen wealth that never had a chance to make it to currently living descendants. It would mean more than fleeting cash payments (although that could also be part of it). Real estate? Higher ed?","en","","58","5"],["1104124606468767747","1103998951227838469","1552078794","SadieBuddy","buddy_sadie",false,"OhWeeBeasties jodikantor",false,"The same argument could apply for the poor and lower middle class of any race and the corporations that took advantage of their employment and lack of safe working conditions.","en","","14","3"],["1104130706651992064","1103998951227838469","1552080248","Sandra Kearns","Kearns_SL",false,"buddy_sadie OhWeeBeasties jodikantor",false,"It really couldn’t. The chattel enslavement of African descendants is unlike any other struggle from any other group in the United States. The First Nations are the only group somewhat comparable.","en","","96","2"],["1104144651987152898","1103998951227838469","1552083573","SadieBuddy","buddy_sadie",false,"Kearns_SL OhWeeBeasties jodikantor",false,"Agreed. But the shackles of generational poverty is pretty heavy.","en","","10",""],["1104243664706924544","1103998951227838469","1552107180","SadieBuddy","buddy_sadie",false,"Kearns_SL OhWeeBeasties jodikantor",false,"I apologize. Not my intention to offend.","en","","",""],["1104021436648312832","1103998951227838469","1552054196","RayvenSpencer '77","JennaBellaJ",false,"jodikantor NPRCodeSwitch",false,"My slave ancestors worked to benefit others their entire lives. I cannot support anyone...including me gaining anything from their suffering again now that they are gone. Their enslavement should not again be used to benefit others.","en","","220","11"],["1104116091058573312","1103998951227838469","1552076764","Theo Greene","theo_greene",false,"JennaBellaJ jodikantor NPRCodeSwitch",false,"don't start making sense Jenna... this place will explode.","en","","4",""],["1104120767858511872","1103998951227838469","1552077879","Sandro 🇺🇸🇦🇴♌️","droskiwoooski",false,"theo_greene JennaBellaJ",false,"Wait is your logic that African ppl were legally prevented from being compensated at market value for their labor from slavery through Civil Rights to the benefit of an entire society but that society shouldn’t acknowledge that fact and compensate the descendants of those people?","en","","9","1"],["1104123511168151552","1103998951227838469","1552078533","Theo Greene","theo_greene",false,"JennaBellaJ",false,"by this logic, Iraq&Egypt have to start paying the jewish people & on & on 7K yrs history of this crap-how far back do we go? end the current slavery in the world then C about paying great grand children of all people who were enslaved $ for the victimizing of ppl they never knew","en","","2",""],["1104128466948112385","1103998951227838469","1552079714","Sandro 🇺🇸🇦🇴♌️","droskiwoooski",false,"theo_greene JennaBellaJ",false,"You’re using what-aboutism. Stay on topic. Just admit you don’t think those things have lasting effects that should be addressed and restitution should occur.","en","","10",""],["1104130769671208960","1103998951227838469","1552080263","Theo Greene","theo_greene",false,"JennaBellaJ",false,"Not how I feel at all. If someone is victimized, EXTREME restitution should be made to that person. Not to their relatives generations later. If that's the case, restitution should be made to almost every person on the planet. At least, that's what world history would dictate.","en","","4",""],["1104131329640169472","1103998951227838469","1552080397","Sandro 🇺🇸🇦🇴♌️","droskiwoooski",false,"theo_greene JennaBellaJ",false,"And who is world history (and policy) written by the oppressed or the oppressors?","en","","11",""],["1104131964074934274","1103998951227838469","1552080548","Sandro 🇺🇸🇦🇴♌️","droskiwoooski",false,"theo_greene JennaBellaJ",false,"I enjoy the debate but this I believe the government can make restitution not just for slavery but for jim crow, red lining, denied access to GI benefits all things suffered by black people who are still alive today.","en","","5",""],["1104113279612395520","1103998951227838469","1552076093","Brian K","B_2tha_K",false,"jodikantor",false,"I have serious problem paying for something a bunch of people we didn't know doing something to a bunch of people we didn't know. It sucks that it happened, it's a stain on American history, but I didn't do it, condone it, or support it so excuse me for not wanting to pay for it.","en","","22","2"],["1104115586584453121","1103998951227838469","1552076643","BlackHippieChick74","URInnerFreak",false,"B_2tha_K jodikantor","true","Yeah, but you’re still enjoying the benefits from it . I didn't know my ancestors who were slaves, but it hasn't stopped the ancestors of my fellow Caucasian Americans from using the color of my skin as a disadvantage towards me. pic.twitter.com/NcZugwsZVo","en","https://t.co/NcZugwsZVo","68","7"],["1104119077222662152","1103998951227838469","1552077476","Daniel Foote","db_foote",false,"URInnerFreak B_2tha_K jodikantor",false,"My ancestors weren’t living in this country during the time of slavery. Am I exempt from paying for these? And what about biracial folks? Do they receive a half check? And do they have to pay that half check back because of their white ancestors having slaves?","en","","9",""],["1104120651135119361","1103998951227838469","1552077851","Misti Mbida","MbidaMisti",false,"db_foote URInnerFreak B_2tha_K jodikantor","true"," pic.twitter.com/PfKAaPGtOd","und","https://t.co/PfKAaPGtOd","5",""],["1104215654079578113","1103998951227838469","1552100501","The Safest Space","TheSafestSpace",false,"jodikantor",false,"All slaves who are still alive should receive reparations. Nobody would argue with that","en","","120","8"],["1104253749340430336","1103998951227838469","1552109584","John Tomas L","RPJohnTomas",false,"TheSafestSpace jodikantor",false,"And those who sacrificed to free them should be rewarded.","en","","4",""],["1104052489551196161","1103998951227838469","1552061600","Newso","Keepitfresh85",false,"jodikantor",false,"Black people need to lose this \"victims\" mentality.  Yes slavery was real,  yes it has affects to this day.  But demanding a cash handout isn't going to fix anything. Despite all things I can still achieve! Have a champions mindset,  please.","en","","10","1"],["1104054724058210307","1103998951227838469","1552062133","tacurh","1tacurh",false,"Keepitfresh85 jodikantor",false,"Not a handout and we have not played victim but have BEEN &continue to be victims of systematic racism. Its what's owed and it must be paid. If wht ppl have continued to benefit from unpaid labor of our ancestors then why shouldn't those descendants of those ppl be compensated","en","","11",""],["1104060166020845568","1103998951227838469","1552063430","Newso","Keepitfresh85",false,"1tacurh jodikantor",false,"I guess i was just raised different,  but i was taught and will teach to not worry about what's in others bags. Go out and do what you need to do to fill your own. My kingdom will be built by my own two hands","en","","8",""],["1104074176791437312","1103998951227838469","1552066771","Gil Lederman","gilled34",false,"Keepitfresh85 1tacurh jodikantor",false,"This is an admirable approach to conducting your own personal life, but sounds quite inappropriate to dealing with societal issues. At that scale, “what’s in others bag” is often what was taken from my/your bag, almost literally in the case of slavery.","en","","12",""],["1104080620819369984","1103998951227838469","1552068307","Newso","Keepitfresh85",false,"gilled34 1tacurh jodikantor",false,"Honestly i don't disagree with you","en","","2",""],["1104221056959741952","1103998951227838469","1552101790","Leonydus Johnson","LeonydusJohnson",false,"jodikantor",false,"You know who doesn't get them? You. Because you weren't a Holocaust survivor. If you find any former slaves, by all means give them money. Otherwise, shut up. I'm sick of the race baiting. No to reparations. And no to your virtue signaling white savior complex.","en","","39","8"],["1104407039218872321","1103998951227838469","1552146131","Rosanna Arquette","RoArquette",false,"jodikantor CarlaRK3",false,"Check out my husbands organization ..the Morgan aging with dignity fund. so many holocaust survivors live under the poverty line. he partnered with Jewish family services and they help many survivors.","en","","58","9"],["1104462734928822273","1103998951227838469","1552159410","Amy K","Itkaleya",false,"RoArquette jodikantor CarlaRK3",false,"Just reading about the fund.  So glad you are partnered with somebody caring.  You rock Todd.","en","","1",""],["1104008465712730114","1103998951227838469","1552051104","Wolf Blitzer’s Brain","Watertowerjoey",false,"jodikantor irin",false,"But will her great, great, great grandkids also get them?","en","","84",""],["1104075302202941441","1103998951227838469","1552067039","ashley","ashmichy_",false,"Watertowerjoey jodikantor irin",false,"While they won't get them directly, having that money probably helped in the process of getting her life together financially which then benefits the generations to come, something those who were freed from slavery never received.","en","","148","1"],["1104113948754771969","1103998951227838469","1552076253","Wolf Blitzer’s Brain","Watertowerjoey",false,"ashmichy_ jodikantor irin",false,"In the absence of a time machine what is the \"math\"?  The amount we \"should\" have given freed slaves (adjusted for inflation) disbursed amongst their kin? Won't be much per person.  Also, do only \"slave states\" have to pay into this kitty?","en","","6",""],["1104114144133799937","1103998951227838469","1552076300","Wolf Blitzer’s Brain","Watertowerjoey",false,"ashmichy_ jodikantor irin",false,"The reason I say that is that I had relatives who died to help gain their freedom.  That's giving up a lot more than money.","en","","",""],["1104115048740540416","1103998951227838469","1552076515","ashley","ashmichy_",false,"Watertowerjoey jodikantor irin",false,"And much of this country was built on the backs of people who were never paid and had no choice, but were treated terribly, some dying in the process to feed into building this nation. While I appreciate the sacrifices on your family's side, that was voluntary.","en","","6",""],["1104120157465726976","1103998951227838469","1552077733","Brandon Sams ⛈","TheBrandonSams",false,"ashmichy_ Watertowerjoey jodikantor irin",false,"It was voluntary, paid for, and purposely ignores the literal slaves who fought and died the war for no compensation and the millions who were killed throughout slavery’s centuries-long history and on the way to America. So what are they talking about?","en","","1",""],["1104122923579695104","1103998951227838469","1552078393","Wolf Blitzer’s Brain","Watertowerjoey",false,"TheBrandonSams ashmichy_ jodikantor irin",false,"There was a draft.","en","","",""],["1104125526317371393","1103998951227838469","1552079013","Brandon Sams ⛈","TheBrandonSams",false,"Watertowerjoey ashmichy_ jodikantor irin",false,"Ok, so? Black people were drafted during WWII and we DENIED the G.I. Bill lead to the largest expansion of the middle class in this country. No one’s talking about reparations for that, but for generational slavery and the wages owed and promises made. So, what’s your point?","en","","1",""],["1104132971735408640","1103998951227838469","1552080788","Wolf Blitzer’s Brain","Watertowerjoey",false,"TheBrandonSams ashmichy_ jodikantor irin",false,"My point is what’s the math on paying slave decendants and who pays for it?I had ancestors who were drafted and died to help free them. Why should I pay?Doesn’t make any sense.Your GI Bill example is a great one. Some of those folks are still alive and were screwed by all of us.","en","","",""],["1104142803636899840","1103998951227838469","1552083133","Nikki","chukachukachoo",false,"Watertowerjoey TheBrandonSams ashmichy_ jodikantor irin",false,"Everybody who pays taxes would pay. It's not all about you or your family.","en","","1",""],["1104151765417570304","1103998951227838469","1552085269","John Thorn","thorn_john",false,"jodikantor BarrieAnnMason1",false,"My parents, gone now, also received reparations payments from Germany.","en","","41","4"],["1104173249477304320","1103998951227838469","1552090391","Eric Hanauer","erichanauer",false,"thorn_john jodikantor BarrieAnnMason1",false,"Mine too.","en","","20",""],["1104970405381586944","1103998951227838469","1552280448","Jer","izee28",false,"erichanauer thorn_john jodikantor BarrieAnnMason1",false,"Ya but you don't.","en","","",""],["1104022609157648390","1103998951227838469","1552054476","Tom Tervo","ttervo21",false,"jodikantor nytopinion",false,"In terms of reparations, is there a difference between those who directly suffered and succeeding generations?","en","","2",""],["1104043927001358337","1103998951227838469","1552059558","Heather on the Hill","jitterbug212",false,"ttervo21 jodikantor nytopinion",false,"Of course there is, but that generation didn't receive any so now we have to figure out how to possibly make up for that.\n\nHow do you recompense compounded trauma and poverty?","en","","18","1"],["1104085589731758080","1103998951227838469","1552069492","Alvin Garner II","agarnerii",false,"jitterbug212 ttervo21 jodikantor nytopinion",false,"I’m sure we could figure out the equivalence of the 40 acres and a mule in 2019.","en","","12","1"],["1104323484715548673","1103998951227838469","1552126210","DoubleM","marymargrets",false,"agarnerii jitterbug212 ttervo21 jodikantor nytopinion",false,"It's about more than slavery. It's about not being able to vote, or get the GI Bill (despite fighting WW2), or get FHA Loans & buy a house, or go to state colleges.\nIt's how the middle class was built in US after WW2--but these opportunities excluded many African-Americans.","en","","1",""],["1104371317854351360","1103998951227838469","1552137615","Alvin Garner II","agarnerii",false,"marymargrets jitterbug212 ttervo21 jodikantor nytopinion",false,"I agree 100% it is all of those things as well. But the fact that our labor,built the country, our bodies were the 1st  sold to build the stock market. How many companies gained from that?","en","","",""],["1104119844801146880","1103998951227838469","1552077659","Derek I Jones","dake_j",false,"jodikantor YNB",false,"If Congress set aside $1,000,000,000 (one billion dollars!) for reparations, every black person in this country would get a grand total of approximately $33.","en","","26","1"],["1104120888667136000","1103998951227838469","1552077908","bay-gull","bay_gull91",false,"dake_j jodikantor YNB",false,"So let's set aside more. How about 100 billionm","en","","2","1"],["1104127740402270208","1103998951227838469","1552079541","Derek I Jones","dake_j",false,"bay_gull91 jodikantor YNB",false,"So that would equal approximately $3333 each.\n$10 trillion would give each around $333,333.   \nBut can you see the US Congress ever agreeing to that amount?","en","","3",""],["1104133550901813250","1103998951227838469","1552080927","Mich","gopprincess123",false,"dake_j bay_gull91 jodikantor YNB",false,"Nor should they. Not one person that was enslaved here in the US is still alive. The person receiving money from Germany is alive and went through the Holocaust. There is a huge difference","en","","7",""],["1104090976321265669","1103998951227838469","1552070776","Pencil Bandits","PencilBandits",false,"jodikantor AnandWrites",false,"How 'bout we finally hand over that 40 acres and a mule---with interest?","en","","24","1"],["1104097894934736896","1103998951227838469","1552072425","The Other Wife","WandaAkorede",false,"PencilBandits jodikantor AnandWrites",false,"I agree...","en","","3",""],["1104132432947666944","1103998951227838469","1552080660","Cat West - Counting Witches","catawu",false,"jodikantor marcushjohnson",false,"There are so many forms possible 4reparations  All of them will improve the communities, the economy and the justice system.  My opinion is that they should endure a minimum of 7 generations for POC. Easy to implement because we’ve had oppressive policies in place 4 centuries.","en","","5","1"],["1104132797269045248","1103998951227838469","1552080747","Cat West - Counting Witches","catawu",false,"jodikantor marcushjohnson",false,"If we can design & endure a system of racist oppression, started back in the quill & parchment days, we can design it’s reverse in these modern times.","en","","17","2"],["1104133702861422593","1103998951227838469","1552080963","Kindame","Kindame3",false,"catawu jodikantor marcushjohnson",false,"It's called affirmative action.","en","","5","1"],["1104180786503274496","1103998951227838469","1552092188","Eric K. Ham","EKH2016",false,"Kindame3 catawu jodikantor marcushjohnson",false,"Which benefits white women more than any other group","en","","",""],["1104356242410090497","1103998951227838469","1552134020","Kindame","Kindame3",false,"EKH2016 catawu jodikantor marcushjohnson",false,"\nWRONG!\n\nWhite women are better off than white men.\n\nWhite men are the ONLY class of people NOT protected by the EEOC & are easy targets to ruin. \n\nBlack women rule and can't be fired.\n\nI have lots of experience with this...","en","","",""],["1104421076765954054","1103998951227838469","1552149478","David O'Brien","Dave_OB1",false,"jodikantor",false,"Not only for slavery but for Jim Crow system and state sponsored and enforced segregation through at least the 1960’s. Meaning reparation for harm not only to ancestors but also to people who are still living.","en","","6","2"],["1104512603181613056","1103998951227838469","1552171300","Evang Brown","evang_bmee",false,"Dave_OB1 jodikantor",false,"Thank you for this response. Might I add the harm extended well past the 60s if you factor in the school-to-prison pipeline/ so-called \"war on drugs\"/ mass incarceration that disproportionately affected(s) black males. Formation of ghettos, etc. This is a great thread.","en","","5","2"],["1104024377774014466","1103998951227838469","1552054898","Brad Skipper 🚜⚾️⚖🇺🇸","bradskipper",false,"jodikantor questar1959_ron",false,"That's way, way different! She was directly affected.","en","","9",""],["1104083375818788865","1103998951227838469","1552068964","ChrisB","Chriswb71",false,"bradskipper jodikantor questar1959_ron",false,"So is every elderly Black person alive now affected by Jim Crow which was legal discrimination until the late 1960s.","en","","43","2"],["1107449992170688514","1103998951227838469","1552871628","Anne-Marie O'Connor","theladyingold",false,"Chriswb71 bradskipper jodikantor questar1959_ron",false,"Yes.","und","","",""],["1104003550462574592","1103998951227838469","1552049932","Julia Doughty","julia_doughty",false,"jodikantor","true","For me the Q remains, How can we not pay? pic.twitter.com/ucx4E6Gb0H","en","https://t.co/ucx4E6Gb0H","18","7"],["1104048946643533825","1103998951227838469","1552060755","Lt. Nyota Uhura","idamaepeep",false,"julia_doughty jodikantor",false,"I would like to learn more about this spreadsheet.  Do you have a source?","en","","2",""],["1104058080394964992","1103998951227838469","1552062933","Julia Doughty","julia_doughty",false,"idamaepeep",false,"Not certain. It was posted by Knowledge is Power community on Facebook. I saw Appalachian Feminist Coalition shared it, saved the image. Not that it's academic or professional, but as a springboard for further reading and understanding.","en","","1",""],["1104100188392771585","1103998951227838469","1552072972","Lt. Nyota Uhura","idamaepeep",false,"julia_doughty",false,"Thank you.","en","","1",""],["1104133928649191424","1103998951227838469","1552081017","Ryon","ryonbrown",false,"jodikantor",false,"I had no idea Germany pays reparations to the holocaust survivors. Wow. I’m glad they do... I just had no idea.","en","","43","1"],["1104252303538819072","1103998951227838469","1552109239","Theo Paijmans","memizon",false,"ryonbrown jodikantor",false,"Germany also pays the pensions of former SS members.","en","","2",""],["1104307468526587904","1103998951227838469","1552122392","Ryon","ryonbrown",false,"memizon jodikantor",false,"Whoa really?","en","","",""],["1104308921471258625","1103998951227838469","1552122738","Theo Paijmans","memizon",false,"ryonbrown jodikantor",false,"Sad but true.","en","","",""],["1104339213594562560","1103998951227838469","1552129960","Pinky Slivotitz™❄","ACreativeMuggle",false,"jodikantor",false,"My Serbian father was a POW in Germany and received monthly reparations until he died at nearly 103. Every year he had to send proof to Germany that he was still alive. My Jewish boyfriend's mother who is a survivor, also receives monthly reparations.","en","","18","3"],["1104347446346313728","1103998951227838469","1552131923","Ken Baxter","baxken",false,"ACreativeMuggle jodikantor",false,"Did not know this was done. I'm kinda amazed.","en","","2",""],["1104347896198189056","1103998951227838469","1552132030","Pinky Slivotitz™❄","ACreativeMuggle",false,"baxken jodikantor",false,"Yep. A lot of people aren't aware that Germany still pays out reparations.","en","","1",""],["1104149248315150336","1103998951227838469","1552084669","CJ Foster","CJFoster2",false,"jodikantor AOC",false,"My ancestors never owned slaves, I wont pay a penny, and even If I was an American who's ancestors did, I had no part in it once so ever therefore have absolutely NO obligation to pay or even feel an ounce of guilt. Noone is guilty of crimes they didnt commit.","en","","15",""],["1104270502917533696","1103998951227838469","1552113578","TBI Media Group","TBIMediagroup",false,"CJFoster2 jodikantor AOC",false,"Kinda aggressive chap, so what do you think about your dollars going to the Natives? You had no part in slaughtering them and taking their land but they get billions in reparations courtesy of your tax dollars right? You’ll do whatever this government tells you to do","en","","12",""],["1104215902340476929","1103998951227838469","1552100561","The Safest Space","TheSafestSpace",false,"jodikantor",false,"I'm the grandchild of holocaust survivors but I don't receive reparations. Seems like a more apt analogy","en","","38","4"],["1104270744194822144","1103998951227838469","1552113636","Jeremy Corbinch","Absolutebinch",false,"TheSafestSpace jodikantor",false,"While antisemitism existed before and after the Holocaust (and exists to this day), and while of course the Holocaust was a terrible, evil genocide, slavery was an institution lasting hundreds of years - generations. And we’re talking about America, not Germany.","en","","",""],["1104271918520299520","1103998951227838469","1552113916","Jeremy Corbinch","Absolutebinch",false,"TheSafestSpace jodikantor",false,"African Americans faced brutal violence and discrimination even after slavery was officially abolished. They returned from WWII and were shut out of homeownership by the government, one of the reasons for the huge racial wealth gap. I’m sure you know all this.","en","","",""],["1104109780677918720","1103998951227838469","1552075259","r jameson","rjameson9",false,"jodikantor AOC",false,"Yes and so did my father. Parents not Jewish but were prisoners in work camps in Germany....But we are in America ....","en","","8",""],["1104384522194432000","1103998951227838469","1552140763","FreedomRocks","freedom2debate",false,"rjameson9 jodikantor AOC",false,"And America never made this shit right but they making everything else right protecting everyone else except Black America! They write Bills on Capitol Hill to rid America of Acorn report about housing, ignore Brooksley Born could have saved us& write lying  wonder Narratives","en","","9",""],["1104385525220290561","1103998951227838469","1552141002","r jameson","rjameson9",false,"freedom2debate jodikantor AOC",false,"Yes....and it goes on and on...Acorn MSM hit job..Ask question why was trump allowed voice by MSM to spew his birthism lie re Obama for years when they knew it as lie..","en","","2",""],["1104386774544076800","1103998951227838469","1552141300","FreedomRocks","freedom2debate",false,"rjameson9 jodikantor AOC marclamonthill MHarrisPerry rolandsmartin",false,"Exactly! We not stupid! They writing lying wonder narratives on MSM and folk going along with it! Black so called dignitaries falling in line if they don’t fired @marclamonthill @MHarrisPerry @rolandsmartin  Bombs  sent in the mail due to rhetoric of a POTUS and folk silent","en","/marclamonthill /MHarrisPerry /rolandsmartin","2",""],["1104441836100296704","1103998951227838469","1552154427","r jameson","rjameson9",false,"freedom2debate jodikantor AOC marclamonthill MHarrisPerry rolandsmartin",false,"MSM toes  http://line.in  black lives matter DEBATE. MSM Always dealt in false equivalency with bs argument..why don’t blacks care b on b crime...1/","en","https://t.co/G8bfq3rMw5","",""],["1104140508614422529","1103998951227838469","1552082585","Mike Green","amikegreen2",false,"jodikantor","true","Reparations aren't impossible for the wealthiest nation on earth. What's impossible is for white US to apologize 4 segregationist policies & practices that protect white supremacy & to identify disrupt, dismantle & replace w/equitable infrastructure. https://medium.com/everyvote/why-mlk-would-consider-donald-trump-a-segregationist-b1b43cc015ad …","en","https://t.co/N94UoDJpeH","15","4"],["1104140859870769154","1103998951227838469","1552082669","Drew Browning","rantsfromthesea",false,"amikegreen2 jodikantor",false,"22 trillion in debt is wealthy?","en","","",""],["1104142852106313728","1103998951227838469","1552083144","Mike Green","amikegreen2",false,"rantsfromthesea jodikantor","true","Are you aware that US GDP is $21T? Plus we generate annually $34T in business revenue with 5.6 million businesses (of which 4.5 million are white-owned) with annual payroll of $6T. We're No. 1. China is No. 2. pic.twitter.com/Yfz6JPWMNz","en","https://t.co/Yfz6JPWMNz","2",""],["1104152857274707968","1103998951227838469","1552085529","Drew Browning","rantsfromthesea",false,"amikegreen2 jodikantor",false,"Are you aware that the US government produces  -4.407 trillion dollar a year.","en","","",""],["1104153520083689473","1103998951227838469","1552085688","Mike Green","amikegreen2",false,"rantsfromthesea jodikantor",false,"Please provide your source of info.","en","","2",""],["1104158962507763713","1103998951227838469","1552086985","Drew Browning","rantsfromthesea",false,"amikegreen2 jodikantor",false,"America is wealthy, the government has nothing and can only spend. 4.407 trillion was the proposed budget. Whatever number they ultimately land on is more than they have.","en","","",""],["1104160052951244800","1103998951227838469","1552087245","Mike Green","amikegreen2",false,"rantsfromthesea jodikantor",false,"Yet again, please provide source link.","en","","3",""],["1104162102858694656","1103998951227838469","1552087734","Drew Browning","rantsfromthesea",false,"amikegreen2 jodikantor",false,"Every historical record since 1789.","en","","",""],["1104162432853848064","1103998951227838469","1552087812","Mike Green","amikegreen2",false,"rantsfromthesea jodikantor",false,"Link please.","en","","3",""],["1104165106336890883","1103998951227838469","1552088450","Drew Browning","rantsfromthesea",false,"amikegreen2 jodikantor",false,"You don't know how to use google?  When was the time the government was debt free?  I'll give you a hint Andrew Jackson was president.","en","","",""],["1104165832727322624","1103998951227838469","1552088623","Mike Green","amikegreen2",false,"rantsfromthesea jodikantor","true"," pic.twitter.com/ctFye30VCd","und","https://t.co/ctFye30VCd","2",""],["1104168517237121030","1103998951227838469","1552089263","Drew Browning","rantsfromthesea",false,"amikegreen2 jodikantor","true"," pic.twitter.com/KMvN5F6Bdo","und","https://t.co/KMvN5F6Bdo","",""],["1104170848183738369","1103998951227838469","1552089819","Mike Green","amikegreen2",false,"rantsfromthesea jodikantor","true"," pic.twitter.com/PKooI2A3S5","und","https://t.co/PKooI2A3S5","3","1"],["1104357053043224581","1103998951227838469","1552134214","Douglas Sacks","DouglasSacks",false,"jodikantor",false,"My grandfather from Cologne, Germany got them too. Where there’s a will, there’s a way. Germany was willing to be honest with itself. America isn’t ready to confront its original sin. But we should.","en","","13","1"],["1104142833915752448","1103998951227838469","1552083140","Suzie#Q","shiplaplove",false,"jodikantor",false,"Well, let's see. Hitler was recent history. 70 years. There are still Germans like your grandmother who were personally impacted. Will her grandchildren continue to receive the $$ after she's gone? \n\nSlavery was over 160 years ago. No one alive today experienced it.\n\nGet over it!","en","","6","4"],["1104245639133777922","1103998951227838469","1552107650","Rules of Whiteness","Blachelor",false,"jodikantor",false,"#Reparations is more than just slavery 1.0 it's redlining, Jim Crow apartheid, Black Wallstreets bombing, land theft, discrimination , mass incarceration etc. Show me somebody against #Reparations today & I'll show you somebody who'll been against it for the ex-slaves.","en","/hashtag/Reparations?src=hash /hashtag/Reparations?src=hash","8","2"],["1104090824504037376","1103998951227838469","1552070740","Kevin Sells","GrumpyOldShaman",false,"jodikantor wsscherk",false,"Problem is... America wasn’t beaten to a pulp and forced to pay for its sins. America will never willingly confess that sin. It’s national psyche couldn’t stand it. It’d tear itself apart.","en","","74","4"],["1104120238583545858","1103998951227838469","1552077753","chick-o-Stick","stick_chick",false,"GrumpyOldShaman jodikantor wsscherk",false,"Lol as a Native American I understand the crimes of America but this is just lazy people with their hand out and it is BS.  A good Native American Quote for you “men who live in the past or the future cannot live in the present.”","en","","6",""],["1104123858506973185","1103998951227838469","1552078616","Wiggins to boston","tdreamer___",false,"stick_chick GrumpyOldShaman jodikantor wsscherk",false,"Yeah people forced to give away their land and then systematically oppressed and the people who were forced into slaves md systematically oppressed are just “lazy” yeah man sure","en","","5",""],["1104126157518196741","1103998951227838469","1552079164","Jean Carapuce","JCarapuce",false,"stick_chick GrumpyOldShaman jodikantor wsscherk",false,"Time to move on. Forgive and forget.\nTrying to make your own the suffering of people you never even knew, just for your personal monetary gain...\nHonestly I think it's disgusting","en","","",""],["1104128935527366656","1103998951227838469","1552079826","Wiggins to boston","tdreamer___",false,"JCarapuce stick_chick GrumpyOldShaman jodikantor wsscherk",false,"It’s easy to say this and be part of a race whom never faced legal discrimination and to paint people who’ve dealt with that as greedy is said and shows what kind of person you are","en","","2",""],["1104130078101905408","1103998951227838469","1552080099","Jean Carapuce","JCarapuce",false,"stick_chick GrumpyOldShaman jodikantor wsscherk",false,"Hey buddy, I'm not a racist, I don't see myself as \"part of a race\" \nBoth you and me are humans, equally are we not ?\nHave YOU ever faced legal discrimination ?\nMove on and think about your own life and future, don't hold grudges on people for things they're not responsible for","en","","",""],["1104131850010800128","1103998951227838469","1552080521","Wiggins to boston","tdreamer___",false,"JCarapuce stick_chick GrumpyOldShaman jodikantor wsscherk",false,"You don’t get a reward for being “color blind” and ignoring then trails of each race,it’s actually a lazy mindset","en","","1",""],["1104043694779449344","1103998951227838469","1552059503","dquinn","dq1959uinn",false,"jodikantor mikiebarb",false,"Did you get a check?","en","","4",""],["1104145054548017154","1103998951227838469","1552083669","Brandy #CorruptUnethicalNotOkay","votecumby",false,"dq1959uinn jodikantor mikiebarb",false,"One won’t have to pay descendants raparations if restitution has already been made; the damage would have been mitigated/not passed on. And reparations have compounding interest - if you don’t address them until it’s the great great grandchild, you have more damage to mitigate.","en","","6","1"],["1104064188798840832","1103998951227838469","1552064389","Laurie Goldberg","LaurieGoldberg",false,"jodikantor",false,"Fascinating. Had no idea that was done.","en","","15","1"],["1104131051885158400","1103998951227838469","1552080331","Robert Rask","robert_rask",false,"LaurieGoldberg jodikantor",false,"Are u joking?","en","","1",""],["1104086206382510080","1103998951227838469","1552069639","Just Josh","Jmann500",false,"jodikantor Iron_Spike",false,"Tax breaks and low interest busness loans... \ndid I just figure out reparations?","en","","5","1"],["1104104879537246210","1103998951227838469","1552074091","Наталья Паршина","smartalek180",false,"Jmann500 jodikantor Iron_Spike",false,"That sounds entirely plausible to me...\nin part.\nI'd like to see education & old-age pension elements, too.\nStipulation:  only those whose ancestry can demonstrate a connection to enslaved ppl.\nBut w/the record-keeping of the day, that might be an insurmountable problem for many.","en","","1","1"],["1104168676553416704","1103998951227838469","1552089301","Carlata","BoboSonata",false,"smartalek180 Jmann500 jodikantor Iron_Spike",false,"Oh just make it anybody who looks like they might be descended from enslaved people. We discriminate against them on that basis every day. Seems fair.","en","","1",""],["1104112786131558400","1103998951227838469","1552075976","Lincoln Karuhanga","sheer_aesthete",false,"jodikantor",false,"Part of me feels like this would just strengthen racist ideologies and/ or feelings.\nWhy can't we focus on something more progressive leaning, like pushing  policies that'll create equal opportunity, without necessarily having  reparations.","en","","12",""],["1104120640834060288","1103998951227838469","1552077849","bay-gull","bay_gull91",false,"sheer_aesthete jodikantor",false,"Because the best and easiest way to start to undo the generational poverty caused by slavery and Jim crow is giving money to the people those institutions robbed, i.e. black people. That's the point of reparations.","en","","5",""],["1104129483102212097","1103998951227838469","1552079957","Silent Storm🇺🇲","SamBassUSAF",false,"bay_gull91 sheer_aesthete jodikantor",false,"So when do I get paid.","en","","",""],["1104134769686835201","1103998951227838469","1552081217","Andylove","Andylov123",false,"jodikantor",false,"Reparations should be that all African American people receive free college, to any college of their choice, for as long as they wish to go. And second, don’t have to pay any taxes for 400 years.","en","","18","1"],["1104383710110068737","1103998951227838469","1552140569","Joel","Happyja",false,"Andylov123 jodikantor",false,"FYI, if they are poor, most of their college is already paid for.","en","","",""],["1104431581295390720","1103998951227838469","1552151982","Americana Jones 🇺🇸","LilMsSunshynn",false,"Happyja Andylov123 jodikantor",false,"That’s a lie","en","","",""],["1104143483168788487","1103998951227838469","1552083295","Jess Allen","THEJessAllen",false,"jodikantor fiona_horrigan andrewyangvfa",false,"and the reason why @AndrewYangVFA is calling for #BasicIncome for every adult citizen 18+ called the #FreedomDividend \n\nas jobs are automated away - how much will $1K per month help people - A LOT\n\nit instantly brings every adult citizen out of poverty year 1\n\n#Yang2020 #YangGang","en","/andrewyangvfa /hashtag/BasicIncome?src=hash /hashtag/FreedomDividend?src=hash /hashtag/Yang2020?src=hash /hashtag/YangGang?src=hash","7",""],["1104220094215860224","1103998951227838469","1552101560","Alex Meeker","AmeekerCoin",false,"THEJessAllen jodikantor fiona_horrigan andrewyangvfa",false,"Is this a joke? A living wage across the country is untenable.  How would you pay for it?  And please don’t say raise taxes on billionaires. What a joke; socialist need the money of billionaires for their economic systems to work and the call billionaires evil. Good luck! ","en","","2",""],["1104221701188059136","1103998951227838469","1552101943","Jess Allen","THEJessAllen",false,"AmeekerCoin jodikantor fiona_horrigan andrewyangvfa",false,"actually the plan is:\n - 10% VAT tax\n - reduce / eliminate welfare programs\n - economic stimulus because all adult citizens will have money to spend\n\nvs. current situation where many rural american cities are dying due to mass job loss due to automation","en","","3",""],["1104323834545606658","1103998951227838469","1552126294","Liberty Prime","LibertyPrime89",false,"THEJessAllen AmeekerCoin jodikantor fiona_horrigan andrewyangvfa",false,"Do you realize what happens to the cost of goods when everyone gets handed a grand per month?","en","","",""],["1104074992680124416","1103998951227838469","1552066965","TY","truthy_ty",false,"jodikantor DinaPomeranz",false,"This is a great point. Isn’t affirmative action a sort of reparation? The problem is many people are more afraid of the slippery slope than the status quo. Something about the devil you know ... But Americans have to know: hiding from your worst fears doesn’t make them go away.","en","","3",""],["1104077894144294912","1103998951227838469","1552067657","Sara Bellum","trillionIsland",false,"truthy_ty",false,"Although it was intended to be an initiative for descendants of slavery of slavery, today the main beneficiaries of AA are white women, so I’d say no. It needs to be re-evaluated.","en","","6",""],["1104080105897381890","1103998951227838469","1552068184","TY","truthy_ty",false,"trillionIsland",false,"Really? I’ll have to read up on that... sounds kinda crazy.","en","","1",""],["1104093662093475840","1103998951227838469","1552071416","Craig","CravenRave",false,"truthy_ty trillionIsland",false,"It’s literally in every piece of research on affirmative action...","en","","5",""],["1104109313247854592","1103998951227838469","1552075148","TY","truthy_ty",false,"CravenRave trillionIsland",false,"So ... what you’re saying is that laws meant to correct past injustices don’t work? ...Because what you actually need to have a decent society are morally inclined people and not “laws”?  So we’re fucked either way? But you’ll take a check anyway tyvm.puh leeze brutha, spare me","en","","",""],["1104110439900815361","1103998951227838469","1552075416","Craig","CravenRave",false,"truthy_ty trillionIsland",false,"That’s not what I said and comes across as a strawman.","en","","",""],["1104043348472541189","1103998951227838469","1552059421","Michael Schlitzer","campagfan",false,"jodikantor NPRinskeep",false,"Germany recently finished paying reparations for WWI. \n\nIt's a real thing.","en","","10","2"],["1104114913847529472","1103998951227838469","1552076483","Ze311","deplorabl3_me",false,"campagfan jodikantor NPRinskeep",false,"Lol it was also a major reason that Hitler rose up and WWII happened  but ok","en","","",""],["1104107832973164545","1103998951227838469","1552074795","☭ Sir, I am freaking walking here, sir.  ☭","tr1ckykid",false,"jodikantor AOC",false,"Living in the South as a lower middle class white man, all one has to do is look around to see it's WAY overdue.","en","","29",""],["1104142984700923904","1103998951227838469","1552083176","Their nonnie ⭐️⭐️⭐️","ceastwoo",false,"tr1ckykid jodikantor AOC",false,"Difference is your grandma is still alive, and was held captive in a 6 million Jew purge. Reparations for slavery when no one who was a slave is still alive, by definition should not happen...","en","","",""],["1104120879070498816","1103998951227838469","1552077905","Ruth E. Griffin","ruthegrif",false,"jodikantor",false,"I think the arguments in the comments are telling. We will always find a reason to not do something we don’t want to do or don’t think should be done. If we thought, we need to do this if only to atone for the sins of the past, then we would find a way to do it.","en","","12","1"],["1104139188130205701","1103998951227838469","1552082271","Piper75","DePiper75",false,"ruthegrif jodikantor",false,"Or maybe some think the idea of paying for something that happened to their ancestors 160+yrs ago is probably not the right move.  I have no idea what life was like in 1850. My family wasn’t even here (Ireland / Italy). In fact we were enslaved by the English. I want my ££££ !!!","en","","",""],["1104110988440338434","1103998951227838469","1552075547","Tyrrany Dj","TyrranyD",false,"jodikantor AOC",false,"She was actually alive when it happened. It directly effected her. No one today was alive when this happened. Why should my tax dollars pay money to someone for nothing? My family wasn't even in this country until ww1. Why should I have to pay repary to someone else?","en","","7",""],["1104115806332284928","1103998951227838469","1552076696","LiferLawyer","satiatekate",false,"TyrranyD jodikantor AOC",false,"Your family chose to immigrate to this country and become citizens knowing full well that reparations had never been made to citizens with much deeper roots here.  Your family chose to join this country, and with that choice comes the good and the bad.","en","","",""],["1104116920322732032","1103998951227838469","1552076961","Theo Greene","theo_greene",false,"satiatekate TyrranyD jodikantor AOC",false,"Yes, you're right. They knew full well and it was part of their education in the country they were fleeing from... God don't be stupid.","en","","1",""],["1104117505084268544","1103998951227838469","1552077101","Tyrrany Dj","TyrranyD",false,"theo_greene satiatekate jodikantor AOC",false,"Why not make those African nations whose people captured their own and sold them into slavery pay the reparations? They were the original cause right?","en","","1",""],["1104118739367157760","1103998951227838469","1552077395","Theo Greene","theo_greene",false,"TyrranyD satiatekate jodikantor AOC",false,"In their defense.. they didn't have firearms.. but the whole idea of paying generations later is ridiculous. by this logic, Iraq and Egypt have to start paying the jewish people.. and on and on... somethin for nothin is everybodys plan","en","","2",""],["1104119237340262405","1103998951227838469","1552077514","Tyrrany Dj","TyrranyD",false,"theo_greene satiatekate jodikantor AOC",false,"By this logic everyone owes everyone something for nothing. Stop giving people money for nothing. Make them earn it just like everyone else.","en","","1",""],["1104267500643123201","1103998951227838469","1552112863","PassMeAPickle","CeeLeeMusic",false,"jodikantor",false,"My Holocaust survivor family members received reparations too. Totally made a difference: financially, emotionally, symbolically. After the horror of Hitler, Germany did the right thing. We need to do the right thing here, if we are to be everything we proclaim ourselves to be.","en","","3","2"],["1104241628343136257","1103998951227838469","1552106694","🧚🏾‍♀️Ava🧚🏾‍♀️","LetsTalk59",false,"jodikantor",false,"The slave, the slave owner, & the descendants of both have all been impacted by ’s greatest sin. Until this country truly understands & embraces that as a shared problem & not just a black problem; we’ll cont being divided & one group will cont. to feel superior over the other","en","","4","2"],["1110787854123188225","1103998951227838469","1553667436","Simone Moore","Moore_Simone",false,"jodikantor brentroske marwilliamson","true","@marwilliamson has reparations in her Prez platform. She’s been talking about reparations since 1997 in her book Healing the Soul of America. Please donate at least $1 so she can be at the debates in June. She needs 65K unique contributions. #Marianne2020 http://marianne2020.com/issues/racial-reconciliation-and-healing …","en","/marwilliamson /hashtag/Marianne2020?src=hash https://t.co/LaqEvReaVl","2","3"],["1104422767028518912","1103998951227838469","1552149881","Miriam Childs","mdchilds",false,"jodikantor NativePalate",false,"Germany looked its past dead in the eye and reckoned with it. America hasn't.","en","","10",""],["1104428756603682816","1103998951227838469","1552151309","john macqueen","Tx_Rider1",false,"mdchilds jodikantor NativePalate",false,"Germany and the corporations who used forced labor was sued by still living people they had forced into labor.. And Germany settled to pay those people for their labor.. $290 a month for life. They didn't face anything, they were sued into it.","en","","3",""],["1104431148254588930","1103998951227838469","1552151879","Miriam Childs","mdchilds",false,"Tx_Rider1 jodikantor NativePalate",false,"Thank you for the clarification. I didn't realize this, but I'm not surprised.","en","","2",""],["1104498181742698496","1103998951227838469","1552167861","The Doubtful Guest","InsideATureen",false,"mdchilds Tx_Rider1 jodikantor NativePalate",false,"Don’t let one schmuck who routinely capes for racists make you retreat from your original position, which was historically accurate.","en","","",""],["1104500104122322949","1103998951227838469","1552168320","john macqueen","Tx_Rider1",false,"InsideATureen mdchilds jodikantor NativePalate",false,"As was my statement.. And those \"reparation\" payments didn't start until 1988.. 43 years after the war ended.  The racist smear is as childish as it is inaccurate.","en","","",""],["1104039937308065792","1103998951227838469","1552058607","Matt Maggio","MaggioMatt",false,"jodikantor liamstack",false,"Germans (those paying) aren't in the same country as most of those receiving the WWII reparations - huge difference.\nAlso, the victims really were victims - not the great-great-grandchildren of actual victims.\nSee why \"reparations\" in U.S. is explosive?","en","","2",""],["1104044062179508225","1103998951227838469","1552059591","Rich","H3i9htM3N",false,"MaggioMatt jodikantor liamstack",false,"You're undermining the economic value of generational wealth. I'm a victim of my 2nd great grandparents lack of ability to pass down wealth. How is it okay for the 2nd great grand children of slave masters to inherit that wealth?","en","","4",""],["1104045227269083139","1103998951227838469","1552059869","Heather on the Hill","jitterbug212",false,"H3i9htM3N MaggioMatt jodikantor liamstack",false,"AND of the difficulty for your grandparents and parents of getting credit. \nThe reasons for reparations keep compounding even as the original debts go unpaid.","en","","4",""],["1104045846809714688","1103998951227838469","1552060016","Rich","H3i9htM3N",false,"jitterbug212 MaggioMatt jodikantor liamstack",false,"Seems like some people need to believe US been fair and equal economically after slavery. Denying reparations now is just an extension of the denials that have gone on since slavery was abolished. Reparations isn't a new idea. And neither is the opposition, that was born in hate.","en","","4",""],["1104046427808911360","1103998951227838469","1552060155","Matt Maggio","MaggioMatt",false,"H3i9htM3N jitterbug212 jodikantor liamstack",false,"Don't expect \"whitey\" to pay reparations for what some subset of whites did long ago - not when a lot of \"whitey\" didn't even have ancestors here during slavery and sure were victims of bigotry like this \"wop.\"","en","","",""],["1104046579349159938","1103998951227838469","1552060191","Rich","H3i9htM3N",false,"MaggioMatt jitterbug212 jodikantor liamstack",false,"Seems like you've got a race issue. Can't help you with that.","en","","3",""],["1104047097345687552","1103998951227838469","1552060314","Matt Maggio","MaggioMatt",false,"H3i9htM3N jitterbug212 jodikantor liamstack",false,"BS.\nWhen some black kid was being called the n-word, I was being called a \"wop\" and a \"dago\" by classmates - though not yet aware what the words meant.\nBlacks hardly only victims of bigotry in America - and all whites hardly descended from slaveowners, either.","en","","",""],["1104047411499094017","1103998951227838469","1552060389","Heather on the Hill","jitterbug212",false,"MaggioMatt H3i9htM3N",false,"Hey, H3i9ht, Im'ma go ahead with mute here. ;)","en","","2",""],["1104386532746674177","1103998951227838469","1552141242","Rosie Russoniello","littlerednj",false,"jodikantor",false,"African Americans were intentionally  left out if the GI Bill after serving in  world war 2. That's an easy place to START","en","","16",""],["1104768750535000064","1103998951227838469","1552232370","Miss Jackson","jlomurray",false,"littlerednj jodikantor",false,"Calling us AA has gone the way of Negro and Coloured","en","","",""],["1104394012675461120","1103998951227838469","1552143025","American","rgram06",false,"jodikantor walkerdl",false,"When people say that reparations are impossible, they really mean that they are impossible for Black People. Please don’t misunderstand the message.","en","","7","1"],["1104426195955920896","1103998951227838469","1552150699","john macqueen","Tx_Rider1",false,"rgram06 jodikantor walkerdl",false,"They aren't impossible, they are immoral.","en","","",""],["1104097284470513664","1103998951227838469","1552072280","NoahChasin","NoahChasin",false,"jodikantor",false,"My grandmother got them from Germany as well. Every month.","en","","17",""],["1104136998862966786","1103998951227838469","1552081749","JasonAU","JasonAU1981",false,"NoahChasin jodikantor",false,"Great argument. Anyone who was ever a slave can also get a check.","en","","",""],["1104150041004933120","1103998951227838469","1552084858","Holly🌻🌹","HollyBlomberg",false,"jodikantor",false,"It’s absolutely astounding that David Brooks wrote this","en","","10",""],["1104399489224372225","1103998951227838469","1552144331","Sheldon Johnson","SheldonJJ87",false,"HollyBlomberg jodikantor",false,"My thoughts exactly. I'm having a surprisingly hard time getting over the fact that he did! I wish I could believe that it's a sign of things to come.","en","","1",""],["1104178278192111622","1103998951227838469","1552091590","Notinmyname","NastyNana16",false,"jodikantor",false,"There is a lot to admire about the way the Germans have handled their Nazi past. America can learn a great deal from them.","en","","6","2"],["1105291261282377730","1103998951227838469","1552356946","Jason Colbert","Bullpee",false,"NastyNana16 jodikantor",false,"America is not the same as nazi Germany. The slave trade was not isolated to the US, and there is no way to draw a direct comparison of the holocaust to slavery.","en","","",""],["1104161110888865792","1103998951227838469","1552087497","askariali","askariali",false,"jodikantor AOC","true","Funny how reparations for the 400-year holocaust of slavery and another 100 years of Jim Crow is always questioned. I guess some people feel it was no big deal since we're often told to get over it. pic.twitter.com/uXxi4YJkxx","en","https://t.co/uXxi4YJkxx","13","2"],["1104274535153455104","1103998951227838469","1552114540","chris milburn","cmilburn586",false,"askariali jodikantor AOC",false,"And what about the slavery that has gone all over the world and still gies on in Africa today? I never owned slaves and you never picked cotton. My ancestors came over here after slavery ended so that doesn't make me responsible to pay reparations through my taxes.","en","","1",""],["1104392413244678145","1103998951227838469","1552142644","askariali","askariali",false,"cmilburn586 jodikantor AOC",false,"We're not talking about all over the world. There is a HUGE debt owed to Black people in THIS country for slavery and Jim Crow that has yet to be paid. You're one of the people I mentioned in the previous tweet.","en","","",""],["1104405777970683905","1103998951227838469","1552145830","chris milburn","cmilburn586",false,"askariali jodikantor AOC",false,"We dont owe there descendants anything. You're talking 6 generations ago. Jim Crow ended 50 years ago. If anyone owes them anything it's the tribes in Africa that sold them into slavery. This is another attempt by Democrats to buy votes.","en","","",""],["1104407085486206976","1103998951227838469","1552146142","askariali","askariali",false,"cmilburn586 jodikantor AOC",false," https://www.huffingtonpost.com/dwayne-wong-omowale/myths-and-misconceptions-_1_b_9637798.html …","und","https://t.co/TJe25b0MgL","",""],["1104849324570234881","1103998951227838469","1552251580","Maxwell Little","MaxHPF",false,"jodikantor",false,"Ask yourself this question: have I called my U.S. Rep. to demand that they co-sponsor and advocate for H.R.40 - Commission to Study and Develop Reparation Proposals for African-Americans Act? \n\nIf your answer is no: get busy. Let’s make history together. #reparations","en","/hashtag/reparations?src=hash","2","2"],["1104179563075170304","1103998951227838469","1552091897","Escaped from LA without Zombies","stucknLAwzmbies",false,"jodikantor",false,"Find me someone who was actually a slave and we will talk.","en","","4","1"],["1104296310809772032","1103998951227838469","1552119731","ShadowMoon","ShadowMoon1984",false,"jodikantor",false,"I know people some middle Eastern people get checks from our government also. I was like huh? How? War/oil. They just don't want negroes to get what we are owed. I'm tired.","en","","3","1"],["1104221289479323650","1103998951227838469","1552101845","Wilde Oscar #RIPHUGODAD #RIPMIAMINATIVE53 #RIPLORI","WildeOscarCat",false,"jodikantor WhiteWino",false,"Union soldiers dying to stop slavery a form of reparations as were civil rights workers dying for black rights.  Affirmative action several generations of reparations.","en","","3","1"],["1104309051909947392","1103998951227838469","1552122769","Mark Willand","MarkWillandTV",false,"jodikantor",false,"Ok — Id agree to cut a check for all survivors of slavery","en","","7",""],["1104128815624843264","1103998951227838469","1552079798","Kim Norviel","Kimmer4444",false,"jodikantor AOC",false,".....I’m laughing because you can’t possibly be serious.","en","","2",""],["1104131399651606528","1103998951227838469","1552080414","((( Kelly P )))","sapir295",false,"Kimmer4444 jodikantor AOC",false,"He said slaves, Until the end of their natural lives. How many you know are still alive ?","en","","6",""],["1104166414506700801","1103998951227838469","1552088762","Kim Norviel","Kimmer4444",false,"sapir295 jodikantor AOC",false,"Doh","und","","1",""],["1104181180490952705","1103998951227838469","1552092282","Lori Anderson","lorianderson444",false,"jodikantor",false,"So what does 4 mules and 40 acres add up to in wealth over the ages at today's current market. Weren't black people  promised something like this by the government?","en","","3",""],["1104605134804275200","1103998951227838469","1552193361","Lori Anderson","lorianderson444",false,"shh_chan jodikantor",false,"Thank you.","en","","",""],["1104264290880512000","1103998951227838469","1552112097","Ms. Graham Cracker","teligram16",false,"jodikantor DebraMessing",false,"I studied Anne Frank heavily while in high school &I was blessed with being able to visit Dachau &Bergen-Belsen.  Complete life changing experience, walked away never feeling the same. my soul was penetrated from the ground up at each site.ty2urGrandmother in being aTRUE SURVIVOR","en","","",""],["1105303703307907072","1103998951227838469","1552359913","LiberatingBelsenBook","BelsenBook",false,"teligram16 jodikantor DebraMessing","true","Have you seen  http://www.noasylumfilm.com ? #AnneFrank","en","https://t.co/5Y7tCbIqIO /hashtag/AnneFrank?src=hash","2","1"],["1105323567598583808","1103998951227838469","1552364649","Ms. Graham Cracker","teligram16",false,"BelsenBook jodikantor DebraMessing",false,"Ty, I have heard some mixed stories about the letters, but I did not know about this film, nor the book; I have seen the traveling exhibits once in my home-state & the other in Costa Rica while as an exchange student. I will check it out closer, ty again","en","","",""],["1105339014616371202","1103998951227838469","1552368331","LiberatingBelsenBook","BelsenBook",false,"teligram16 jodikantor DebraMessing","true","No Asylum is currently streaming on Amazon and iTunes: http://noasylumfilm.com ","en","https://t.co/C6JGcUq1Ea","","3"],["1104146161483632641","1103998951227838469","1552083933","CJ Foster","CJFoster2",false,"jodikantor AOC",false,"The Democrats calling for reparations are so evil and so damn racist that they want every black American to believe they are victims of the past present and future. They believe blacks are weak and need to be paid and saved. Leftist white saviors!!! Disgust me. So racist and evil","en","","1",""],["1104162913068101632","1103998951227838469","1552087927","askariali","askariali",false,"CJFoster2 jodikantor AOC",false,"Let's not leave out people like yourself who feel the suffering of Black people has no merit for compensation. Do you not understand the state-sanctioned atrocities Black people endured at the hands of the U.S. government for nearly 500 years???","en","","6",""],["1104241753727614976","1103998951227838469","1552106724","TheGrizz","TheGrizzofBU",false,"askariali CJFoster2 jodikantor AOC",false,"So, how long has the U.S. government been around? Hint: it hasn't been 500 years...not even half that.","en","","1",""],["1104395507193982976","1103998951227838469","1552143382","askariali","askariali",false,"TheGrizzofBU CJFoster2 jodikantor AOC","true","Actually, reparations are owed by Portugal, England, France, Spain and all the other nations involved in the Transatlantic slave trade that began in the 15th century. https://www.britannica.com/topic/transatlantic-slave-trade …","en","https://t.co/sJQPQjMu0I","",""],["1104411646674567168","1103998951227838469","1552147230","TheGrizz","TheGrizzofBU",false,"askariali CJFoster2 jodikantor AOC",false,"You do realize African tribesmen captured their enemies during that period and sold them into bondage to whom you identify...there is indeed enough sin of every race to go around back then. There were black slave owners in America. Glad America put an end to it 150 yrs ago.","en","","",""],["1104440356173574144","1103998951227838469","1552154075","askariali","askariali",false,"TheGrizzofBU CJFoster2 jodikantor AOC",false," https://www.huffingtonpost.com/dwayne-wong-omowale/myths-and-misconceptions-_1_b_9637798.html …","und","https://t.co/TJe25b0MgL","1",""],["1104498052386164741","1103998951227838469","1552167830","TheGrizz","TheGrizzofBU",false,"askariali CJFoster2 jodikantor AOC","true"," https://www.washingtonpost.com/news/worldviews/wp/2013/10/17/this-map-shows-where-the-worlds-30-million-slaves-live-there-are-60000-in-the-u-s/?utm_term=.9a65f0e1c3ff …","und","https://t.co/zDBeFuHf7j","",""],["1104640855523147776","1103998951227838469","1552201877","Monica B. D.","Monibdil",false,"TheGrizzofBU askariali CJFoster2 jodikantor AOC",false,"Click on the actual article, even the US is shaded. The article isnt talking about legal,(pervasive, no chance to marry, keep your kids,)people as property slavery as was practiced here.","en","","1",""],["1104151266601652224","1103998951227838469","1552085150","Prince of Stealth🌍⚽️🀄","CoombsDane",false,"jodikantor",false,"That is the best case scenario when your family name, structure, religion and culture have largely been uninterrupted.","en","","5",""],["1104249909497249792","1103998951227838469","1552108669","Rules of Whiteness","Blachelor",false,"jodikantor","true","It's not if #ADOS American Descendants of Slaves deserve reparations for 400 years of economic thefts  but is there the humanity to do so?? https://youtu.be/s3mSCwOIBjU ","en","/hashtag/ADOS?src=hash https://t.co/Yd37DHhQ3D","5",""],["1104131713763024897","1103998951227838469","1552080488","WeRockThePlanet","werocktheplanet",false,"jodikantor AnandWrites BreakingBrown tonetalks",false,"@BreakingBrown @tonetalks #ADOS #Reparations2020 #LineageMatters #ADOSA ","und","/BreakingBrown /tonetalks /hashtag/ADOS?src=hash /hashtag/Reparations2020?src=hash /hashtag/LineageMatters?src=hash /hashtag/ADOSA?src=hash","2","1"],["1104140736604368897","1103998951227838469","1552082640","Russann","SyFyfantabulous",false,"jodikantor",false,"The United States Government does not value its citizens quality of life. Our Government steals from our Social Security that we have earned...the greed and corruption is horrifying! Reparations are never going to happen!! Too irresponsible, no trust at all!!","en","","2","1"],["1104130666680115200","1103998951227838469","1552080239","Victoria Cliett","VictoriaCliett1",false,"jodikantor",false,"If Trump can give 12 billion dollars to farmers, who make up only 3.2 million of the U.S. population (as of 2012), there's money for reparations.","en","","2","1"],["1104534732560314370","1103998951227838469","1552176576","P. Takin Over For The 99 And The 2000 🤘🏿🕊","chillin662",false,"jodikantor",false,"And France along with the United States have went out of their way ensuring their heirs will continue to receive #Reparations but #ADoS are told to \"get over slavery\" despite Reconstruction, Redlining, Peonage, #JimCrow, #MassIncarceration, etc. happened AFTERWARDS #Tangibles2020","en","/hashtag/Reparations?src=hash /hashtag/ADoS?src=hash /hashtag/JimCrow?src=hash /hashtag/MassIncarceration?src=hash /hashtag/Tangibles2020?src=hash","6",""],["1104480839868379136","1103998951227838469","1552163727","Frances Fisher","Frances_Fisher",false,"jodikantor","true","The only candidate with #reparations in her platform: https://www.marianne2020.com/issues/racial-reconciliation-and-healing …","en","/hashtag/reparations?src=hash https://t.co/O47hAYiZ88","2","1"],["1104122878054686721","1103998951227838469","1552078382","TerryHasAnOpinon","Terrysagirl",false,"jodikantor marcushjohnson",false,"That was a finite group of people. We wouldn't be giving reparations to surviving slaves.","en","","6",""],["1104176384262443009","1103998951227838469","1552091139","jenjen","Yankeejen1",false,"jodikantor jodotcom",false,"Why not at least free education? My husband has two degrees due to his Native Heritage.","en","","3","1"],["1107449891972964352","1103998951227838469","1552871604","Anne-Marie O'Connor","theladyingold",false,"Yankeejen1 jodikantor jodotcom",false,"Yes, free education.","en","","",""],["1104128085937524736","1103998951227838469","1552079624","JRW","johnwalles",false,"jodikantor",false,"Jodi, your Grandmother was actually in a death camp. Are you getting her checks after she passes? How would they be calculated & who would the go to? How about Indigenous Americans? How about Irish Americans who came over as indentured servants & 70% died before servitude done?","en","","7",""],["1104136323252801536","1103998951227838469","1552081587","Piper75","DePiper75",false,"johnwalles jodikantor",false,"What about the 1/1024th of me that is decended from Native Americans?  Don’t I get a check for that?  Or do I not benefit from that?","en","","",""],["1104123078437683205","1103998951227838469","1552078430","Greg Richardson","Greg0692",false,"jodikantor",false,"Wow, Ta-Nehisi seems to have gotten a little.... bleached.","en","","2",""],["1104441939066306560","1103998951227838469","1552154452","Greg Richardson","Greg0692",false,"jodikantor",false,"Not in the slightest. I’m very very pro-reparations. I was just acknowledging that a literal genius of color wrote an article by the same title years ago.","en","","2",""],["1104206150776573952","1103998951227838469","1552098236","Michelle Cloutier","MichelleClout",false,"jodikantor AOC",false,"That's because she, personally, experienced the horror of the Holocaust. Find a former slave...","en","","4","1"],["1104289082614693893","1103998951227838469","1552118008","WakeTheGods","seananthony41",false,"MichelleClout jodikantor AOC",false,"Is that what Jesus would say oh “ follower of Christ”?","en","","",""],["1104199459678900224","1103998951227838469","1552096640","Even The Losers","rdon111",false,"jodikantor AOC",false,"If the checks would go to those who were around in those times that would be fine.\nNot to modern day ancestors. \nHow could this be validated?","en","","4",""],["1104287481636233216","1103998951227838469","1552117626","IowaPeg","IowaPeg",false,"rdon111 jodikantor AOC",false,"Because it took 100 years after slavery ended and 200 years after America was founded before  children and grandchildren of those slaves were actually given the same legal rights that white Americans always had-including the right to an equal education, housing and rate of pay.","en","","1",""],["1104434277830328321","1103998951227838469","1552152625","varun reddy mothe","mothevarun",false,"jodikantor",false,"Britain would go bankrupt in few days if it started paying reparations to its former colonial countries","en","","",""],["1107455436364623872","1103998951227838469","1552872926","Anne-Marie O'Connor","theladyingold",false,"mothevarun jodikantor",false,"Britain made a huge payment to the owners of slaves it freed, the biggest reparation in the country’s history. Freed British slaves got nothing.","en","","1","1"],["1107461101334069255","1103998951227838469","1552874276","varun reddy mothe","mothevarun",false,"theladyingold jodikantor","true","This is just in India https://www.google.co.in/amp/s/www.aljazeera.com/amp/indepth/opinion/britain-stole-45-trillion-india-181206124830851.html …","en","https://t.co/xzZljNuAxj","2",""],["1104200247222390784","1103998951227838469","1552096828","james edward holley","jedwardholley",false,"jodikantor",false,"SHE was the survivor. Not the great great great great granddaughter of a victim. It’s wonderful she gets that and she deserves it.","en","","1",""],["1104223098239365120","1103998951227838469","1552102276","satay31 It’s the Hebrew Isralites Fault","satay31",false,"jedwardholley jodikantor",false,"Had those reparations been refused or rescinded (as is the case for African Americans) for a century would they not still be owed? I am confused by this train of thought, if I die owed money does my death absolve the obligation to pay? Are my heirs not expected to collect?","en","","6",""],["1104302963890171904","1103998951227838469","1552121318","Trevor Wilson","trwilson99",false,"satay31 jedwardholley jodikantor",false,"Only for a short time. Your estate cannot collect 150 or even 10 years later.","en","","",""],["1104207391522988032","1103998951227838469","1552098531","Scott4theUSA","scott4the",false,"jodikantor AOC",false,"Do you get reparations for her? Because Nobody in my family ever owned a slave. Reparations should not be for the descendants of people long dead. Its just another demoncrat way to buy votes with tax payers money.","en","","4",""],["1104222207545348096","1103998951227838469","1552102064","satay31 It’s the Hebrew Isralites Fault","satay31",false,"scott4the jodikantor AOC",false,"Many Germans were not Nazi’s either yet they clearly understand their Countries obligation to pay reparations. My Grand Parents never put a Japanese American in a internment camp but they understood the need for the govt to pay reparations.","en","","3",""],["1104290004166168582","1103998951227838469","1552118228","Anthony Greene","TonyGreene05",false,"satay31 scott4the jodikantor AOC",false,"...to the actual survivors.","en","","",""],["1104451446706262016","1103998951227838469","1552156719","satay31 It’s the Hebrew Isralites Fault","satay31",false,"TonyGreene05 scott4the jodikantor AOC",false,"Go away bot.","en","","",""],["1104162563036569600","1103998951227838469","1552087844","Abolistik Productions","abolistik34",false,"jodikantor",false,"That's why ask the Democrats to open up their wallets and pay it forward. For they are the ones who fought abraham and the republic to keep slavery alive. They should be held accountable for it and pay it up!!!","en","","3",""],["1104595826297364482","1103998951227838469","1552191142","Chuck Mathias","ChuckMathias1",false,"abolistik34 jodikantor",false,"I'm sure it's been pointed out to you many, many times that the Dems and the GOP have switched positions since then. And I'm sure many, many times that information has bounced harmlessly off your thick skull.","en","","1","1"],["1104605343072440320","1103998951227838469","1552193411","Abolistik Productions","abolistik34",false,"ChuckMathias1 jodikantor",false,"That's why today's Democratic party supports socialism and communism. Naming themselves Demoratic Socialism. Everything for FREE when you know damn well like they do nothing is truly freely given.","en","","",""],["1104609623229652993","1103998951227838469","1552194431","Abolistik Productions","abolistik34",false,"ChuckMathias1 jodikantor",false,"In which they will be able to control the massive and enslave people with debt as they continue to Tax tax tax everyone but themselves. Politicians do live a lavish life of the tax payers dimes. WE the People work hard and deserve better as a citizen of The United States.","en","","",""],["1104252014702190594","1103998951227838469","1552109170","John Bradshaw","JBLuvsCeltic",false,"jodikantor",false,"I am happy your grandma is receiving checks for her suffering during the war.\n\nWhen she passes, will her children who were not in camps receive checks? Then their children after they pass?\n\nThe US paid a horrific price for the sin of slavery from 1861-65. For me, that was enough.","en","","2",""],["1104313357547515904","1103998951227838469","1552123796","Dödelknödel","SockeLinke",false,"JBLuvsCeltic jodikantor",false,"A horrific price...what would that be?","en","","4",""],["1104328168046018560","1103998951227838469","1552127327","John Coletta","JohnColetta00",false,"SockeLinke JBLuvsCeltic jodikantor",false,"I have no desire to get involved with this topic because IMO, there’s too many morons on Twitter and plus my ‘illiterate tweeting’ most likely gets me in trouble. I’m not sure, but guessing the Civil War fought in this country and the Horrific Price of LIVES lost the cost.","en","","",""],["1104438128100532225","1103998951227838469","1552153543","John Bradshaw","JBLuvsCeltic",false,"JohnColetta00 SockeLinke jodikantor",false,"Yes. There would be no Emancipation Proclamation or 13th Amendment without the death of nearly 400,000 Union soldiers-almost entirely white-from a nation of 22 million.","en","","",""],["1104164896546144256","1103998951227838469","1552088400","Dawn Chase Carmichael","DawnSwann1",false,"jodikantor AOC",false,"You know why she gets it?   Do your research on how they pillaged their homes and stole from them.  And @AOC  stop it now.","en","/AOC","1","1"],["1104390781303967744","1103998951227838469","1552142255","Breesy","summerbrees84",false,"jodikantor AOC",false,"Thank you for making that comparison. Reparations cant begin because the atrocities haven't stopped. Slavery still exists but it's called mass incarceration. We have a school to prison pipeline, cops blacks murder/lynch blacks with impunity, and we can't even talk about it.","en","","1","1"],["1104440241857785856","1103998951227838469","1552154047","trésor","TheRealTresor",false,"jodikantor",false,"The systems needs to COMPENSATE for 400yrs of free textile industry profits!\n\nTHAT'STHECASE","en","","3",""],["1104785629785804800","1103998951227838469","1552236394","🎎🀄️ Progressive Ninja 🤺⚔️","GetLostTho",false,"jodikantor",false,"It would make a huge difference in the racial wealth gap","en","","3",""],["1104131373730840576","1103998951227838469","1552080407","Ryu","tweetlyhowled",false,"jodikantor",false,"In addition to individual payments, Germany also supports the state of Israel with billions of Euros YEARLY.","en","","4",""],["1104144346058760198","1103998951227838469","1552083500","Adam Herbst","adamholden68",false,"tweetlyhowled jodikantor",false,"Germany no longer pays Israel reparations.  This stopped over 50 years ago.","en","","1",""],["1104387455241895936","1103998951227838469","1552141462","Allure","Niello_",false,"adamholden68 tweetlyhowled jodikantor",false,"Jewish people got a whole country plus reparations. \n\nY'all really hate Black people lol","en","","",""],["1104153497413533701","1103998951227838469","1552085682","SeriousB","Bejtash1",false,"jodikantor",false,"Reparations should be supported and Will happen regardless of what the white ruling class’ democrats or republicans say or do. Reparations is only a punishment for the illegitimate colonizer parasite. Reparations are a debt owed. #ReparationsNow","en","/hashtag/ReparationsNow?src=hash","1","1"],["1104132199283126272","1103998951227838469","1552080604","Bartholomew Montgomery","Sire_Doogle",false,"jodikantor AOC",false,"If they start handing out reparations, I'm buying a ton of stock in GM...","en","","4",""],["1104348589659164675","1103998951227838469","1552132196","Bittersweet Be","loricushingbrad",false,"jodikantor MColetteK",false,"We need to make reparations to the families destroyed on our southern border.","en","","1","1"],["1104224567596380161","1103998951227838469","1552102627","Megan McCullen","GLEthnohistory",false,"jodikantor",false,"Wow, I hadn't heard of the german reparations before.  Just read up on it now here:  https://www.jewishvirtuallibrary.org/german-holocaust-reparations … .  It looks like they started in 1988? Thanks for mentioning it and sending me off to learn about it.","en","https://t.co/WirEkBr6I9","3",""],["1104490459349413888","1103998951227838469","1552166020","🌪 𝕎𝕙𝕚𝕣𝕝𝕎𝕚𝕟𝕕 🌪(aka Cj)","JustJenny357",false,"jodikantor AOC",false,"Are the Democrats going to pay reparations? They’re the ones that fought for slavery .. \n\nPick up a book & read some history. \n\nOr google it ","en","","1","1"],["1104287754140041219","1103998951227838469","1552117691","Seid Badawi","SeBa_KL",false,"jodikantor",false,"Slavery ended 154 years ago. It's highly unlikely any slavery victim is around today. Nor are the slave owners. We don't prison children of bank robbers for their parents crimes, there for there is no one to pay, nor punish.","en","","5",""],["1104360134216687621","1103998951227838469","1552134948","Knew—Denali","DenaliKnew",false,"SeBa_KL jodikantor",false,"So..... what about the after affects of slavery, the institutional racism, the targeting of blacks through criminal justice and the inclination to perceive blacks as aggressive, criminal, or deviant? Tamar Rice was said to look like an adult. He was 12. Shouldn’t all Info be 1/2","en","","",""],["1104361953345048577","1103998951227838469","1552135382","Knew—Denali","DenaliKnew",false,"SeBa_KL jodikantor",false,"2/2 considered? So easy to dismiss because it’s a uncomfortable question to answer. Placing others well being in front of your own feels off. Do you think of welfare queens and thugs and drug addicts?  Blacks make up 12.1% of the population yet they are 38% of inmates.","en","","",""],["1104164156624850945","1103998951227838469","1552088223","Musashi Mushin","SinePari318",false,"jodikantor",false,"Both of my Grandparents survived, and are gone now. Not sure if they received any payments or not.\nMy sweetie's parents were both in FDR's internment camps, are gone now - they received reparations.","en","","6",""],["1104382560321355781","1103998951227838469","1552140295","Joel","Happyja",false,"SinePari318 jodikantor",false,"Are you getting payments?","en","","",""],["1104161448446484480","1103998951227838469","1552087578","Natalie Hatcher","Natalie_Hatcher",false,"jodikantor SandyDarity","true","Please visit  http://ados101.com  and read \"Forty Acres and a Mule in the 21st Century\" by Dr. @SandyDarity at Duke Univ.  #ADOShttps://www.researchgate.net/publication/4791140_Forty_Acres_and_a_Mule_in_the_21st_Century …","en","https://t.co/NeDExEzgni /SandyDarity /hashtag/ADOS?src=hash https://t.co/xW3V7FbJ6M","3","2"],["1104430299935580160","1103998951227838469","1552151677","john macqueen","Tx_Rider1",false,"Natalie_Hatcher jodikantor SandyDarity",false,"So what happens after reparations when it doesn't fix any of the problems and only makes things worse? And you then have the majority of the population pretty angry about being hoodwinked?","en","","",""],["1104461560292888576","1103998951227838469","1552159130","Natalie Hatcher","Natalie_Hatcher",false,"Tx_Rider1 jodikantor SandyDarity",false,"Support it and find out... 6 reasons wounds won’t heal. Infection, Poor nutrition, Trauma, Medications, Smoking is one (Selah), & an Inability to Sense pain. It takes more time to heal a wound than to inflict one. America put 400 yrs in, I want 400 or more out.  #SettleIn #ADOS","en","/hashtag/SettleIn?src=hash /hashtag/ADOS?src=hash","",""],["1104496850252562432","1103998951227838469","1552167544","john macqueen","Tx_Rider1",false,"Natalie_Hatcher jodikantor SandyDarity",false,"Well when the U.K. pays me reparation for the treatment of Scots, stolen land, torture and exile.. Making the native tongue illegal, kill on sight for wearing native dress, Clearances etc.  I'll pass it on, until then get in line.","en","","",""],["1104569881821761537","1103998951227838469","1552184956","Natalie Hatcher","Natalie_Hatcher",false,"Tx_Rider1 jodikantor SandyDarity",false," https://twitter.com/MehrsaBaradaran/status/1104562194136616961 …","und","https://t.co/iyP9KclfFI","",""],["1104364576903233543","1103998951227838469","1552136007","Ken","miles_k",false,"jodikantor","true","And yet Universal Basic Income can’t work because it “disincentivizes” ppl ... pic.twitter.com/5uENgAoHXi","en","https://t.co/5uENgAoHXi","1","1"],["1104429771298144264","1103998951227838469","1552151551","john macqueen","Tx_Rider1",false,"miles_k jodikantor","true"," https://www.telegraph.co.uk/news/2018/04/23/finland-ends-universal-basic-income-experiment/ …","und","https://t.co/0Htox0lPA4","",""],["1104457455893807105","1103998951227838469","1552158151","My-Ishia Cason-Brown","Myishiacb",false,"jodikantor",false,"Descendants from enslaved Africans should receive free college education, free housing,  healthcare and a small business grant, to help them rebuild their communities. That’s minimum for terror our ancestors suffered through. Also address reparations for segregation &  Jim Crow.","en","","3",""],["1104823026749718529","1103998951227838469","1552245310","theCleverBulldog","cleverBulldog",false,"Myishiacb jodikantor",false,"The civil war, with its huge loss of life and massive destruction, was the payback. You are entitled to nothing at this point.","en","","",""],["1104144854353817600","1103998951227838469","1552083621","satay31 It’s the Hebrew Isralites Fault","satay31",false,"jodikantor",false,"They mean reparations are impossible for black people, not that they are actually impossible.","en","","4",""],["1104234349287759873","1103998951227838469","1552104959","solomon a copeland","kingsolomega",false,"satay31 jodikantor",false,"No not really. No one said that. It may be impossible.","en","","",""],["1104255746877935616","1103998951227838469","1552110060","Maxwell Little","MaxHPF",false,"jodikantor",false,"Everyone doesn’t seem to have a problem with reparations until it’s #ADOS. But, we coming.","en","/hashtag/ADOS?src=hash","4",""],["1104283906814197760","1103998951227838469","1552116774","David stevens","Hognuts0810",false,"MaxHPF jodikantor",false,"We will pay you in 1865 confederate money","en","","",""],["1104169649783083009","1103998951227838469","1552089533","Sally Duval","SallyDuval",false,"jodikantor",false,"Many minority groups have been shafted by the white man; not just slaves and their direct descendants, but all the other races and women, too. They've all gotten a raw deal since the beginning. Rather than try to pay them off, let's spend our money building a better system.","en","","4",""],["1104215299975458817","1103998951227838469","1552100417","Tommy Smith","Tom_smit_2017",false,"SallyDuval jodikantor",false,"I'm sorry your dad was such a sexist racist....","en","","",""],["1104116192808067072","1103998951227838469","1552076788","Fairly Godly Father","guy_storz",false,"jodikantor AOC",false,"So she was in the holocaust? Not born 150 years later? Got it.","en","","3",""],["1104117341531574272","1103998951227838469","1552077062","H B","HostBrooklyn",false,"guy_storz jodikantor AOC",false,"#victimswillbevictims.","und","/hashtag/victimswillbevictims?src=hash","",""],["1104185471247269889","1103998951227838469","1552093305","Jersey Justice","JerseyJustice1",false,"jodikantor",false,"i never knew about this and I am a dual German/US citizen. My father came here after the war. He learned English on the boat and was made to feel welcome by all here, including Jews.  Reparations, don’t fix injustice, but they help acknowledge it.","en","","3",""],["1104127083683430401","1103998951227838469","1552079385","Robert Paugh 🎧","RobertPaugh",false,"jodikantor AOC",false,"Don’t give @AOC any more ideas. She’s already at 96 trillion in her socialist goals","en","/AOC","3",""],["1104355042889367553","1103998951227838469","1552133734","Mar-a-largearse","maralargeass",false,"RobertPaugh jodikantor AOC",false,"awesome, almost caught up to Frump","en","","",""],["1104366228863365120","1103998951227838469","1552136401","Roderick Cirtwill","RCirtwill",false,"jodikantor AOC",false,"I need reparation checks too! I just know I was harmed by someone somewhere somehow.","en","","3",""],["1104382932280623105","1103998951227838469","1552140384","Joel","Happyja",false,"RCirtwill jodikantor AOC",false,"Or your great, great, great grandmother was.","en","","",""],["1104260804570988544","1103998951227838469","1552111266","George Mokray","gmokery",false,"jodikantor GreatDismal",false,"Always seems to me that\nreparations should start\nwith the tribal peoples \nwho were here on Turtle Island\nbefore either European or\nAfrican people came here.","en","","4",""],["1104387318146916352","1103998951227838469","1552141429","Allure","Niello_",false,"gmokery jodikantor GreatDismal",false,"African people were Brought here. Stop making a false narrative for the African Slave trade. \n\nAfricans were sold as commercial items. \n\nI don't think people would trade themselves. \n\nKeep up.","en","","",""],["1104263299208806400","1103998951227838469","1552111861","Pat LaPoint","PMLaPoint",false,"jodikantor",false,"That’s just never going to happen.  Clearly, we need to find ways to break down the racial divides in this country, whites vs. black and indigenous peoples.  But throwing money via reparations is not the answer.  Which generation of family traced to slavery would you pay?","en","","2",""],["1104209225843122183","1103998951227838469","1552098969","K","kseeu",false,"jodikantor Oprah NewYorker GayleKing nytdavidbrooks nytimes JoyVBehar sunny",false,"2/2 #Reparations only make sense if ex-slaves from1865 are around to qualify. Great idea for 1866 though. Society's healing depends on all of us united via personal healing journeys. Money doesn’t heal pain.\n@Oprah @NewYorker  @GayleKing @nytdavidbrooks @nytimes @JoyVBehar @sunny","en","/hashtag/Reparations?src=hash /Oprah /NewYorker /GayleKing /nytdavidbrooks /nytimes /JoyVBehar /sunny","2",""],["1104445472880685068","1103998951227838469","1552155294","Johannes Malgas","jmalgas",false,"jodikantor",false,"Germany refuses to pay reparations to the Namibians. I’m just saying.","en","","2",""],["1104369611137527808","1103998951227838469","1552137208","Robin Tiberius Kirk","RobinKirk",false,"jodikantor",false,"The argument against can't be, Too long ago! US: Sorry yr house was burned by angry mob & your kids were killed & all of your work tools were stolen. Victim: At least I can get help to start over from scratch. US: Sure! Victim: When? (long silence) US: My bad, new fone, who dis?","en","","2",""],["1104159770511069185","1103998951227838469","1552087178","Sonja McGill","SonjaMc",false,"jodikantor",false,"Inter string","en","","2",""],["1105313631548395520","1103998951227838469","1552362280","Kirk Collingwood","CollingwoodAK",false,"jodikantor",false,"Um... that's the point. Your grandmother gets the check, not her great grandchildren who were afforded every freedom America has to offer.\n#StupidThingsLiberalsSay","en","/hashtag/StupidThingsLiberalsSay?src=hash","2",""],["1104221072445108226","1103998951227838469","1552101793","Bridget ◾️ Redacted","macushla7",false,"jodikantor maramcewin",false,"Gd Bless Her & You","en","","2",""],["1104192695541612544","1103998951227838469","1552095028","fjbpowerspec","bellman_f",false,"jodikantor",false,"Consider the Great Society legislation reparations paid in full.","en","","2",""],["1104263555552079872","1103998951227838469","1552111922","thom anderson","thomanderson1",false,"jodikantor",false,"Reparations generally go to the ones directly harmed, not their descendents.","en","","2",""],["1104398945529286657","1103998951227838469","1552144202","Donny Kees#soulking","donnykees",false,"jodikantor",false,"There’s plenty of Blame to go around! So I won’t Comment except to say: “No matter what Race, etc. etc...ANY AMERICAN; That ever served in the US MILITARY in a War-Time Combat Zone, who is Alive; should never pay a nickel for Taxes. These heroes PAID THEIR DAMN TAXES!","en","","2",""],["1104614033028575233","1103998951227838469","1552195482","Elizabeth Wallace","ElizaWallace27",false,"jodikantor",false,"Fully funding ALL schools would be a great start in the U.S.","en","","2",""],["1104154954313347072","1103998951227838469","1552086029","❌Upyours❌","UPYOURS555",false,"jodikantor",false,"So you are fine with being punitive to people who have never owned a slave to give to those that have never been a slave? Start writing checks then, you won't get it from me.","en","","2",""],["1104499235129565185","1103998951227838469","1552168112","Florida LitiGator","FL_LitiGator",false,"jodikantor",false,"Funding and free tuition to HBCUs is a start.","en","","2",""],["1104428268696956928","1103998951227838469","1552151193","Renee Sears","rsearsavon",false,"jodikantor",false,"Black people are suffering from post traumatic stress and have never been given the tools we need to recover.","en","","2",""],["1104118177061982208","1103998951227838469","1552077261","Diane","SoCalValleyGal",false,"jodikantor",false,"There are no people who were slaves alive now like Holocaust Survivors, so who would you like the reparation to go to?","en","","2",""],["1104368055604441088","1103998951227838469","1552136837","LearntoCode","Hillarysserver",false,"jodikantor",false,"You're making the case for the payments to go to YOU since your ansester was a survivor.  Do not pass go. Do not collect $200","en","","2",""],["1104308638032760832","1103998951227838469","1552122671","ThePartyBarge","ThePartyBarge",false,"jodikantor",false,"Ok so just like Holocaust survivors the gov’t will pay all the people who are still alive that were slaves. Oh wait no one from the 1860’s is still alive?!  Then I guess this is a stupid argument.","en","","2",""],["1104152928166834183","1103998951227838469","1552085546","SeriousB","Bejtash1",false,"jodikantor Behembaba",false,"#WhiteSolidarityWithReparations","und","/hashtag/WhiteSolidarityWithReparations?src=hash","2",""],["1104168376409165830","1103998951227838469","1552089230","ShoreNewsNJ","ShoreNewsNJ",false,"jodikantor",false,"This is great that they do that.  All former slaves living in America should also get reparations.","en","","2",""],["1104141737121988614","1103998951227838469","1552082878","Katya","kokahokey",false,"jodikantor aylajean",false,"Mine too.","en","","2",""],["1104435986677657605","1103998951227838469","1552153033","Sheik Way-El","RealMoor",false,"jodikantor BreakingBrown tonetalks",false,"We need to give thanks to @BreakingBrown and @tonetalks for making this topic not only be in the forefront, but remain at the forefront of \"black\" political issues. Without them, IMO, this tweet is not made, this issue, buried, again...","en","/BreakingBrown /tonetalks","2",""],["1104120579584638988","1103998951227838469","1552077834","Karl Marky Marx 🏳️‍🌈","BossyKarl",false,"jodikantor AOC",false,"Exactly. And I think we should do the same for any living people who were enslaved","en","","2",""],["1104117524076154880","1103998951227838469","1552077105","Daniel Foote","db_foote",false,"jodikantor AOC",false,"And in today’s lesson on logical fallacies, here is a perfect example of a false equivalence. #dumbestshitallweek","en","/hashtag/dumbestshitallweek?src=hash","2",""],["1104243226481836032","1103998951227838469","1552107075","Michael Heister","MichaelHeister",false,"jodikantor Naziscansukit",false,"Big diff between being a direct survivor and some generations later. Bernie’s approach is workable, and doesn’t leave out other groups like First Peoples.","en","","2",""],["1104234288491433984","1103998951227838469","1552104944","Colleen Kirby (⧖)","kirby_cho",false,"jodikantor",false,"How about we start by making sure every legal citizen gets to vote. Especially people of color living in states where there used to be slavery.","en","","4",""],["1104284007146098689","1103998951227838469","1552116798","David stevens","Hognuts0810",false,"kirby_cho jodikantor",false,"They can vote","en","","",""],["1104380509516427264","1103998951227838469","1552139806","Colleen Kirby (⧖)","kirby_cho",false,"Hognuts0810 jodikantor","true","Unfortunately not. https://www.politico.com/story/2019/02/12/georgia-voting-states-elections-1162134 …","en","https://t.co/aRgH5mK2v2","",""],["1104388246778318848","1103998951227838469","1552141651","Todd D.","stwrs1974",false,"jodikantor",false,"Because they were living survivors in the cases mentioned...\nNo one living was an American slave or even the child of an American slave...we're multiple generations removed from it at this point.","en","","2",""],["1107454511617097728","1103998951227838469","1552872705","Anne-Marie O'Connor","theladyingold",false,"stwrs1974 jodikantor",false,"Not really. Jim Crow survivors are still alive. The legacy lives on in a deeply unequal society.","en","","","1"],["1111427143014084609","1103998951227838469","1553819854","Todd D.","stwrs1974",false,"theladyingold jodikantor",false,"Jim Crow laws are not the same as slavery.\nOne was definitely much worse than the other...think about it. Moron.","en","","",""],["1111537816901693441","1103998951227838469","1553846241","Anne-Marie O'Connor","theladyingold",false,"stwrs1974 jodikantor",false,"Okay “future Jedi master.” Calm down now. You’re a little old for juvenile name calling.","en","","",""],["1111538655531810817","1103998951227838469","1553846441","A Wise Yoda Bot","yodaism",false,"theladyingold",false,"Jedi Master?!? Yoda. You seek Yoda.","en","","",""],["1104164742019588097","1103998951227838469","1552088363","Dbrown13","dbrown13",false,"jodikantor AOC",false,"Can you imagine separating people out that have too much white blood to meet the program levels? That’s a comical thought. I mean hilarious.","en","","",""],["1104166283715772416","1103998951227838469","1552088731","Dbrown13","dbrown13",false,"jodikantor AOC",false,"Would my half black nieces and nephews get 20 acres and half a mule? Not kidding, 3 girls and a boy, my sister is their mother. I’m 100% AOC but this is going nowhere.","en","","",""],["1104183339928346624","1103998951227838469","1552092797","Kevin d Robertson","blueCreole",false,"dbrown13 jodikantor AOC",false," http://Ados101.com ","und","https://t.co/f1XiUVBUJV","1",""],["1104189383895322624","1103998951227838469","1552094238","Dbrown13","dbrown13",false,"blueCreole jodikantor AOC",false,"Thanks. But who is Black and who isn’t? My nieces self identity as black although light skinned and half white.","en","","",""],["1104190535294578693","1103998951227838469","1552094513","Kevin d Robertson","blueCreole",false,"dbrown13 jodikantor AOC",false,"It’s not about blackness it about linkage. Are your relatives descendants of American slaves","en","","1",""],["1104193363149012992","1103998951227838469","1552095187","Dbrown13","dbrown13",false,"blueCreole jodikantor AOC",false,"A lot of white folks in the south are coming up more black than they want to admit after a genetic test.","en","","",""],["1104193917447106560","1103998951227838469","1552095319","Kevin d Robertson","blueCreole",false,"dbrown13 jodikantor AOC",false,"Well this is the time to claim it; some would rather die I suppose","en","","1",""],["1104177000514813952","1103998951227838469","1552091286","Sharktung🦈","Sharktung1",false,"jodikantor AOC",false,"How many people alive today are “survivors” of slavery in the US? Exactly none.","en","","2",""],["1104182163434397696","1103998951227838469","1552092517","Kevin d Robertson","blueCreole",false,"Sharktung1 jodikantor AOC",false,"Mmm if you spouse dies would you expect compensation, you should opted out","en","","",""],["1104135449147330560","1103998951227838469","1552081379","Hermit Thrush Ⓜ️","Hermit_Thrush",false,"jodikantor gunsmoslem",false,"Reparations are not going to happen, sorry but it’s not going to happen","en","","2",""],["1104171782091821056","1103998951227838469","1552090042","Mensch","RolfeW",false,"jodikantor",false,"Reparations should be paid. Their lives were taken away from them and the survivors lives have been changed irreparably.","en","","2",""],["1104214212249829376","1103998951227838469","1552100158","Tommy Smith","Tom_smit_2017",false,"RolfeW jodikantor",false,"Social programs are reparations.....","en","","",""],["1104203912314159104","1103998951227838469","1552097702","jholdun","jholdun",false,"jodikantor",false,"will Germany be sending checks to her great-great-grandchildren? yeah i didn’t think so. so what’s your point . And yeah i know all the bullshit liberal rationalizations. Reparations were the trillions spent and wasted on housing projects and affirmative action programs.","en","","2",""],["1104132186045853696","1103998951227838469","1552080601","kgn","K_Nett",false,"jodikantor AOC",false,"People would have to prove that they are a direct descendent of an American slave, and not an immigrant from Africa, Cuba, South America, or anyplace else that was not affected by the American slave trade.","en","","1",""],["1104285628420816896","1103998951227838469","1552117185","David stevens","Hognuts0810",false,"tawdrytaurus K_Nett jodikantor AOC",false,"I want give you dime bumb","en","","",""],["1104142287058153472","1103998951227838469","1552083009","Gary Ark","BingerNumber1",false,"jodikantor AOC",false,"Try to apply for reparation as a granddaughter of a holocaust victim and see how hard Germans will laigh.","en","","4",""],["1104174808605122560","1103998951227838469","1552090763","Ossipee Guy","ossipeeguy",false,"BingerNumber1 jodikantor AOC",false,"You mean German reparations over and above the $845 million to Israel, the $125 million for survivors and the $5 billion for forced labor, right? How does that compare to our reparations for US slavery?","en","","",""],["1104357905208430592","1103998951227838469","1552134417","Gary Ark","BingerNumber1",false,"ossipeeguy jodikantor AOC",false,"You cannot pay reparation to somebody who personally was not directly damaged. Otherwise Jews could still demand reparations from Egypt. Bernie has a solution - pay reparations to communities by investing in them, not to individuals.","en","","",""],["1104359228796485632","1103998951227838469","1552134732","Ossipee Guy","ossipeeguy",false,"BingerNumber1 jodikantor AOC",false,"So your original tweet is moot, since the granddaughter doesn't have standing for reparations, wtf?","en","","",""],["1104364043928850433","1103998951227838469","1552135880","Gary Ark","BingerNumber1",false,"ossipeeguy jodikantor AOC",false,"Depends on what you call reparation. Technically it pay puts to individuals or countries for direct damaged caused by a party. You can stretch the definition and call more investment in communities suffering from consequences of direct actions a reparation.","en","","",""],["1104283715755274242","1103998951227838469","1552116729","Geo Bush:War Criminal","Ontheflipside09",false,"jodikantor",false,"Not much surprises here: but this coming from a reporter and one from the NY Times.  Alrighty now!!! #Reparations","en","/hashtag/Reparations?src=hash","1",""],["1104361930372849664","1103998951227838469","1552135376","Giffens Paradox","GiffensParadox",false,"jodikantor",false,"The issue is 150 years later, the overwhelming mass majority of current US tax payers were not involved or had anything to do with it. Many themselves faced their own persecutions to come here. How will you decide what tax payers pay and who don’t?","en","","1",""],["1104388389841915906","1103998951227838469","1552141685","Jennifer Dewey","JenniferDewey2",false,"jodikantor",false,"Reparations for a woman who survived the holocaust, yes. But reparations for every black who can prove their ancestor was a slave?  I think not. If you go that route, I believe I should also receive reparations since my Irish ancestors were treated like dirt.","en","","1",""],["1104156199317131267","1103998951227838469","1552086326","Deplorable Easter Worshipper","TAGOS22",false,"jodikantor AOC",false,"I agree with Democrats that they should pay  reparations. No laws need to be passed and no one needs to be consulted. DNC just figure out who tyou want to send checks to& set up a gofundme account. I say start by paying black men who get married to their child's MOTHER","en","","1",""],["1104121483901587456","1103998951227838469","1552078050","Fernando G. Ponce","FernandoGPonce1",false,"jodikantor AOC",false,"I like to see her ugly face when it backfires on her. it backfires on her.","en","","1",""],["1104752815837077505","1103998951227838469","1552228571","NavajoChííshWoman","myrahenry24",false,"jodikantor",false,"As a descendant of a Navajo Long Walk survivor, I'm not demanding reparations from Bernie because his policies will protect our water and keep uranium in the ground. That matters more to Natives than a check. Casinos arent reparations and we arent asking for money but real change","en","","1",""],["1104572512682364928","1103998951227838469","1552185583","Sher","outlawbooster",false,"jodikantor",false,"Be glad to give reparations to survivors that were enslaved. Even though my ancestors didn't arrive til 20 years after the end of the bloody civil war that killed thousands for their freedom.","en","","1",""],["1104127713898573826","1103998951227838469","1552079535","Milymouse70","Milymouse70",false,"jodikantor",false,"For my edification, where would we find former slaves still alive today????","en","","1",""],["1104126241886650368","1103998951227838469","1552079184","riz","honky",false,"jodikantor AOC","true"," pic.twitter.com/1oOI82IhLH","und","https://t.co/1oOI82IhLH","1",""],["1104159795274240001","1103998951227838469","1552087184","Sonja McGill","SonjaMc",false,"jodikantor",false,"Interesting","en","","1",""],["1104267323538583553","1103998951227838469","1552112820","Michael Powell","kingston1202",false,"jodikantor",false,"Thank you! Thank you! Even if it is 100% free college upto masters for 100 years at any college as long as the grade qualifies. Let's say Loving vs Virginia began the ending of state sponsored racism so, blacks have had less than 50 years of freedom.","en","","1",""],["1104143179404566528","1103998951227838469","1552083222","Rosesnotguns","ArleneColeman6",false,"jodikantor",false,"My father was a POW slave in Japanese coal mines serving Japanese companies $ for over 3 years. Despite many class action attempts by many suffering years of poor mental and physical health caused by this nightmare-no reparations - oh yeah-forgot POWs are losers....","en","","1",""],["1104626464077438976","1103998951227838469","1552198446","Carolyn O'Connell","CarolynOConnel7",false,"jodikantor AOC",false,"What about reparations to all the Chinese and Japanese slaves from Hawaii that worked on the plantations until the early 1900s? What about the white slaves?","en","","1",""],["1104237140634939392","1103998951227838469","1552105624","Dave1066","Dave10664",false,"jodikantor AOC",false,"Didn't know that thanks for sharing","en","","","1"],["1104910899863801856","1103998951227838469","1552266261","Arascain Wales","ArascainW",false,"jodikantor AOC",false,"Will you also receive benefits after she passes? She was the victim. All the victims of slavery are dead.","en","","1",""],["1104179438005219328","1103998951227838469","1552091867","Bruce Pettengill","bpettengill",false,"jodikantor AOC",false,"There is not a living negro slave nor a living negro slave owner in the U.S. who would get the reparations?","en","","1",""],["1104410097550127104","1103998951227838469","1552146860","Follow the money ... Jane","Jane_the_Deplor",false,"jodikantor AOC",false,"My grandfather was sold at 8 years old from England to Canada in 1910 and we got an apology letter. Stop expecting the #Government to take care of you. It's not the job of taxpayers to support anyone 6 generations after the #Republicans had the courage to save #America. #VoteRed","en","/hashtag/Government?src=hash /hashtag/Republicans?src=hash /hashtag/America?src=hash /hashtag/VoteRed?src=hash","1",""],["1104121496258207745","1103998951227838469","1552078052","Red in NJ","RedKnightNJ",false,"jodikantor AOC","true","The example of holocaust survivors is entirely incongruent to paying reparations to descendants of slaves. Reparations are paid to these aggrieved. Nice try on buying more votes though. \n\nTwit. pic.twitter.com/z5gkg6VNaD","en","https://t.co/z5gkg6VNaD","1",""],["1104145659333169152","1103998951227838469","1552083813","Ally Pains","PainSally",false,"jodikantor",false,"Do only White People pay the Reparation tax? How much of every dollar that a white man earns must he give to a minority? All races have been enslaved throughout history. Who should pay whom?\n\nFYI There is actual slavery occurring as result of our southern border policy right now!","en","","1",""],["1104334687495995394","1103998951227838469","1552128881","Miss Birgit Esaiah","BEsaiah",false,"jodikantor",false,"Wow! Why didn't I know Germany does this? Seems like we only are told stories of doing bad, not good.","en","","1",""],["1104386207868424192","1103998951227838469","1552141165","Abe Woodhull","politiwars",false,"jodikantor MrDanZak",false,"Anyone in America that is still alive that was a slave should get reparations.","en","","1",""],["1104137038117457921","1103998951227838469","1552081758","Renee Rousseau","raye8405",false,"jodikantor LeslieLee327 karenhunter Jamestown502 torinellis AfroStateOfMind TorraineWalker SylviaKAlston TalbertSwan rolandsmartin ministter MidwinCharles SXMUrbanView",false,"@karenhunter @Jamestown502 @torinellis @AfroStateOfMind @TorraineWalker @SylviaKAlston @TalbertSwan @rolandsmartin @ministter @MidwinCharles @SXMUrbanView THIS","en","/karenhunter /Jamestown502 /torinellis /AfroStateOfMind /TorraineWalker /SylviaKAlston /TalbertSwan /rolandsmartin /ministter /MidwinCharles /SXMUrbanView","1",""],["1104118924382228480","1103998951227838469","1552077439","MSM's Easter Worshipper","Salacious_Tweet",false,"jodikantor",false,"A. She was directly impacted by a criminal act.\n\nB. It is impossible to trace and identify all the historical factors, large and small, that could be associated with every single person's particular, varying level of hardship OR success. Literally, an impossible, infinite task.","en","","1",""],["1104504420438601728","1103998951227838469","1552169349","nowisthewinterofoursomethingorother","keithmcm8",false,"jodikantor",false,"not impossible, just very expensive and very hard to administer. has germany promised to keep sending that check to her heirs in perpetuity? do you get a check? does your mother? will your children if there are such people ?","en","","",""],["1104803153403207681","1103998951227838469","1552240572","LtotheBoogie","lologadgetgirl",false,"keithmcm8 jodikantor",false,"it's not just about slavery. black people have been wronged since then via mass incarceration,  Jim Crow school-to-prison etc. Slaves never got their 40 acres & a mule, which would have resulted i transfer of money & property to heirs. That's why descendant's should get it.","en","","2",""],["1104972998539468805","1103998951227838469","1552281066","Jer","izee28",false,"lologadgetgirl keithmcm8 jodikantor",false,"I owe you nothing. You'll get nothing from me. I was not alive and neither we're you. Go earn your own money and quit looking to get paid for someone elses suffering.","en","","",""],["1104119903114706945","1103998951227838469","1552077673","Frank LaSaracina","FrankLasCPA",false,"jodikantor",false,"i'll play along. There are ~ 200k identified, validated, documented holocaust survivors; there are perhaps 48 million blacks in the USA from myriad origins. So in your own words how would #reparations work?","en","/hashtag/reparations?src=hash","1",""],["1104125905801232384","1103998951227838469","1552079104","Abby Rivera Aponte 🇵🇷#Resister","AbbyAponte",false,"jodikantor thepowerofmeow",false,"Reparations matter.","fr","","1",""],["1104223193613520896","1103998951227838469","1552102299","TheRealRd100","Rd100The",false,"jodikantor",false,"If you have reparations then you start with the American Indians who have had over 400 treaties that have been violated. What  happened in America is no different then the apartheid that took place in South Africa.","en","","1",""],["1104147137229717505","1103998951227838469","1552084166","The Mad Draftsman","krobmeh",false,"jodikantor",false,"Ok. Let’s find all the slaves who are still alive then","en","","1",""],["1104138628547166209","1103998951227838469","1552082137","Alan Lunin","AlanLunin",false,"jodikantor",false,"She was the survivor, not a descendant of a survivor.","en","","1",""],["1104392740438040576","1103998951227838469","1552142722","Luis Ogushi","bakerlou",false,"jodikantor",false,"My dad never ever got a dime. Japanese internment (concentration) camps!!","en","","","1"],["1105102934692503552","1103998951227838469","1552312046","Jeff M","JeffM12061105",false,"jodikantor",false,"Blacks have received tens of billions in social services created by a civilization that sacrificed under a brutal religious tradition for thousands of years, let alone another 20,000 winters, to be able to create, they don't disearve anything else.","en","","","1"],["1104767680651972608","1103998951227838469","1552232115","Miss Jackson","jlomurray",false,"jodikantor",false,"Some ppl, most ppl are worried about what to do when #ADOS are no longer the doormats","en","/hashtag/ADOS?src=hash","1",""],["1104243176133419008","1103998951227838469","1552107063","Edward J. Szewczyk","sorin1988",false,"jodikantor",false,"What if it were some future descendant of your grandmother’s, born 150 years after 1945?","en","","1",""],["1104181377229094912","1103998951227838469","1552092329","JustTheObvious","JustTheObvious1",false,"jodikantor",false,"They should have their schools funded, their fathers released, and given what the rest of us always had. A chance.","en","","1",""],["1104129590509883393","1103998951227838469","1552079982","Mitchy McConell","MitchMcConell",false,"jodikantor",false,"The problem is how far back does one go? If a certain people were oppressed in the 19th century, do they file a claim? 18th? 14th? Paleolithic? Any cutoff seems arbitrary. And who establishes the menu of payments for different forms of oppression?","en","","","1"],["1104123277931438080","1103998951227838469","1552078477","cbgard","cbgard1",false,"jodikantor AOC",false,"That is like comparing apples to oranges.","en","","1",""],["1104118021923262464","1103998951227838469","1552077224","Leslie [REDACTED]","Leslieoo7",false,"jodikantor randy10307",false,"I didn't know that Holocaust survivors received reparations. That's good to hear.","en","","1",""],["1104317739659919360","1103998951227838469","1552124841","dre nee","MotownDR",false,"jodikantor",false,"How about we elect a Democrat again, FIRST- and *then* take this fight to them as President? Look around. We don't have the luxury of debating these topics now. It will only be used against us.","en","","1",""],["1104137673839652864","1103998951227838469","1552081909","MandarIN C😎gnito🌌🌅🌊❄⛄🦄","Mandari25733571",false,"jodikantor",false,"Unfortunately, money cannot bring back the loved ones, family, friends and neighbors she lost.  Plus all the horrors she experienced.\nJust finished reading \"We Were The Lucky Ones\".   Horrific and eye-opening.","en","","1",""],["1104365332045668353","1103998951227838469","1552136187","TopKatt","TKatt187",false,"jodikantor",false,"Think of it as a Stimulus","en","","1",""],["1104303275787067392","1103998951227838469","1552121392","B 🏴[Make Libertarian Socialist Again]🏴","therabbleriseup",false,"jodikantor AOC",false,"Also necessary for:\n1. People prosecuted for possessing personal amounts of marijuana\n2. People subjected to severe and irrefutable police brutality\n3. Families destroyed Holocaust-style by Immigration and Customs Enforcement","en","","1",""],["1104784568975065088","1103998951227838469","1552236141","Traveler","TrvlGrtAgn",false,"jodikantor AOC",false,"No wonder why minorities are getting themselves left behind!!!! MOVE ON ALREADY OR YOU WILL CONTINUE TO BE LEFT BEHIND!!!!","en","","1",""],["1104139175308083200","1103998951227838469","1552082267","❤⚪💙","M_A_G_A45",false,"jodikantor AOC",false,"So you're comparing a person who was directly affected by an atrocious time to those 5-7 generations later who have experienced no direct impact? \n\nWhat if none of my ancestors owned slaves? Do I still owe reparations? How would we even know!","en","","1",""],["1104172580561276929","1103998951227838469","1552090232","Ted Davis","tedsthetruth",false,"jodikantor",false,"Really dopey article. The holocaust is recent history. Those receiving reparations are the actual people who survived the camps and are alive today. Slavery is ancient history and reparations would be paid to who? The great great great great grandchildren of slaves? Ridiculous.","en","","1",""],["1104331302730227712","1103998951227838469","1552128074","ryan robbins","ryanrobbins7",false,"jodikantor",false,"“Third, sin is anything that assaults the moral order. Slavery doesn’t merely cause pain and suffering to the slave. It is a corruption that infects the whole society. It is a collective debt that will have to be paid.”","en","","","1"],["1104385127541436417","1103998951227838469","1552140907","Lucy Burton","swirlOsquirrel",false,"jodikantor",false,"This is totally valid, but I’m gonna need to have Trump stop bankrupting us 1st, or there won’t be any money to give anyone, even white folk. I realize it’s a separate issue, but related. First, that racist asshat would never allow this, & 2nd, every minute he stays, we’re poorer","en","","1",""],["1104154479061016582","1103998951227838469","1552085916","SeriousB","Bejtash1",false,"jodikantor",false,"There’s no disconnect in time nor society from the inception of the colonies. People have children and all people understand the concept of inheritance. If that was true, no white children could inherit their families wealth. Reparations are the material debt owed.","en","","7","1"],["1104218094245949440","1103998951227838469","1552101083","Tommy Smith","Tom_smit_2017",false,"Bejtash1 jodikantor",false,"There is obviously a misconception that all white people are rich and receive these huge inheritances.  This is not about material debt, this is about free, free, free.....","en","","",""],["1104219215618326529","1103998951227838469","1552101351","SeriousB","Bejtash1",false,"Tom_smit_2017 jodikantor",false,"Actually, the real misconception is that Reparations has anything to do with “all white people” being “rich”. The poorest white person owes reparations and benefits from white power, privilege, legacy of the slavemaster and colonialism. Reparations are material debt, not handouts","en","","",""],["1104226151210328065","1103998951227838469","1552103004","Tommy Smith","Tom_smit_2017",false,"Bejtash1 jodikantor",false,"But...when the government pays reparations...it will be, in part, from the taxation of poor white and black working families...just like current social programs (which could be considered reparations)...White privilege is a myth the Dems tell minorities to garner votes.","en","","",""],["1104234966513319936","1103998951227838469","1552105106","SeriousB","Bejtash1",false,"Tom_smit_2017 jodikantor",false,"Either way, the money comes from white Americans and the govt.  White privilege is very real and clear as day. In white society white people can live in delusions. White people can deny something that they’re actually doing because white power protects us. Rich and poor.","en","","",""],["1104366361747300353","1103998951227838469","1552136433","Tommy Smith","Tom_smit_2017",false,"Bejtash1 jodikantor",false,"So..black people paying their own reparations will be acceptable? There is not amount of reparations that will appease the victim mentality.  I'm not going to say that I understand, but a lot of people still identify as a slave.  This is 150 later.","en","","",""],["1104408891054587905","1103998951227838469","1552146573","SeriousB","Bejtash1",false,"Tom_smit_2017 jodikantor",false,"There’s no such thing as victim mentality in this context. That is just the typical response from white peoples, conditioned by the white ruling class, to say nonsense in order to make themselves believe it has any validity.","en","","",""],["1104150461500846080","1103998951227838469","1552084958","ross","ross_rlz",false,"jodikantor",false,"In her case, it makes sense because the German government caused the Holocaust and she was imprisoned by the government. And she's still living.","en","","2",""],["1104161111329320960","1103998951227838469","1552087497","Alphin Nicophiliana","Alphinnicophil",false,"ross_rlz jodikantor",false,"And the US government did not enable slavery and atrocities against Indians? In fact West Germany could've made the argument that it is not the legal successor of Nazi Germany which is the argument communist East Germany made when it did not pay reparations.","en","","",""],["1104207690925002752","1103998951227838469","1552098603","ross","ross_rlz",false,"Alphinnicophil jodikantor",false,"I thought the US Government fought a war that ended slavery.","en","","",""],["1104226992310775808","1103998951227838469","1552103205","Alphin Nicophiliana","Alphinnicophil",false,"ross_rlz jodikantor",false,"The US government did but it also permitted a legal regime to exist that allowed slavery to exist until the start of the civil war.","en","","",""],["1104196451276607493","1103998951227838469","1552095923","✨Jessica✨","natureheals616",false,"jodikantor",false,"I believe in reparations!","en","","1",""],["1104232442372804611","1103998951227838469","1552104504","Jennifer Valdez","Jennife66971526",false,"jodikantor",false,"Sure. Be the perpetrator of something you didn't do for someone who didn't experience it.","en","","",""],["1104120111793950720","1103998951227838469","1552077722","Dyjuan Tatro","DyjuanTatro",false,"jodikantor",false,"Thank you for sharing . Stories often move people more than facts.","en","","1",""],["1104133256524562434","1103998951227838469","1552080856","Mich","gopprincess123",false,"DyjuanTatro jodikantor",false,"Her grandmother is alive. There is not one person alive today that was a literal slave in the US.","en","","",""],["1104276919913144320","1103998951227838469","1552115108","Clint Davis","ClintDavis74",false,"jodikantor",false,"The American government made a promise of \"40 acres and a mule.\"  Obviously that's outdated, but our forefathers made a promise, and we should fulfill it.  When you make a promise, you follow through on it.","en","","1",""],["1104285098491432960","1103998951227838469","1552117058","David stevens","Hognuts0810",false,"ClintDavis74 jodikantor",false,"Then give your house to crack gang","en","","",""],["1104531267456970752","1103998951227838469","1552175750","Kissmypug","kissmypug",false,"jodikantor",false,"74 years ago, versus 130 years ago. Second generation vs. 4th generation.  Where is the line drawn on who would get reparations? Basically, taxpayers would just be paying for themselves. If Native Americans don’t get reparations past 1/13th cultural ancestry.....","en","","",""],["1104540459819589633","1103998951227838469","1552177941","Darnell Flowers","fewvsmany",false,"kissmypug jodikantor",false,"So you think slavery and oppression stopped for #ADOS 130 years ago? Have you heard of the KKK, REDLINING, WHITE MOBS or CONVICT LEASING? You can't be serious man!!","en","/hashtag/ADOS?src=hash","1",""],["1104683816914841600","1103998951227838469","1552212120","Noneofyourbusiness","HaleQueen34",false,"jodikantor",false,"The problem with the \"there already dead\" argument is nobody is taking in the consideration of emotional and mental distress that has been passed down, nor the physical trauma from the experimentation that went on in Alabama and such. Just wanted to point that out!","en","","1",""],["1104683927682244609","1103998951227838469","1552212147","Noneofyourbusiness","HaleQueen34",false,"jodikantor",false,"*they're*","en","","",""],["1104440265471918080","1103998951227838469","1552154053","Dave Hall","dp_hall",false,"jodikantor",false,"She received reparations because she lived through it.","en","","1",""],["1104929419834073088","1103998951227838469","1552270676","Melanie Moore","melmoore614",false,"dp_hall jodikantor",false,"The point is we never ever did this. We ended slavery and then made former slaves second class citizens from then until now. Read White Like Me, seriously. It's important to understand why it still matters.","en","","",""],["1104408993663864833","1103998951227838469","1552146597","DaveB","dabaumgarten",false,"jodikantor",false,"My father received a pension from Austria, a country he fled in 1939.  That pension continued until his death.\n\nBut the money went directly to a victim of the Nazi occupation.  I do not feel that Austria or Germany owe me anything.  I'm not a victim.","en","","1",""],["1105134774304292866","1103998951227838469","1552319637","DivergentIntel","DivergentIntel",false,"dabaumgarten jodikantor",false,"Millions of Jim Crow survivors are alive today. Jim Crow lasted until the 1960s","en","","",""],["1104261775338422272","1103998951227838469","1552111498","John Smith","punkR1ght",false,"jodikantor AOC",false,"Should Armenians get reparations from Turks?","en","","1",""],["1104325238995599360","1103998951227838469","1552126629","Liberty Prime","LibertyPrime89",false,"punkR1ght jodikantor AOC",false,"Should the Irish get them from the British for 800 years of occupation and slavery?  Should the Jews get it from the Egyptians?  This is a ridiculous game of course.","en","","",""],["1104484395845472257","1103998951227838469","1552164574","𝒩𝒶𝓃𝒸𝓎 𝒲𝓎𝓁𝓁𝒾𝑒","wyllielass",false,"jodikantor AOC",false,"I’ve come to consider reparations a good idea but it’s monumental undertaking. Just establishing the parameters would be incredibly difficult. Who qualifies? Same $ for all or prorated based on ancestry? How much $ is appropriate? Not saying we shouldn’t try, but it’ll be hard.","en","","1",""],["1104800279386443776","1103998951227838469","1552239887","LtotheBoogie","lologadgetgirl",false,"wyllielass jodikantor AOC",false,"American descendents of slaves should be the ONLY group to receive them.  Ancestry can be traced though census roles  http://ados101.com ","en","https://t.co/zYM7Hjk0tx","",""],["1104432101020090369","1103998951227838469","1552152106","☭ Sid Hatfield ☭","bordigabro",false,"jodikantor",false,"Cash payout reparations for African Americans is a good start but ultimately we need to abolish the commodity form and replace the dictatorship of the bourgeoisie with worker's democracy","en","","1",""],["1104506493741654018","1103998951227838469","1552169843","Lu Bu has come to destroy us!","Max_Fendt",false,"bordigabro jodikantor",false,"Huh?","und","","",""],["1104170367210283008","1103998951227838469","1552089704","John Wilkins","jdub44SB",false,"jodikantor",false,"I think reparations are a good idea. If it's just to check I believe that that may cause more problems than it could help. I think more helpful would be to give free college education to all African Americans and to exempt them from taxes for their entire life.","en","","1",""],["1104183286925021184","1103998951227838469","1552092784","marcus","_the5solas",false,"jdub44SB jodikantor",false,"Would whites of anscestors who fought to end slavery get free college and no taxes as well?  While the next civil war starts from creating an environment where whites living today are unjustly targeted.","en","","",""],["1104121713233707008","1103998951227838469","1552078104","Robert Sterbal","rsterbal",false,"jodikantor",false,"My Mom got restitution for around 4000 survivors of the Nazi death camps from 1963 to 1980. She ran the NYC office for a couple of German lawyers filing the claims of Eastern Europeans.","en","","","1"],["1104384549713297409","1103998951227838469","1552140769","Joel","Happyja",false,"rsterbal jodikantor",false,"Did you get anything, and are your kids getting anything?","en","","",""],["1104655342317662208","1103998951227838469","1552205331","SF Denizen","somadenizen",false,"jodikantor AOC",false,"I think men should get reparations from women for their avoiding military service and how they have been treated in the courts over child custody.... it would be nice to get a check every month.... it would make a huge difference for me.","en","","1",""],["1104927046935953408","1103998951227838469","1552270111","Melanie Moore","melmoore614",false,"somadenizen jodikantor AOC",false,"Or you could just call that one even for all the dead bodies their husbands and boyfriends make out of the wives and girlfriends in their own homes. Do you know anything about the Holocaust or slavery in America? Just maybe not so flippant.","en","","",""],["1105108434859450378","1103998951227838469","1552313357","SF Denizen","somadenizen",false,"melmoore614 jodikantor AOC",false,"Since men commit suicide 4x the time of women, make up 99% of combat deaths, are victims of homicide 4x that of women, dominate 19 of the 20 deadliest jobs in America, and receive 30% longer prison sentences for the same crime... I wouldn't think you would be so flippant about it","en","","",""],["1104130681116848130","1103998951227838469","1552080242","Chris Marquardt","Joaquimoly",false,"jodikantor AOC",false,"Blacks and Natives continue to suffer the effects of crimes against humanity and other injustices in the past, and also discrimination and its consequences today. This is not something that is over; it is still something about US society and culture needing repair.\n#Reparations","en","/hashtag/Reparations?src=hash","",""],["1104137093373194241","1103998951227838469","1552081771","nolan beech","wcvet",false,"Joaquimoly jodikantor AOC",false,"You been to Appalachia lately?","en","","1",""],["1104819048099930113","1103998951227838469","1552244362","Chris Marquardt","Joaquimoly",false,"wcvet jodikantor AOC",false,"Never been. I do hear news stories often of coal companies mistreating workers, opiods being overprescribed and hitting hard, & rural hospitals and clinics closing down. I am sure there are good things, too, but news isn’t about good things. Write a thread about it. I’ll read it.","en","","",""],["1104179636475318272","1103998951227838469","1552091914","Andy Lee Parker","AndyLeeParker1",false,"jodikantor",false,"Know of any gypsy families getting reparations?","en","","",""],["1104182889472843777","1103998951227838469","1552092690","Kevin d Robertson","blueCreole",false,"AndyLeeParker1 jodikantor",false,"“Gypsy” is considered offensive by some Roma people","en","","",""],["1104183461001064448","1103998951227838469","1552092826","Andy Lee Parker","AndyLeeParker1",false,"blueCreole jodikantor",false,"Thanks.  I only know one Roma person and it doesn't offend her, but good to know.","en","","1",""],["1104186757099241473","1103998951227838469","1552093612","Matt","gallifreys_2son",false,"jodikantor",false,"In my honest opinion reparations are a bad idea and far too unclear in execution to be feasible.","en","","",""],["1104223271463972866","1103998951227838469","1552102318","satay31 It’s the Hebrew Isralites Fault","satay31",false,"gallifreys_2son jodikantor",false,"Why a bad idea?","en","","",""],["1104228614034411521","1103998951227838469","1552103591","Matt","gallifreys_2son",false,"satay31 jodikantor",false,"I appreciate the sentiment and intent behind reparations but I have a lot of reasons I'm against it to make things short a top reason would be that throwing money at a problem never solves it, look at the war on poverty for example. Besides no one is guilty of their ancestors'-","en","","1",""]]}