{"origin":["1105591565911773184","","Alexandria Ocasio-Cortez","AOC",false,"This, right here, is a problem.\n\nInstitutions can engage in unlimited financing of fossil fuels, building unstable pipelines + reaping profits, but when the bill comes to clean up oil spills & fix damages - they can conveniently kick the can.\n\nSo, who will pay for climate change? https://twitter.com/cspan/status/1105559308211798020 …","cspan",".@RepAOC @AOC: \"So, hypothetically, if there was a leak from the Dakota Access Pipeline, why shouldn't Wells Fargo pay for the cleanup of it, since it paid for the construction of the pipeline itself?\"\n\n…","43633","11001"],"replies":[["1105593714553094144","1105591565911773184","1552429057","Alexandria Ocasio-Cortez","AOC",false,null,false,"Sea walls will have to go up as seas rise. Wildfires to put out. Roads repaved. Nascent technology to explore. Electrical grids replaced.\n\nIt’s too late for us to not have to deal w/ the impact of climate change. At this point we shouldn’t be debating IF we do it, it’s how.","en","","27461","4514"],["1105608464531894273","1105591565911773184","1552432573","Alexandria Ocasio-Cortez","AOC",true,null,false,"The difference here is that we *already know* abt climate change. \n\nWe know that more fossil fuels will harm us. Banks know. Fossil fuel cos know. Gov + politicians know.\n\nIt’s not an accident. It’s cause+effect. We knew DAPL would leak. And we know the next gen is in danger.","en","","16813","2499"],["1105609305418391552","1105591565911773184","1552432774","QT@Anon 🌟🌟🌟","QTAnon1",false,"AOC",false,"You’re such a beautiful, intelligent, wonderful person. \n\nOh I’m sorry, I thought we were having a lying competition.","en","","86","20"],["1105610634786418689","1105591565911773184","1552433091","👈🇺🇸El Veterano deplorado!🇺🇸","ElDeplorado",false,"QTAnon1 AOC","true"," pic.twitter.com/rbgERj9WXK","und","https://t.co/rbgERj9WXK","7","1"],["1106383208101437440","1105591565911773184","1552617287","Mike Hoysler","1packowner",false,"AOC",false,"So sea walls are ok to keep water out but not a wall to keep illegals out? #BuildTheWall #aocisamoron","en","/hashtag/BuildTheWall?src=hash /hashtag/aocisamoron?src=hash","11","7"],["1105972098718154752","1105591565911773184","1552519270","Old Roy","RoyChancellor",false,"AOC",false,"I heard you was in Austin Texas the other day. Did you ride a horse or a bike to get there?","en","","25",""],["1105998344197857280","1105591565911773184","1552525528","Rosencruz SUMERA","SUMERARosencruz",false,"AOC",false,"No dependable scientific study about climate change.","en","","8","1"],["1105997017120047104","1105591565911773184","1552525211","Jer","Jer96663684",false,"AOC",false,"Now you are blaming climate change on banks. How do you look at yourself in the mirror and actually smile at what you see.  I mean come on. Are you going blame the mother and father of a murderer. Then go after them.  Tell them they should have not have had sex.cause effect right","en","","8","1"],["1105978727845036033","1105591565911773184","1552520851","Ryan Edwards","ryanpedwards",false,"AOC",false,"“If you put the federal government in charge of the Sahara Desert, in 5 years there'd be a shortage of sand.” Milton!  \n\nLess government control = better success","en","","8","3"],["1106241189416714240","1105591565911773184","1552583427","freebird81","freebird815",false,"ryanpedwards AOC",false,"Well stated.\nLet's check with the residents of Love Canal, NY.","en","","",""],["1105885581719027713","1105591565911773184","1552498643","Francene","Francenef14",false,"AOC",false,"You’re the danger to the next gen!","en","","45",""],["1106520003124359170","1105591565911773184","1552649901","Keith Martin","Kdm_ATCwxprof",false,"Francenef14 AOC",false,"You must be looking in the mirror and talking to yourself in the 2nd person. Feeling sorry for your lack of self worth. Hopefully you get a handle and it improves.","en","","",""],["1105975441754648576","1105591565911773184","1552520068","Mandy","Mandy_Tweetie",false,"AOC",false,"@AOC is trying to pin down “who will pay for climate change” since her insane #GND comes with an insane price tag. Sure, let’s make the banks pay for it. That’s where money comes from after all, right? The big, bad banks. Yep, they can “pay for climate change”. Sounds good. ","en","/AOC /hashtag/GND?src=hash","7",""],["1105979125414666241","1105591565911773184","1552520946","Mandy","Mandy_Tweetie",false,"AOC",false,"Also I’ve decided my bartender from 10 yrs ago owes me child support. Not because they are the co-parent of my child, but because they allowed my ex and I to get wasted & hook up, which *they know* can lead to pregnancy, so they’re liable. \n@AOC - Is it sinking in yet?","en","/AOC","4",""],["1105882736315809793","1105591565911773184","1552497965","Chris Prater","pratercc",false,"AOC",false,"The difference here is that climate change is the largest hoax in western history.","en","","11",""],["1105976709667606530","1105591565911773184","1552520370","Zach Ryan","poli_text",false,"AOC",false,"You know what we should we talking about right now: Venezuela \n\nWhat's going on in Venezuela is very serious. The Left needs to stop with climate change and focus on a problem going on right now in the world that needs to be addressed. Socialism is bad and people are dying.","en","","10","3"],["1106562433584291840","1105591565911773184","1552660017","Jane Parsley","PaisleyGina",false,"poli_text AOC",false,"You have no idea, sadly, like so many Americans, wtf socialism even IS. Anyone you know, you or your family, ever use the postal service? How about SS; you or your parents might miss the small stipend they’ve paid into all their lives. And the military NEEDS the VA...","en","","",""],["1106582413440880640","1105591565911773184","1552664781","Zach Ryan","poli_text",false,"PaisleyGina AOC",false,"That isn’t socialism","en","","",""],["1106176167047036928","1105591565911773184","1552567924","Sean McGee","goblue017",false,"AOC",false,"We already know that it’s the biggest fraud perpetrated on the civilized world to date. Antarctica ice cores tell a different story and refute global warming and if banks actually believed it - they wouldn’t loan money as they wouldn’t get a return on their investment","en","","3","1"],["1105926351985537024","1105591565911773184","1552508364","Scott Roberts","Pascualetx",false,"AOC",false,"No you just think you do. No matter how much you say it, doesn't make it a fact. Al Gore said the world would be irreparably damaged by 2016 if we didn't jump through all of his hoops. Oops! Chicken Little much?","en","","5",""],["1105947270229442565","1105591565911773184","1552513351","Jan","Jan11175185",false,"Pascualetx AOC",false,"Could you be more ignorant  ?\nNo wait, You do not need clean water to drink, or clean air to breathe either, do you .because your so smart, you are going to go live on Mars when everything is beyond saving on earth. RIGHT !!","en","","",""],["1106030972280233984","1105591565911773184","1552533307","🇺🇸fighting for AMERICA🇺🇸","ChrisFulgenzi",false,"Jan11175185 Pascualetx AOC",false,"DERP....... \nYou think the human fleas on this planet can stop climate change??\nThis planet can shake us off like the fleas we are!! \nClimate change has been going on for MILLIONS of YEARS...best to get ready for it instead of being BRAINWASHED by @AOC..","en","/AOC","1","1"],["1105951847062343687","1105591565911773184","1552514442","Kevin Levrier","KevinLevrier",false,"AOC",false,"Plain ridiculousness.","en","","7",""],["1106380029385195521","1105591565911773184","1552616529","Mike Rhodes","mikerhodes59",false,"AOC",false,"Climate change is a hoax perpetrated by Al Gore in pursuit of making his millions. He predicted major changes in sea elevation by 2013 and looky here...nothing. The earth changes, with or without us. Chill","en","","4","2"],["1111504712338010112","1105591565911773184","1553838348","Carbon Conversations","CarbonConvoCA",false,"mikerhodes59 AOC USNavy","true","Who is Al Gore?\nIf you want to know about sea level rise, talk to folks in Miami Beach, San Francisco, PEI, or the Marshall Islands. Talk to the @USNavy . https://news.nationalgeographic.com/2017/02/pentagon-fights-climate-change-sea-level-rise-defense-department-military/ …","en","/USNavy https://t.co/WX1Tiw89ng","",""],["1106000800994729985","1105591565911773184","1552526114","SeaRod 🇺🇸🇺🇸🇺🇸","Searod3",false,"AOC","true"," pic.twitter.com/9NswvgNoG3","und","https://t.co/9NswvgNoG3","1","1"],["1105915101788307456","1105591565911773184","1552505681","cathy Rhodes","cathyRh00098842",false,"AOC",false,"The difference here is that many of us know about Agenda 21.","en","","3",""],["1106236715277017089","1105591565911773184","1552582360","Jane Parsley","PaisleyGina",false,"cathyRh00098842 AOC",false,"what is Agenda 21?","en","","",""],["1106264863188213760","1105591565911773184","1552589071","cathy Rhodes","cathyRh00098842",false,"PaisleyGina AOC",false,"Many sources googling it. If you read into it it will explain a lot of the direction these socialists are going in.  It was a summit held in Rio in 1992. Hence the word “ agenda”.  You’ll see much on depopulation and global warming talks.  And why.....  government control.","en","","4",""],["1106254634002329601","1105591565911773184","1552586632","Joe Texian","TexianJoe",false,"AOC",false,"What we know about climate change is that it's the left's latest vehicle for attempting to railroad the United States into becoming a socialist, statist shithole. Besides, pipelines are safer than transporting oil by rail, which is what happens if you don't build pipelines.","en","","1","2"],["1105973067375734784","1105591565911773184","1552519501","Beavis","beavis76",false,"AOC",false,"@AOC you are now the government, which means you benefited from the tax paid on the pipelines that were built.  So We are going to hold you accountable for the spills and environmental disasters. The door swings both ways  ","en","/AOC","5",""],["1106328896365125632","1105591565911773184","1552604338","J.Alberto P. Trevino","Chuchmaister",false,"AOC SenSanders",false,"@AOC your boss @SenSanders has 3 homes, thus his use of the power grid is much greater than those of us with 1 house.  #youfirst","en","/AOC /SenSanders /hashtag/youfirst?src=hash","2","1"],["1105953172630183941","1105591565911773184","1552514758","Dean howard","Deanhow80685489",false,"AOC",false,"ACO is an absolute idiot, she should be kicked out of office just because she is a moreon, why should we put up with her. Long live trump....MAGA!!!!!!","en","","5",""],["1105989123003822082","1105591565911773184","1552523329","America First","teacherfortrump",false,"AOC","true","Hypothetically speaking if there was a leak in the sea wall by the Dakota pipeline shouldn’t Wells Fargo have to pay for the wild fire clean up? Wtf in going on in this woman’s brain?  pic.twitter.com/HNsqc5uv8b","en","https://t.co/HNsqc5uv8b","1","1"],["1105973395571642368","1105591565911773184","1552519580","🧱🧱Swift Justice🧱🧱","mymidnight11",false,"AOC",false,"The next generation is in danger more for a #CivilWar than death by ocean rising. Maybe the is generation...","en","/hashtag/CivilWar?src=hash","3",""],["1105954081141608448","1105591565911773184","1552514975","KingoftheNorth","TestosteroneWar",false,"AOC",false,"Isn’t she back by Soros? Then I know why she attacked the pipeline, cause Soros owns the trains that took the oil out of North Dakota that’s why he hates the pipelines, the real story, by the way I was there for green protest & your people are pigs, you left moreGarbageThenSpill","en","","1",""],["1105960113813245952","1105591565911773184","1552516413","KingoftheNorth","TestosteroneWar",false,"AOC",false,"So that’s one of your evil plans by your boss Soros, he knows the New Green Deal will never fly, so maybe at least if you get the pipeline never to be built, he will make Billions cause the only way will be trains, which you strongly support, the reason for a actress puppet","en","","1",""],["1105960682342756353","1105591565911773184","1552516549","KingoftheNorth","TestosteroneWar",false,"AOC",false,"After reading a ton, I’m surprised no one pointed this out","en","","1",""],["1106228447901376512","1105591565911773184","1552580389","Taylor Billings","TaylorSBillings",false,"AOC","true","@AOC THANK YOU for saying that, I agree completely. What do you think about making the oil, gas, and coal industries that got us into this mess to pay for it too? See here for one take on it. https://thehill.com/blogs/congress-blog/energy-environment/429924-how-to-pay-for-the-green-new-deal-make-the-fossil-fuel …","en","/AOC https://t.co/CPOe2SBl7P","3",""],["1109882947111436290","1105591565911773184","1553451689","Dig It","DigIt78991119",false,"TaylorSBillings AOC",false,"Consumers got themselves into this mess","en","","",""],["1105885428270284800","1105591565911773184","1552498607","John Winston","CBSerf",false,"AOC",false,"So based on their environmental study, Keystone was a risk Wells Fargo was willing to take...easy to say when you deny culpability for any environmental disaster. Funny logic.","en","","3",""],["1106147800952246272","1105591565911773184","1552561161","Todd Smelser","BLKDOGEDIT",false,"CBSerf AOC",false,"Financial risk, not impact risk. Two different things","en","","",""],["1105886248822960129","1105591565911773184","1552498802","Just Jenn","ZoeLightly",false,"AOC",false,"It’s great that you care about the environment and our planet, you have some good ideas, and an engaging personality, but your vision appears to be short-sighted.","en","","3",""],["1106293231824896000","1105591565911773184","1552595835","Inga Zorin❌","IngaZorin111",false,"ZoeLightly AOC",false,"She is full of s..t - and she doesn't care about anything. Big MOUTH, small BRAIN.","en","","1",""],["1107146481654349825","1105591565911773184","1552799265","Just Jenn","ZoeLightly",false,"IngaZorin111 AOC",false,"This is probably not a popular opinion, but I think she actually does care. She has some failed non-profits under her belt and a consistent history in that regard. She does seem to be misguided, however. Influenced by the wrong elements, me thinks.","en","","",""],["1107310286388842497","1105591565911773184","1552838319","Inga Zorin❌","IngaZorin111",false,"ZoeLightly AOC",false,"owns taxes on, pocketed the money, and continued on her agenda of doing nothing. If you listen to what she says - REALLY LISTEN TO IT - and it wouldn't give you chills, you aren't much better than she is. SAD...","en","","1",""],["1107310582703755264","1105591565911773184","1552838390","John s","Johns70845051",false,"IngaZorin111 ZoeLightly AOC",false,"Nigerian Muslim Militants Kill 120 Christians in Three Weeks, Media Silent.....I don't see AOC talking about this!","en","","1",""],["1107679713609351168","1105591565911773184","1552926398","Inga Zorin❌","IngaZorin111",false,"Johns70845051 ZoeLightly AOC",false,"I don't believe she even knows about that - no place in her brain for true information... so full of s..t!","en","","",""],["1107697228401917953","1105591565911773184","1552930573","Just Jenn","ZoeLightly",false,"IngaZorin111 Johns70845051 AOC",false,"I do understand where you’re coming from... but I think you may be giving her credit for a cognitive component that appears to be vacant.","en","","",""],["1107697303886790656","1105591565911773184","1552930591","Just Jenn","ZoeLightly",false,"IngaZorin111 Johns70845051 AOC",false,"Much of her dialog style is reminiscent of that teenager who is learning how to be on her own and thinks her parents are stupid because she already knows everything.","en","","",""],["1107697405422526464","1105591565911773184","1552930616","Just Jenn","ZoeLightly",false,"IngaZorin111 Johns70845051 AOC",false,"When a person allows hubris to drive, they will fail to see the spaces they need to see in order to make better decisions.","en","","",""],["1107697520849772544","1105591565911773184","1552930643","Just Jenn","ZoeLightly",false,"IngaZorin111 Johns70845051 AOC",false,"I think a too-big chunk of her current construct involves a significant need to matter (but not in a selfless way, which is a big problem). That’s the thing I hope will change if she can somehow get back to the roots of sincerity that do appear to exist in her previous life.","en","","",""],["1107697758272577537","1105591565911773184","1552930700","Just Jenn","ZoeLightly",false,"IngaZorin111 Johns70845051 AOC",false,"The odds are not in her favor in that regard, though. Her generation is the most “me” centric than any to date; our social media driven communication ecosystem encourages, cultivates and embraces that kind of behavior.","en","","",""],["1105908611996217344","1105591565911773184","1552504134","Roberta","bertcatlady",false,"AOC",false,"Every time you get in a car or get on an airplane that uses fossil fuels, you are contributing to climate change.\n\nIf you truly cared about climate change, you will stop giving those industries money. \n\n#DoAsISayNotAsIDo","en","/hashtag/DoAsISayNotAsIDo?src=hash","2",""],["1105908392386682880","1105591565911773184","1552504082","Thomas Brown","tjbrowndiver",false,"AOC",false,"Been listening to this same tired BS since before you were born. Did you go to the beach when you were a kid. Go back there, beach and water are still in the same place. US needs a border wall, not sea walls for fictitious rising sea levels.","en","","2",""],["1106083137270878209","1105591565911773184","1552545744","Dan Vaughan","thedanvaughan",false,"AOC",false,"Yes, we know that climate change is a scam to gain control by the gov’t. Glacier formations have increased the past century, insect populations are on the rise, polar bear populations are on the rise, there are more trees on earth than ever before and see levels have not risen.","en","","2",""],["1105946870285766656","1105591565911773184","1552513256","Joe","jbu1252",false,"AOC",false,"Who wrote this for you?","en","","2",""],["1105886685986844672","1105591565911773184","1552498906","J","LibCelebs",false,"AOC",false,"Yes, we do already know about climate change. It has changed since the beginning of time and is not caused by humans. Thousands of experts have agreed to that yet they are silenced by you radical leftists who try to shut down the debate.","en","","2",""],["1106023138272243712","1105591565911773184","1552531439","infowars.com, brighteon.com","controtweet",false,"AOC",false,"Dapl hasn’t leaked, what are you talking about? Global warming is a hoax to drain industry and wealth from western nations and to convince white people not to have children.","en","","1",""],["1106040318397419520","1105591565911773184","1552535535","Scott Coston","AccurateReasons",false,"AOC",false,"From the congresswoman who uses Uber, flies instead of taking trains? \n\nWhat do you know about climate change? What you are told.\n\nIt’s simply *Not solved science, moreover, the worst case is not likely.\n\nNext gen fine! Look at extreme climate predictions. Not accurate by a lot","en","","1",""],["1106272006968770560","1105591565911773184","1552590774","Albert C DeRego","dere_albert",false,"AOC",false,"Hey AOC,forget about climate change,El SHADDAI our CREATOR got this,man will never be able to do what God can.","en","","1",""],["1106046989471408129","1105591565911773184","1552537126","Kelly Taylor","kellytaylor2158",false,"AOC",false,"Your complete ignorance makes my day! Please don't stop! You are the best thing ever for Trump's 2020 campaign, keep the good work!","en","","1",""],["1106040133046939648","1105591565911773184","1552535491","Trapp","Whydothecops",false,"AOC",false,"You need to ask questions that are of real and factual content Sissy. You can't ask hypothetical questions in a hearing like that because they aren't of factual basis. Do you watch the others in the room and their faces when you talk? They don't even know what to say...","en","","1",""],["1105890102402867200","1105591565911773184","1552499721","Press Patrol","PressPatrol",false,"AOC",false,"#AOC how is it possible for one person like yourself to come up with as many dumb comments as you do?","en","/hashtag/AOC?src=hash","1",""],["1106026340741013509","1105591565911773184","1552532203","🇺🇸fighting for AMERICA🇺🇸","ChrisFulgenzi",false,"AOC","true","The planet has been changing climates for MILLIONS of YEARS.\nMONEY CANT STOP THAT.\nand it's funny, you want MONEY to STOP IT! We the PEOPLE are sheep no MORE. you are GREAT at spending other people's MONEY!  Not very good at making SENSE!! \nWWG1WGA pic.twitter.com/MONcLixG8c","en","https://t.co/MONcLixG8c","1",""],["1105926750045962241","1105591565911773184","1552508458","Brian Ball","BallDaballs",false,"AOC",false,"I am not convinced. When I was an adolescent every magazine in the world was filled with articles of the impending doom from the coming ice age. Then Al Gore created the global warming scam and made hundreds of millions fro it. Then it was changed to climat change who profits now","en","","1",""],["1105985495568248832","1105591565911773184","1552522465","Don’t tread on me","michael_meader",false,"AOC",false,"It’s fake!","en","","1",""],["1106011836619452416","1105591565911773184","1552528745","Janet Evelyn✝️📖🇺🇸🤺🍁","JEM_Books",false,"AOC",false," https://twitter.com/JEM_Books/status/1105948466901991424 …","und","https://t.co/Akl9oiRtwn","1",""],["1105989207481294848","1105591565911773184","1552523350","Paula Murphy Haas","pdjmhaas",false,"AOC",false,"Where is the Are You For Real? Button??","en","","1",""],["1106012946147139584","1105591565911773184","1552529009","Janet Evelyn✝️📖🇺🇸🤺🍁","JEM_Books",false,"AOC","true"," https://quillette.com/2019/02/27/why-renewables-cant-save-the-planet/ …","und","https://t.co/QfwsuIDMwk","1",""],["1105997065090408451","1105591565911773184","1552525223","Herrmann8er","Herrmann8er",false,"AOC",false,"AOC, please don't take this as an insult, but you really need to see a mental health professional. Your line of inquiry was an embarrassment.","en","","1",""],["1106016119494795265","1105591565911773184","1552529766","James LeBlanc","JamesLe40607504",false,"AOC","true"," pic.twitter.com/e6JPYckJtI","und","https://t.co/e6JPYckJtI","1",""],["1106012861350866944","1105591565911773184","1552528989","Janet Evelyn✝️📖🇺🇸🤺🍁","JEM_Books",false,"AOC","true","Between 1910 & 1940, the planet warmed during a climatic episode...warming can’t be blamed on industry as CO2 from FF were small. Curry: “almost 1/2 of the warming observed in the 20th c. came about in the first half of the century, before CO2 increased.” https://wattsupwiththat.com/2019/03/04/climate-sciences-myth-buster-its-time-to-be-scientific-about-global-warming-says-climatologist-judith-curry/ …","en","https://t.co/lSlJAcsOln","1",""],["1105912682056691712","1105591565911773184","1552505104","Wynterklaus ⭐⭐⭐","wynterklaus",false,"AOC",false,"We are 15 YEARS into the seas are rising crap.. They are not.","en","","1",""],["1105983161819955200","1105591565911773184","1552521908","CHRISCO","CHRISCO61220816",false,"AOC",false,"Well then, if it is too late to do anything,  set down shut your trap, and watch, you and you alone are scarring others, the world is been here thousands of years and you in 2 month are ending it, get all the facts straight,  then do something, not bitching, actually do something","en","","1",""],["1105900038809681920","1105591565911773184","1552502090","Talley Ferguson","chaingun59",false,"AOC",false,"We also know that you are very stupid. How is it you don't know the 3 branches if government. You know nothing about foreign affairs certainly not the middle east. How much did you spend on the useless education you have. Did I pay for it? You lie about where you grew up. You lie","en","","1",""],["1105898508345847809","1105591565911773184","1552501725","Honey Badger","HoneyBadger10_8",false,"AOC",false,"I’d ask you if you could possibly sound any more stupid than you already do, but I’m afraid you’d take it as a challenge.  #JustShutUpAlready #DumberThanAHoeHandle #AOCProvesAnyoneCanGetElected #GodHelpUsAll #ShoveYourGND","en","/hashtag/JustShutUpAlready?src=hash /hashtag/DumberThanAHoeHandle?src=hash /hashtag/AOCProvesAnyoneCanGetElected?src=hash /hashtag/GodHelpUsAll?src=hash /hashtag/ShoveYourGND?src=hash","1",""],["1105922694292406272","1105591565911773184","1552507492","mick slone","MickSlone",false,"AOC",false,"Lets build a wall around your ArSe we be Hippy kinda happy !!!!","en","","1",""],["1105999595702808577","1105591565911773184","1552525826","James Westberg Sr.","SrWestberg",false,"AOC",false,"Keep talking.  Keep talking.  LMAO!","en","","1",""],["1105903644371808256","1105591565911773184","1552502950","Jason Wood","JasonLoboWood",false,"AOC",false,"This woman is a complete idiot.  It’s kind of cool to listen to her talk because she proves how much more of a dumbass she is with every single comment or question!","en","","1",""],["1105931466775674881","1105591565911773184","1552509583","KDraughn","kdraughn5",false,"AOC","true","You probably didn’t know that Al Gore tried to pull this shit about 25 years ago “EPIC FAIL” Your no Climatologist, it’s just money in your pocket from now on. Bullshit! pic.twitter.com/0twOQ75E6A","en","https://t.co/0twOQ75E6A","1",""],["1105994164901212162","1105591565911773184","1552524531","Billy 🌟🌟🌟🌟","222222267d",false,"AOC",false,"I thought it was farts from cattle that was killing us.","en","","1",""],["1105940059042271232","1105591565911773184","1552511632","Rich G","BeSensibl",false,"AOC",false,"Keep talking.  For the love of God, keep talking...","en","","1",""],["1105901834852597761","1105591565911773184","1552502518","We own the libs","weownthelibs",false,"AOC",false,"I feel like your the kid who gets tricked by the coin in the ear trick.  Only your 29 and should understand how Al Gore tricked the liberals.","en","","1",""],["1105883004193382405","1105591565911773184","1552498029","Dr. Nathan 'Explosion' Stott #brutal","N3S73",false,"AOC",false," https://twitter.com/N3S73/status/1022591955669340160?s=19 …","und","https://t.co/XI6356JlTq","1",""],["1105997485447606273","1105591565911773184","1552525323","TrumpPatriot","Gemynygrl",false,"AOC",false,"So I assume you are planning on cutting the Electricity and gas in that fabulous apt along with walking to NY from DC right? Don’t forget to cut the power and go back to rubbing sticks together.","en","","1",""],["1105887443755114502","1105591565911773184","1552499087","john macqueen","Tx_Rider1",false,"AOC",false,"The difference is that you actually have no idea what you are talking about past the scripted talking points you were handed.. We also know the oil trains/trucks that are the alternative to the pipeline are 10X less safe.","en","","1",""],["1105884776974745600","1105591565911773184","1552498451","virg williams","Vwms63",false,"AOC",false,"The problem is you talk AT people and have no interest in dialogue if it goes against your narrative. People DO NOT know ALL about climate change because there is plenty of science that refutes your hyperbolic doomsday arguments. YOU refuse to acknowledge this.","en","","1",""],["1105961554086895616","1105591565911773184","1552516756","Derek Johnson","johnsonderek454",false,"AOC","true"," pic.twitter.com/yFtFaVa4Fd","und","https://t.co/yFtFaVa4Fd","1",""],["1106052168463732736","1105591565911773184","1552538361","LoriAY","Lori12691637",false,"AOC",false,"little girl makes no sense. hypothetical questions.good grief!","en","","1",""],["1105974088386830336","1105591565911773184","1552519745","Kristina BABIES Lives MATTER","havameow",false,"AOC","true","Cattle farmers should pay for the methane pollution now. pic.twitter.com/ezivIX6b4q","en","https://t.co/ezivIX6b4q","1",""],["1106236401685876736","1105591565911773184","1552582285","Leslie.🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸","malibuleslie",false,"AOC",false,"AOC are you reading all these tweets that people think that you’re just dumb ,arrogant you think you know everything people laugh at you the reason why you have so many followers is because people want to be amused by the things that you say you’re a joke.","en","","1",""],["1106012428523921408","1105591565911773184","1552528886","Janet Evelyn✝️📖🇺🇸🤺🍁","JEM_Books",false,"AOC","true","Real science shows that AGW/GW models (20-23 yr old data) are incorrect. Climate Change is a normal, cyclical event, caused mainly by solar flares. Are you going to hack the sun? \nA carbon tax will do nothing to change the temp. https://www.youtube.com/watch?v=NYoOcaqCzxo …","en","https://t.co/A7yEYAYUTd","1",""],["1105881648103600129","1105591565911773184","1552497705","Muni_Corp_Citizen","MuniCorpCitizen",false,"AOC",false,"“The Obama administration wanted to make it a criminal act to disagree with them — typical leftist attitude. The United Nations Framework Convention on Climate Change (UNFCCC) also banned skeptics.”\nAnti-Global Warming Scientists Are Hoping to be Heard\n https://www.armstrongeconomics.com/international-news/nature/the-anti-climate-change-scientists-are-at-last-being-heard/ …","en","https://t.co/p6LlLk57PM","1",""],["1106006448197255173","1105591565911773184","1552527460","Ernesto Olivares Sr","senorolivares",false,"AOC","true","Make Ocasio Bartend Again. pic.twitter.com/hmyd6VDeVY","en","https://t.co/hmyd6VDeVY","1",""],["1105923048719466497","1105591565911773184","1552507576","Brad Shiller","bshiller3",false,"AOC",false,"Then why didnt you vote for YOUR GND????","en","","1",""],["1105991375823220737","1105591565911773184","1552523866","Occupy SXSW","occupy_sxsw",false,"AOC",false,"This is why it’s important to oppose (imminent?) U.S. military action in support of a coup d’etat in Venezuela. It has the world’s largest remaining oil reserves, which U.S. energy interests want access to. Venezuela is a climate change issue!","en","","",""],["1106241878540894208","1105591565911773184","1552583591","freebird81","freebird815",false,"occupy_sxsw AOC",false,"I'm sure Latin Americans will respond to US Armed forces in their country as liberators...\nSaid no one ever","en","","1",""],["1105886380318588930","1105591565911773184","1552498834","Alexis Garcia","AlexisG73380085",false,"AOC",false,"Yes and at one time scientists thought the world what is flat. You'll have to prove beyond the shadow of a doubt that we can actually do something to change the climate.First of all only the Creator can you control the climate.climate change has been going on since the beginning","en","","1",""],["1105927571315802113","1105591565911773184","1552508654","Alex C Kent","ManOfTommorrow",false,"AlexisG73380085 AOC",false,"human beings are destroying themselves and there's nothing your \"creator\" can do about it","en","","",""],["1105897692784480258","1105591565911773184","1552501531","🇺🇸PEACE LOVES TRUTH🇺🇸","JlPlzlChvz",false,"AOC",false,"DAPL's biggest problem was the SJW's attaching their politics to a community that SJW's didn't care about before and don't care about now. \nSJW's politics = leaches.\nThey use the disadvantage of others to Market their fraudulent politics & look like the savior's of the people","en","","1",""],["1105898238547296263","1105591565911773184","1552501661","🇺🇸PEACE LOVES TRUTH🇺🇸","JlPlzlChvz",false,"AOC DNC","true","In other words. \nSJW's, @AOC, progressives, @DNC are PIG\n\n https://youtu.be/Wc9qJS-GG-c \n\n#BLEXIT #MAGA","en","/AOC /DNC https://t.co/mh6MXbG5FA /hashtag/BLEXIT?src=hash /hashtag/MAGA?src=hash","",""],["1105899162825121793","1105591565911773184","1552501881","🇺🇸PEACE LOVES TRUTH🇺🇸","JlPlzlChvz",false,"AOC DNC","true","Fake wannabes. They want the relevance the hippies had.\nPIG pic.twitter.com/gS0HSi1muY","en","https://t.co/gS0HSi1muY","",""],["1106405172966760453","1105591565911773184","1552622523","BJM Texas","TexasBjm",false,"AOC","true","remember when Al Gore tried this & then he became a multi-millionaire off of this lie & he bought multiple homes & an airplane while making fools out all of those who believed him? if he'd been correct the polar caps would all be gone & we'd be dead now too\n\n#NoOneBelivesYourLies pic.twitter.com/VMWfQRmQmw","en","/hashtag/NoOneBelivesYourLies?src=hash https://t.co/VMWfQRmQmw","",""],["1106408116927823872","1105591565911773184","1552623225","You_R_Kidding_Me","YouRKiddingMe5",false,"AOC",false,"No taxpayer should ever pay for this nonsense.  I know you think you know.  But has it at all occurred to you that some very very wealthy people need this to be a \"thing\" so that they can make money off of it?  Wealthy enough to influence all sorts of \"science\"? Just wondered.","en","","",""],["1105948726974132227","1105591565911773184","1552513698","Anthony Mendoza","SP3281",false,"AOC",false,"Really do you ever stop .???you were created by billionaires ..you sound like a acid freak from the 60's.","en","","",""],["1105886083097788417","1105591565911773184","1552498763","Dave Roth","DaveRot48356907",false,"AOC",false,"You are the stupidest person alive.","en","","",""],["1105949869666115584","1105591565911773184","1552513971","Anthony Mendoza","SP3281",false,"AOC",false,"NEVER SOCIALISM IN MY COUNTRY. .....WE WILL WIN ...THE PATRIOTS IN AMERICA. ..YOU are not for our country you are against it....Your hell bent in destroying our country. .","en","","",""],["1106006697393512448","1105591565911773184","1552527519","Thomas E Wiggins","toiletsnake26",false,"AOC",false,"We also know that you are a lunatic so we need to lock you up.","en","","",""],["1107480148595609600","1105591565911773184","1552878818","Jimmy","jmason500",false,"AOC","true"," pic.twitter.com/J9ZrAHQnPR","und","https://t.co/J9ZrAHQnPR","",""],["1105970652870258695","1105591565911773184","1552518926","Toni Taylor","ToniTaylorAU",false,"AOC",false,"You don't recycle, you don't compost, you use plastic bags and then discard them, you don't use public transportation yet you're preaching to everyone else about \"climate change\"? Seriously? Can you spell h-y-p-o-c-r-i-t-e? #Enough","en","/hashtag/Enough?src=hash","",""],["1105920446552248326","1105591565911773184","1552506956","AB","Brisenstein",false,"AOC",false,"Yes, *we already know* abt the climate change hoax.","en","","",""],["1106029443229863936","1105591565911773184","1552532942","Vicky S","VickyS30097006",false,"AOC",false,"You KNOW Nothing YOUR A LUNATIC","en","","",""],["1106321969308467200","1105591565911773184","1552602686","OKBU","OKnewsbu",false,"AOC",false,"Climate change is a farce, much like your candidacy.  Study history, the world has natural cycles of warming up & cooling down.\n\nYour liberal scientists are feeding you BS, you’re just not smart enough to understand!\n\nCrawl back into your hole & stay there until you grow up.","en","","",""],["1105950435339390982","1105591565911773184","1552514106","William J.","Juggernauzt",false,"AOC",false,"Good thing yall are half right, no let industry and GOP tell you what will actually work.  \n\nGreat news, earth is an Closed System: Open Escape and comet probes prove earth emissions are escaping so some pollution doesn't  precipitate","en","","",""],["1105942625029246977","1105591565911773184","1552512243","John E. Jay","jj4j2",false,"AOC",false,"Imagine being this dumb","en","","",""],["1106292928618643456","1105591565911773184","1552595762","Inga Zorin❌","IngaZorin111",false,"AOC",false,"WE are in danger NOW because uneducated losers like you are now in our government - I hope you will end up in prison for what you've done already and for what you'll do during your two years in Congress. You are a SHAME OF OUR COUNTRY. Shut the hell up!","en","","",""],["1107047461510537216","1105591565911773184","1552775657","DaizyDuck","DaizyDuckz",false,"AOC",false,"are you a Scientist? Mathematician? Economist? Doctor? Magician? Seems like a typical #iknowitall millenials ","en","/hashtag/iknowitall?src=hash","",""],["1106310973877616645","1105591565911773184","1552600065","Henry Porter","HPorter1966",false,"AOC",false,"We know, no such thing.\nHere's what would make your point more compelling. Being accurate.  Having a predictive model that actually worked. So far, after nearly 60 yrs of the sky is falling, no 1 of the dooms day predictions has come true. That's not a miss, that's a scam.","en","","",""],["1105917518315544576","1105591565911773184","1552506257","lee johnson","roseslee69",false,"AOC",false,"You dont know j### s###!  Climate change is a major HOAX!!","en","","",""],["1105987446423146497","1105591565911773184","1552522930","Joe The Ranter","Joetheranter",false,"AOC",false,"You don’t know shit from shineola.","en","","",""],["1107048315747745792","1105591565911773184","1552775861","Joseph Barton","josephjbarton",false,"AOC",false,"Lies","en","","",""],["1107130065412915201","1105591565911773184","1552795351","Karen Dixon","kmedixon",false,"AOC",false,"Your time is ending.\nEnjoy it now.","en","","",""],["1105917787388735489","1105591565911773184","1552506322","Rick Sprowl","RickSneaky",false,"AOC","true","If the next generation is in danger, it’s because of unhinged, frighteningly stupid authoritarian socialists like YOU pic.twitter.com/ZIpCnvmW9g","en","https://t.co/ZIpCnvmW9g","",""],["1105922071610249218","1105591565911773184","1552507343","Phoenix Khos","Phoenixkhos",false,"AOC",false,"How is that the Banks responsibility.  the bank loans a company money, their institutions in place to make sure that company doesn't ruin the environment.  if you don't want DAPL, make the law or put in regulations to prevent it from being made.The bank has nothing to do with it.","en","","",""],["1106006248724533248","1105591565911773184","1552527412","maureen crowley","maureeninct",false,"AOC SenWhitehouse",false,"Manmade climate change paradigm is shown to NOT be accepted scientific fact. There is NO consensus. Follow the money that goes to college campuses and into the pockets of politicians who utter the tiresome phrase, \"Climate Change\". BTW why does @SenWhitehouse ignore you?","en","/SenWhitehouse","",""],["1106119435746713600","1105591565911773184","1552554398","((Troll))","isa26810000",false,"AOC",false,"Haha you d%$b f@%ing b@!ch.  You couldn't leave well enough alone with you're first d%mb tweet.  You had to open you're big fat mouth and double down on your stupidity.\n\nTake the glasses off no one believes you're smart,   you're not fooling anyone.","en","","",""],["1106200419880128512","1105591565911773184","1552573706","Piratesteve5 [Elite]","piratestevefive",false,"AOC",false,"You putting that econ degree to work!! Wth your unsound and insane policies that you try to pass you will bankrupt America... please continue to be inept and please continue to piss people off you won't hold your seat for ever.","en","","",""],["1106293128720453640","1105591565911773184","1552595810","Deplorable Bernie","bsmith8643",false,"AOC",false,"We is a horse turd","en","","",""],["1106502718909284352","1105591565911773184","1552645780","Kenneth Mooney","Kenneth29584900",false,"AOC",false,"You wanna know something most people with a working brain know? That you are full of it, there is no dire consequences involved, and after 50+ years of hearing this lie, it gets pretty old.","en","","",""],["1106119751783378945","1105591565911773184","1552554474","Satellite Mike","michael_stohler",false,"AOC",false,"You speak about things as fact or proven science when the truth is they are not, you make comments on subjects you are ignorant of... How can you expect us to take you seriously?","en","","",""],["1106172956558938112","1105591565911773184","1552567159","beavis","beavis00915906",false,"AOC",false,"We know increasing the population here will also contribute to climate change yet you knowingly support open borders and mass illegal immigration. Lying hypocrite.","en","","",""],["1106554728018833408","1105591565911773184","1552658180","Kevin Bush","PolidioticUSA",false,"AOC","true","Good acting... https://www.youtube.com/watch?v=1h5iv6sECGU …","en","https://t.co/Td6dNkZgAX","",""],["1106306702436110336","1105591565911773184","1552599046","Janet Adams","jadams82756",false,"AOC",false,"Will y'all please stop with the climate change crap? We have no control over the weather. NOTHING we do in our short lifetime could make a difference IN OUR WEATHER. Sure we need to be environmentally conscious, but putting guilt trips on people just to get votes is sooo wrong!","en","","",""],["1106020832961355776","1105591565911773184","1552530890","Brian Mc","dbm46n2",false,"AOC","true","Why then, the more we use fossil fuels the less people die from climate related deaths? \n\nCarbon dioxide Information analysis Center Fossil-Fuel CO2 Emissions Global Annual Time Series (1751 – 2010)\n\nEmergency Events Database EM-DAT pic.twitter.com/KjaWJ2bNZT","en","https://t.co/KjaWJ2bNZT","",""],["1106021043532115969","1105591565911773184","1552530940","Brian Mc","dbm46n2",false,"AOC","true"," pic.twitter.com/S4uD8t1xzz","und","https://t.co/S4uD8t1xzz","",""],["1106262884344987648","1105591565911773184","1552588599","kevin salazar","KevN89",false,"AOC",false,"Climate change is fake and you know it... so is GLOBAL WARMING...\n\nSHOW ME YOUR PROOF... THERE IS NONE.... Go dance on a rooftop and stay away from Politics.... YOU KNOW NOTHING...","en","","",""],["1106626890788294656","1105591565911773184","1552675385","Al Tobin Jr","AlTobinJr",false,"AOC",false,"Did  u KNOW that China  India pollute at a rate MUCH more than the USA..that we have come a long way in four decades?  That just the use of new clean burning gas has dropped our negative env impact by lots?  OIL and GAS has and will seeps to the surface on its own..PRUDHOE BAY?","en","","",""],["1105897029585326080","1105591565911773184","1552501373","James Norrie","jnorrie971",false,"AOC",false,"Hey dummy, the hearing was on Wells Fargo's abuses of banking customers, not on Climate Change. Maybe prepare better next time, and not argue physics in history class","en","","",""],["1106369626043269120","1105591565911773184","1552614048","Roberta Martinez","c0d78ed5c92f419",false,"AOC",false,"If climate change is or isn’t true, we should be good stewards of the planet for the next generation!  If it was an asteroid that caused destruction, death, & change, technology to track & move an asteroid would be a healthy investment!","en","","",""],["1105891783513395201","1105591565911773184","1552500122","Baby Finster","Tortass",false,"AOC",false,"You are one funny dope.  You realize your stupid statements will follow and haunt you for the rest of your life.","en","","",""],["1105942951056805888","1105591565911773184","1552512321","❌ So Help Me God❌","BobWils74345021",false,"AOC",false,"You dont know anything about Climate Change. Thats the problem, you are clueless.","en","","",""],["1106021454842351616","1105591565911773184","1552531038","Jacob Mayer","JacobMa46278607",false,"AOC",false,"Maroon.","tl","","",""],["1105902759864385537","1105591565911773184","1552502739","NatantTemerity ⭐ ⭐ ⭐","Nigel22222",false,"AOC",false,"Oh bullsheit. Everybody knows walls do not work.","en","","",""],["1105948800487772161","1105591565911773184","1552513716","Brian","fly117th",false,"AOC",false,"Climate change has been debunked several times. There is more scientific evidence that the polar ice is actually increasing not decreasing. Stop listening to the idiot Al Gore and go read a book. Just because you spread the lies doesn’t mean it truth.","en","","",""],["1106243735006830592","1105591565911773184","1552584034","Bevfefe","Bev_Graham",false,"AOC",false,"But will it rain tomorrow? ","en","","",""],["1106042916160442368","1105591565911773184","1552536155","lyd","Weltschmerz62",false,"AOC","true"," https://www.realclearpolitics.com/2019/03/13/greenpeace_founding_member_039there_is_no_climate_crisis039_468805.html?utm_source=rcp-today&utm_medium=email&utm_campaign=mailchimp-newsletter …","und","https://t.co/MIqmh6zNJd","",""],["1106019780732030978","1105591565911773184","1552530639","Steve","Steve81068874",false,"AOC",false,"Your an idiot!","en","","",""],["1106353153723809793","1105591565911773184","1552610121","Don Fredrick","Colony14",false,"AOC","true"," pic.twitter.com/QvgU8SIveT","und","https://t.co/QvgU8SIveT","",""],["1106427544570605568","1105591565911773184","1552627857","Mary Jo Pollack","DoItNowGirl",false,"AOC",false,"Please study all the facts, not just the ones that support your positions.  There is very real disagreement in the scientific community regarding the degree of effects of humans CO2 emission on the climate. The statistics very minor.","en","","",""],["1105963701146771456","1105591565911773184","1552517268","Jeremy","grilleyjeremy",false,"AOC",false,"so why fly planes and ride uber?  u know the danger and are continuing to be apart of the problem as u dish out orders for others to obey by.  sounds like u are just as guilty as the banks, gov, & politicians u complain about.","en","","",""],["1106033571360374784","1105591565911773184","1552533927","🇺🇸fighting for AMERICA🇺🇸","ChrisFulgenzi",false,"AOC","true","We're just \n(living in the world as it is)\nLike YOU!! But I don't DEMAND other PEOPLE'S MONEY to prove STUPID POINTS and use information that's been PROVEN FALSE hundreds of TIMES....but you still want OTHER PEOPLE PEOPLE'S MONEY for it right? \nWWG1WGA.. pic.twitter.com/tnOTtyisvu","en","https://t.co/tnOTtyisvu","",""],["1105954535028068353","1105591565911773184","1552515083","CryptoCommando","CryptoCommando2",false,"AOC",false,"The debate is over. Our summers are hotter, winters colder and patterns are destabilising.","en","","",""],["1106147475390431232","1105591565911773184","1552561084","Todd Smelser","BLKDOGEDIT",false,"CryptoCommando2 AOC","true"," https://tinyurl.com/y5g7zszl ","und","https://t.co/tF8riE0Oii","",""],["1105935652363870208","1105591565911773184","1552510581","callie sands","sands_callie",false,"AOC",false,"The only reason the next generation is in danger is because of you & your Marxist buddies. Just like so many have died in Venezuela. Socialism kills. Fossil fuels are the engine of economic freedom & prosperity. Something you hate unless that $ is flowing into your pocket","en","","",""],["1106477224541085698","1105591565911773184","1552639702","Brenda Goldberg","SweeperToo",false,"AOC",false,"You are part of the problem. Better recycle plastic bags. Every little bit helps.","en","","",""],["1106147133386907648","1105591565911773184","1552561002","Todd Smelser","BLKDOGEDIT",false,"AOC","true"," https://tinyurl.com/y5g7zszl ","und","https://t.co/tF8riE0Oii","",""],["1106687441556176896","1105591565911773184","1552689821","Mark Sesslar","SesslarMark",false,"AOC",false,"Where did DAPL leak at?","en","","",""],["1105883438354030592","1105591565911773184","1552498132","AOC Superfan","alxfromthebronx",false,"AOC",false,"If the sea rises are rising maybe you can talk some New Yorkers to sell my some Hampton real estate at a discount before their props get swallowed up by the sea?","en","","",""],["1105910332323782656","1105591565911773184","1552504544","gaslighter","flaminis2",false,"AOC",false,"The science does not support your assumptions dear.","en","","",""],["1105887353065762816","1105591565911773184","1552499066","travelingman","Jamesdemuth3",false,"AOC","true","Seems nazi sympathizer Soros is your funding money man pic.twitter.com/EDOkniZ47F","en","https://t.co/EDOkniZ47F","",""],["1106232501259788288","1105591565911773184","1552581355","Wade Jeremy","wade_jeremy76",false,"AOC",false,"so dumb.  \n\nI bought a car, knowing it would eventually break down--My bank knew it wouldn't last forever--but I guess my bank should pay the repairs--because they financed it in the first place.","en","","",""],["1106538975945093121","1105591565911773184","1552654425","kits","kitsap_lady",false,"AOC",false,"Don't forget the farting cows! We already know a newborn calf born will fart for its lifetime. https://twitter.com/AOC/status/1105608464531894273 …","en","https://t.co/80YCgcC5lu","",""],["1105979504235823104","1105591565911773184","1552521036","Chris Shannon","ChrisSh93725760",false,"AOC",false,"go back to bartending, you suck at being a congressional representative","en","","",""],["1105927235041558528","1105591565911773184","1552508574","❌ CalifCaro9 ❌","CalifCaro9",false,"AOC",false,"So uneducated,  but still vile.","en","","",""],["1107869758786023424","1105591565911773184","1552971708","Brian","PIsland_Trader",false,"AOC",false,"You emit more carbon footprint in 1 month than most americans do in their lifetime your nothing but a hypocrite........","en","","",""],["1106730259246919682","1105591565911773184","1552700030","Mike McKibben","MikeMcKibben",false,"AOC",false,"The Sun is expanding.","en","","",""],["1105987098836979712","1105591565911773184","1552522847","Joe The Ranter","Joetheranter",false,"AOC",false,"You are more stupid than Don Lemon. What an ass clown.  What do you do when you fail at bartender?  Run for a  seat  in  the house a a a demoncRAT","en","","",""],["1106119517481127936","1105591565911773184","1552554418","((Troll))","isa26810000",false,"AOC",false,"Stay in the kitchen woman,  men are talking.","en","","",""],["1106050420777066496","1105591565911773184","1552537944","mariewells","mariewe19464624",false,"AOC",false,"It all boils down to money. We have known for many years, some people don't want to know. Look at monsanto,they gave us DDT, Agent Orange, now Round up. The government still keeps supporting them.","en","","",""],["1106596857898328064","1105591565911773184","1552668225","TDS IS REAL","RonaldWilliam64",false,"AOC","true","California is officially out of a 10-year drought. Good time to revisit predictions like AOC’s 12-year doomsday prediction... https://www.latimes.com/politics/la-na-pol-climate-california-20171205-htmlstory.html …","en","https://t.co/QtMvKBJkKB","",""],["1105890500115083264","1105591565911773184","1552499816","ChiTown237","js237js_john",false,"AOC",false,"Like, like, LIKE, like .... Um, Um, like, um, Like, Um, Like, Um......\nHow can you be this unintelligent... Please use your own advice and never have children of your own. IDIOCRACY","en","","",""],["1106544392217735170","1105591565911773184","1552655716","SheilaK","Sheila1255",false,"AOC",false,"How do 'we' know? Because some rabid scientist says so? Many other say not. I recall in the 70's the huge scare was coming ice age.  Didn't happen","en","","",""],["1106971096253902848","1105591565911773184","1552757450","Lisa LaMantia","LisaLaMantia8",false,"AOC",false,"You are another Al Gore trying to scare people into making YOU run our lives! It’s nothing more than a power play. The Bill of Rights says our rights come to us at birth, on this soil, from our Creator so back off. YOU certainly don’t qualify.","en","","",""],["1106744880078950402","1105591565911773184","1552703516","Larry Holmack","LarryHolmack",false,"AOC",false,"Are you talking about a pipe line that hasn't been built yet???","en","","",""],["1105964752528908288","1105591565911773184","1552517519","Ch. v Faber-Castell","chvfabercastell",false,"AOC",false,"Actually, also accidents are normally \"cause*effect\" - The aggraving  difference in \"guilt\" or (moral) responsibilry lay in the carelessness or even deliberation to accept such known damaging cause+effect-mechanisms an to allow themto unfold.","en","","",""],["1106160689494802433","1105591565911773184","1552564234","Leonard Dale","quiksetleaders1",false,"AOC","true","lol pic.twitter.com/HUkInNBGKI","und","https://t.co/HUkInNBGKI","",""],["1105891988275122178","1105591565911773184","1552500171","Vic Lyn 🖤","viclyn529",false,"AOC",false,"We also know automobiles cause accidents that kill people. Should the bank that financed my Auto loan be responsible if I crash my car, resulting in a fatality?  Your logic isn’t very well thought out.","en","","",""],["1105886152412839939","1105591565911773184","1552498779","john macqueen","Tx_Rider1",false,"AOC","true","And we also know that even the evil oil companies are working hard to find solutions to our fossil fuel addiction.. https://www.ft.com/content/85bb7f54-54da-11e7-9fed-c19e2700005f …","en","https://t.co/xq3pp0TwdM","",""],["1106040540402016256","1105591565911773184","1552535588","Conservativerider","Conservativeri8",false,"AOC",false," https://twitter.com/rosedixontx/status/1105986786810044417?s=19 …","und","https://t.co/1TnRMJC29l","",""],["1106524642506883073","1105591565911773184","1552651007","goldfinger","agsolehigh",false,"AOC",false,"we know after one term you all get free healthcare for life and a pension - #termlimits","en","/hashtag/termlimits?src=hash","",""],["1105958946316140546","1105591565911773184","1552516135","Roberto","robfauver",false,"AOC",false,"Facts and truth are not important with AOC.  Feelings and morality are more important.  Facts are hard to come by, faux moral superiority is easy.","en","","",""],["1106655334242926592","1105591565911773184","1552682167","MidAtlantic Woman","MidAtlantcWoman",false,"robfauver AOC",false,"Morality?!? She supports killing babies!","en","","",""],["1106231581474095104","1105591565911773184","1552581136","S.D. Plissken ✝️","jcoyote52",false,"AOC",false,"Jibberish","hi","","",""],["1106201852151062528","1105591565911773184","1552574048","Grant Pearson","FueinTnarg",false,"AOC",false,"Please tell me you are not as stupid as you sound. Pushing ideas that no one in their right mind would vote for! Honestly, I can not believe there were so many idiots that place you in congress in the first place.","en","","",""],["1106148520854208512","1105591565911773184","1552561333","Michael Treb","CPCMNT",false,"AOC",false,"no...the FACT is that we DONT KNOW. And your blatant lies and spin are embarrassing to people who can think. Please go read a book","en","","",""],["1105925421315571714","1105591565911773184","1552508142","KMW1959","KellyWeidler",false,"AOC","true"," pic.twitter.com/KaorY7Gr9C","und","https://t.co/KaorY7Gr9C","",""],["1105904676409692160","1105591565911773184","1552503196","Adam","AdamTherealadam",false,"AOC",false,"These observations of yours are not based in fact. We don't know the next gen is in danger from the climate. That's Bullshit. The real danger is socialism!","en","","",""],["1106208362771955713","1105591565911773184","1552575600","Roland Tucker","RolandTucker1",false,"AOC",false,"Yes, we already know about this climate change hoax. It is trash just like you.","en","","",""],["1106315832705978368","1105591565911773184","1552601223","fefe25  4GodNcountry","buttercup_yay",false,"AOC",false,"Then why don't you go after china and India in stead of coming after us, since we always do our part..","en","","",""],["1105902698984034305","1105591565911773184","1552502724","Superfabulous","Superfabulous7",false,"AOC",false,"Can middle class just quit paying bills that company bailouts should not benefit from! Intrest on everything ( life) with no pay increase on our jobs...is making us poor!! Thanks","en","","",""],["1106240337641721856","1105591565911773184","1552583224","freebird81","freebird815",false,"AOC","true"," pic.twitter.com/8B5lkzkMBB","und","https://t.co/8B5lkzkMBB","",""],["1106566276128882694","1105591565911773184","1552660933","PJ","davis455",false,"AOC","true","God is in control of the climate. The Earth will not be destroyed by climate change. Read the bible! pic.twitter.com/z1B1XJ1GgF","en","https://t.co/z1B1XJ1GgF","",""],["1106107886864949248","1105591565911773184","1552551645","d@niel","cowcreekgeek",false,"AOC",false,"Edwards' claim you'd channeled Friedman was in error, just as you are... here's your better case for negative externality: Tax emmisions at the source, and form global partnerships to apply existing technologies w/in emerging markets (by far, the greater cause of global warming).","en","","",""],["1106030880873766912","1105591565911773184","1552533285","StandFor🇺🇸","StandAdk",false,"AOC",false,"Just such a load of crap trying to scam low information masses with double speak and unfounded #FakeClimateChangeFear and look at all the \"followers\" and likes for this absolute nonsense most likely bought and paid for by the $ that funded #Obama and his disaster of 8 years","en","/hashtag/FakeClimateChangeFear?src=hash /hashtag/Obama?src=hash","",""],["1105947859063455744","1105591565911773184","1552513491","Elias Dichi","eliasdichi",false,"AOC",false,"What I know is that you are falling in argumentum ad populum fallacy. Are you a scientist or a simple silly politician?","en","","",""],["1106541922104025088","1105591565911773184","1552655127","Toflytoday","TerrilC11",false,"AOC","true","Climate change & global warming are not real.God created the earth& all things&the air we breath&water we drink.He will make sure we have those until he creates a new heaven & new earth.After the Great White Throne Judgement where the lost dead&living will be cast into Hell. pic.twitter.com/sX0rkEx1jW","en","https://t.co/sX0rkEx1jW","",""],["1105997935559491584","1105591565911773184","1552525430","Dutchman","Dutchman1789",false,"AOC",false,"More carbon is a good thing. Warmer weather is a good thing. It means more plants and more food. Man made climate change doesn't exist. There is no consensus. Fossil fuels are the reason we have such advanced technology and fewer people are starving.","en","","",""],["1106242995584675840","1105591565911773184","1552583857","Bryan Pennington","BryanPenningt10",false,"AOC",false,"You mean the same politicians and scientists and governments that are paid by lobbyists to scream climate change?? Maybe we should ban volcanoes.","en","","",""],["1107872869235736577","1105591565911773184","1552972449","TPLG","Tawfiki2045",false,"AOC",false,"One does not have to support the same party to work together to solve a problem. What your GREEN NEW DEAL lacks is what TPLG can provide.","en","","",""],["1106311402816446464","1105591565911773184","1552600167","liz taggart","liztaggart2",false,"AOC",false,"Let the company handle the leaks as required by law for Pete's sake.  Everyone depends on oil you included, quit whining about it.","en","","",""],["1109851097638809601","1105591565911773184","1553444096","Dig It","DigIt78991119",false,"AOC",false,"How did you know it would leak?","en","","",""],["1106007052529340417","1105591565911773184","1552527604","Thomas E Wiggins","toiletsnake26",false,"AOC",false,"We know Congress will make stupid laws that harm Americans, so should we hold you accountable for your ineptitude.","en","","",""],["1106192914043076608","1105591565911773184","1552571917","No Collusion Trump Supporter 🇺🇸","markisley",false,"AOC",false,"Climate change is not real. The Earth goes thru cycles. How do you not know this??","en","","",""],["1105962741632778240","1105591565911773184","1552517040","WhiteSoxBoycott","DewsSox79",false,"AOC",false,"you give zero fucks about the enviorment. this is all an agenda. you may be inspired by a few twitter users but the country sees thru you and is laughing their asses off. but please keep going...you are helping us conservatives in 2020.","en","","",""],["1105935062229368832","1105591565911773184","1552510440","callie sands","sands_callie",false,"AOC",false,"You don’t know shit all about anything let alone the weather. You’re a trained parrot who auditioned with the “young Turks” for a role you’re playing.","en","","",""],["1105945246817382400","1105591565911773184","1552512868","adam","socalflya",false,"AOC",false,"We know nuclear power is safe, yet you stupidly hide from it.","en","","",""],["1106008151525068801","1105591565911773184","1552527866","masterblaster","Zeromnia",false,"AOC",false,"It’s amazing to me that I never hear millennials bring up nuclear conflagration.  Never.  The Cold War is over but the threat is still real.  The Climate Change I worried about as a kid was nuclear winter.","en","","",""],["1105994670902005761","1105591565911773184","1552524652","payback","horning_kenneth",false,"AOC","true"," pic.twitter.com/iS6fjGGaf8","und","https://t.co/iS6fjGGaf8","",""],["1105890553793671168","1105591565911773184","1552499829","Dirk Richard","DirktheDuck",false,"AOC",false,"liar...again...there is NO PROVEN SCIENCE to back your bullshit claims ABOUT MAN CAUSED CLIMATE CHANGE...NONE. Yet being the dishonest dumbass you are, you keep spouting that.","en","","",""],["1105907601705967616","1105591565911773184","1552503893","CPHORSES For Trump🐴","cphorses_mary",false,"AOC","true","Liar pic.twitter.com/F2Y9dSmXfq","es","https://t.co/F2Y9dSmXfq","",""],["1105901191727407104","1105591565911773184","1552502365","Wethepeeps","Wethepeeps5",false,"AOC",false,"Climate has been changing for 3 BILLION years!!!  U make me lmao","en","","",""],["1105905418990022656","1105591565911773184","1552503373","Bill Urban","wmlurban",false,"AOC",false,"Are you high??   Your tweet is  an incoherent mess. What language are you speaking?","en","","",""],["1105887565893328899","1105591565911773184","1552499116","Bobsbaby","Bobsbaby",false,"AOC",false,"WHY are you so arrogant with only a few months of experience?","en","","",""],["1106421198567673857","1105591565911773184","1552626344","Jef Welch","jefwelch",false,"AOC",false,"Call me in 12 years.","en","","",""]]}