{"origin":["1105980449652949002","4:54 PM - 13 Mar 2019","Alexandria Ocasio-Cortez","AOC",true,"Cost of the GOP Tax Scam for the rich:~$1.8-2.3 Trillion\n\nCost of forgiving all student loans in America:~$1.5 Trillion\n\nClearly where there’s a will, there’s a way.\n\nWhen people say that there isn’t “enough” to do these things, what they mean is they don’t *want* to do them. https://twitter.com/samswey/status/1105694640735428610 …","samswey","Cancelling student loan debt would benefit 25,000,000 American Millennials by an average of $30,000 each. It’s wild that candidates have not publicly supported this policy to date.","75381","22430"],"replies":[["1105980482615939072","1105980449652949002","1552521269","Alexandria Ocasio-Cortez","AOC",false,null,"true","And before conservatives start whining that I refer to tax cuts (aka revenue cuts) as costs, here’s a reminder that the world recognizes that they are costs too: pic.twitter.com/5xxLNBFXhy","en","https://t.co/5xxLNBFXhy","23273","4349"],["1106014666906456064","1105980449652949002","1552529420","Colin Moriarty","notaxation",false,"AOC",false,"I made an awful call as a kid, lived on campus, and walked out of NU $60k in debt, all because of private school room & board in a big city.\n\nI paid every penny back, with interest, 10 years early.\n\nDo I get my debt forgiven, too, or do I get to pay the Taking Responsibility Tax?","en","","3345","263"],["1106015873913905153","1105980449652949002","1552529707","Colin Moriarty","notaxation",false,"AOC",false,"Why did I have to make sacrifices and throw $500 out of the window each month to pay a debt I voluntarily accrued, just so others can get theirs forgiven?\n\nI made $40k/year out of college, living in the US' most expensive city. I had literally nothing. I made it work. No excuses.","en","","1734","100"],["1106028089107046401","1105980449652949002","1552532620","Jeff Cannata","jeffcannata",false,"notaxation AOC",false,"You had it shitty so everyone else should, too?","en","","1375","17"],["1106029644237561856","1105980449652949002","1552532990","Colin Moriarty","notaxation",false,"jeffcannata AOC",false,"I took responsibility for my choices.\n\nEveryone else should also take responsibility for their choices.\n\nThere's a quantum leap between \"the common defense\" or \"let's build roads and bridges\" and \"forgive the loan I voluntarily took under zero duress 'cause I made a poor choice.\"","en","","1797","80"],["1106030071561646081","1105980449652949002","1552533092","Jeff Cannata","jeffcannata",false,"notaxation AOC",false,"Or, how about, education is an important thing and no one should be saddled with predatory loans - the only kind you can get for education - and we can’t go back in time, so let’s fix it now?","en","","1183","26"],["1106030968337457152","1105980449652949002","1552533306","Colin Moriarty","notaxation",false,"jeffcannata AOC",false,"Government is responsible for those predatory loans. Government is the reason I could -- at literally 17 years of age -- take out $60,000 in loans without any credit or any money.\n\nSmall wonder college is so expensive.\n\nAnd most people don't need to (and shouldn't) go to college.","en","","1084","51"],["1106031862437146624","1105980449652949002","1552533519","Jeff Cannata","jeffcannata",false,"notaxation AOC",false,"Not even sure how to touch that last sentence. You know best, I guess. \n\nAs for the rest, ok. Again, no time machines yet. Let’s fix it. No one should be an indentured servant for life. We agree there’s a problem, you just don’t want to fix it because no one fixed it for you.","en","","1068","16"],["1106032773846884352","1105980449652949002","1552533737","Colin Moriarty","notaxation",false,"jeffcannata AOC",false,"I would be perfectly happy getting the government out of the student loan business. The price of college would plummet immediately once there were no guaranteed loans for clueless children.\n\nBut those who took loans need to pay them back, just like I -- and many millions -- have.","en","","1222","49"],["1106033366099386368","1105980449652949002","1552533878","Jeff Cannata","jeffcannata",false,"notaxation AOC",false,"How come it is about personal responsibility when it is a kid trying to go to school, but not when it’s a farmer farming, or big banks going under, or the auto industry failing?","en","","536","12"],["1106034516785676288","1105980449652949002","1552534152","Colin Moriarty","notaxation",false,"jeffcannata AOC",false,"I dunno, Jeff. I'm not gonna defend positions I don't hold.","en","","483","7"],["1106181706120347648","1105980449652949002","1552569245","Kymberli","Kympocalypse",false,"notaxation jeffcannata AOC",false,"I literally just paid off my student loans last month. My child starts college this fall. I would be THRILLED if he didn't have to deal with the debt I did. I don't understand the selfish thinking of, \"everyone should have it hard because I did.\"","en","","378","10"],["1106204703212351489","1105980449652949002","1552574728","phil williston","PhilWilliston",false,"Kympocalypse notaxation jeffcannata AOC",false,"That’s not a selfish position, when young people have everything handed to them they do not learn and understand the value of a dollar, going through a few hardships and learning how to deal with them on your own two feet is very healthy part of growing up and being responsible!","en","","231","10"],["1106211175895875586","1105980449652949002","1552576271","Jordy Schreuders","SchreudersJordy",false,"PhilWilliston Kympocalypse notaxation jeffcannata AOC",false,"People don't need 60k debt coming into adult life to learn the value of a dollar..","en","","217","1"],["1106221059395735552","1105980449652949002","1552578627","phil williston","PhilWilliston",false,"SchreudersJordy Kympocalypse notaxation jeffcannata AOC",false,"Maybe but it is also part of personal choice and they have debts to pay for you can change a system and even decrease debts without saying everyone should have had a free ride either","en","","43",""],["1106245642173759490","1105980449652949002","1552584488","Jessica Hanson","JessicaPHanson",false,"PhilWilliston SchreudersJordy Kympocalypse notaxation jeffcannata AOC",false,"Education is not a personal choice. You are repeating propaganda from the USA gov because some people want to take all they can from our system. Public free education was started to get kids ready for the main workforce. Life has changed so we change.","en","","16",""],["1106252489240862722","1105980449652949002","1552586121","Justin","JustinfromFl",false,"JessicaPHanson PhilWilliston SchreudersJordy Kympocalypse notaxation jeffcannata AOC",false,"A college education is absolutely a personal choice.","en","","23","1"],["1105982004775002112","1105980449652949002","1552521632","Red Tide","TideInTejas",false,"AOC",false,"I paid back every dollar of my student loans. It's called taking responsibility for one's debts. It's what grown-ups do","en","","1580","78"],["1105984779667886082","1105980449652949002","1552522294","robert fournier","rfournier20",false,"TideInTejas AOC",false,"Yeah but college debt ain’t what is used to be.","en","","623","7"],["1105986382768599042","1105980449652949002","1552522676","Joshua Bird","Josh_CF",false,"rfournier20 TideInTejas AOC",false,"This wasn't your parents college debt. What you did was admirable, but a system that allows anyone to get in massive debt for education needs to go away. Student debt is the LARGEST asset class in our country and it is handcuffing entire generations.","en","","661","28"],["1106060272257638400","1105980449652949002","1552540293","Ugly Sam","gimme_a_kisss",false,"Josh_CF rfournier20 TideInTejas AOC",false,"Josh:Debt is not an asset. Millennials shirk personal responsibility. There are ways to pay for college other than student loans. Although a poor system, no one forced you to take student loans. You made a bad decision and blame others refusing to accept personal responsibility.","en","","318","7"],["1106162703108894721","1105980449652949002","1552564714","Joshua Bird","Josh_CF",false,"gimme_a_kisss rfournier20 TideInTejas AOC",false,"\"Asset Class\" which refers to the institutions holding the note, not the students who borrowed. The problem with that is it could be like the subprime crisis, if enough people default the whole sucker comes crashing down...or we'll just print more money and raise inflation.","en","","131","1"],["1106613264677593090","1105980449652949002","1552672136","Mitch 👇😳👇","NotthefakeMK",false,"Josh_CF gimme_a_kisss rfournier20 TideInTejas AOC",false,"Actually you can do 2 years of CC and 2 years at a public college and some out with less than 20K in debt....I fail to see why every kid needs to go to an expensive college and make the tax payers pay for it","en","","43","5"],["1106615656731037696","1105980449652949002","1552672707","robert fournier","rfournier20",false,"NotthefakeMK Josh_CF gimme_a_kisss TideInTejas AOC",false,"I’m not advocating that the government should pay for anything. Just so you know, the govt does “pay” for a lot of things and they tend to help the wealthy disproportionately more than poor folks-tax cuts, lower tax rates on capital gains, etc.","en","","7",""],["1106647073712209922","1105980449652949002","1552680197","Mitch 👇😳👇","NotthefakeMK",false,"rfournier20 Josh_CF gimme_a_kisss TideInTejas AOC",false,"Idk being in the 36% Tax bracket it gets a bit ridiculous at a point","en","","5",""],["1105981179323244544","1105980449652949002","1552521435","vmf0569","vmf0569",false,"AOC",false,"I agree with 1/2 of this.  If you cancel their debt I want my debt canceled.  I didnt go to college bc I couldn’t afford it.  They did and now you are saying I should pay for their college? Why? Bc debt is hard to pay off?  Yes,  it is.  Get a second and third job like I have.","en","","613","29"],["1105983285006647297","1105980449652949002","1552521937","TimTakDoh","HungryHungryHP",false,"AOC andrewyangvfa",false,"No one should have to get a 2nd(and especially a 3rd) job to 'survive' in the richest country in the world. We can help stop these absurd for profit university scams AND help everyday American's like yourself. There doesn't have to be an either or. Look up @AndrewYangVFA","en","/andrewyangvfa","252","4"],["1105988684929593345","1105980449652949002","1552523225","vmf0569","vmf0569",false,"HungryHungryHP AOC andrewyangvfa",false,"The point is,  successful people do what it takes to make it happen.  Ask any successful person if they work 40 hour weeks and hope that someone comes along and GIVES them something bc they have more money than them.  Idiotic.","en","","196","8"],["1105989845015506945","1105980449652949002","1552523502","TimTakDoh","HungryHungryHP",false,"AOC",false,"So you work 40 hours a week total with 2 or 3 different jobs? If you have 2 or 3 jobs to 'succeed' you aren't working JUST 40 hours a week. You're working yourself to death. No one should have to do that","en","","209","1"],["1105990678704730113","1105980449652949002","1552523700","Am pollitical moderate boi","ModerateAm",false,"HungryHungryHP AOC",false,"It’s the price of education, it’s not easy but it’s a choice people make, it’s not like he was forced to do it. He chose to, forgiving debts is just another way we’ll make people lazy and allow people to get away with horrible financial decisions with no consequences.","en","","154","6"],["1105991569881161729","1105980449652949002","1552523913","TimTakDoh","HungryHungryHP",false,"ModerateAm AOC",false,"The price of education TODAY. The price of college has increased almost 8 times as much as wages since the 80s. If anyone thinks that's acceptable then they probably don't care about education.","en","","267","5"],["1105992124686913538","1105980449652949002","1552524045","Am pollitical moderate boi","ModerateAm",false,"HungryHungryHP AOC",false,"Trade school, apprenticeships, vocational school. It’s the cost of private education, don’t attend expensive D1 schools if you know you can’t afford it. Do most of your courses at a community college then transfer and finish your degree there. There are ways to plan for it","en","","161","4"],["1105999417977520129","1105980449652949002","1552525784","💫 King T’Challa 💫 🏁💙","_QuietImTweetin",false,"ModerateAm HungryHungryHP AOC",false,"Certain programs won’t accept courses from a community college so you have no choice but to attend a university","en","","58","3"],["1106010505485926401","1105980449652949002","1552528427","Am pollitical moderate boi","ModerateAm",false,"_QuietImTweetin HungryHungryHP AOC",false,"Hence planning ahead and researching, learn what courses you can do for a fraction of a big university’s costs. Poor planning is why these debts are usually so high. It’s a choice to take on loans, I know people who are putting themselves through school rn with no loans","en","","59",""],["1106018144739647489","1105980449652949002","1552530249","💫 King T’Challa 💫 🏁💙","_QuietImTweetin",false,"ModerateAm HungryHungryHP AOC",false,"Who also paid for school without loans. Doesn’t mean it’s a viable option for everyone. Stop putting everyone into the same category that if a few people did it then everyone should be able to. It’s dismissive","en","","80","1"],["1106034515871518727","1105980449652949002","1552534152","Man With Harder Hat","jaredbonshire",false,"_QuietImTweetin ModerateAm HungryHungryHP AOC",false,"Having people who want an education but can’t afford it is exactly what people who can afford it want.","en","","90","5"],["1106034794050322435","1105980449652949002","1552534218","💫 King T’Challa 💫 🏁💙","_QuietImTweetin",false,"jaredbonshire ModerateAm HungryHungryHP AOC",false,"Only way to keep their power","en","","46",""],["1106235151384748032","1105980449652949002","1552581987","🌺Tara “Summer is Coming” R. 🔥🐉","Artistring",false,"_QuietImTweetin jaredbonshire ModerateAm HungryHungryHP AOC",false,"My two cents as a teacher...In the current high school climate there’s not enough guidance counselors to help students sort through future job, school, and or training options.  That needs to change!","en","","34","1"],["1106285270201221121","1105980449652949002","1552593936","Raychel Fitzgerald","MzFitz12157",false,"Artistring _QuietImTweetin jaredbonshire ModerateAm HungryHungryHP AOC",false,"There's also not enough kids working hard enough for scholarships anymore because now they feel entitled","en","","10",""],["1106289685540802561","1105980449652949002","1552594989","🌺Tara “Summer is Coming” R. 🔥🐉","Artistring",false,"MzFitz12157 _QuietImTweetin jaredbonshire ModerateAm HungryHungryHP AOC",false,"1/There’s not as many scholarships available as you think.  Most of them are less $ When my older son was going through the process 2 yrs ago, he didn’t qualify for 95%. His single mom, me, made too much money as a veteran teacher.  He is not a minority and he’s not female.","en","","13",""],["1106291512084697090","1105980449652949002","1552595425","Raychel Fitzgerald","MzFitz12157",false,"Artistring _QuietImTweetin jaredbonshire ModerateAm HungryHungryHP AOC",false,"I'll give you that it sucks to be a white male nowadays. But it's still on him/you to pay for college scholarships don't have to come from academic achievements my daughter's 4.7 GPA got her less than her ability to shoot her rifle.","en","","2",""],["1105981386618560512","1105980449652949002","1552521485","Mirtika","MirWriter",false,"AOC",false,"Why should ALL student loans be forgiven? Some will take on lucrative jobs and be able to pay back. Some will do jobs that pay less and may take more time or should have it reduced to allow them to flourish. Are they going to forgive my car loan and mortgage, too?","en","","353","23"],["1106016047608549377","1105980449652949002","1552529749","I'd kill for a nap","MassholeJP",false,"WokeMccain MirWriter AOC",false,"It’s literally the ‘don’t touch mine’ philosophy.  Rather than understanding that a rising tide lifts all boats, they’re consumed with angst about their own boat being diminished.","en","","261","8"],["1106060432547217411","1105980449652949002","1552540331","Mirtika","MirWriter",false,"MassholeJP WokeMccain AOC",false,"My boat isn't diminished. But there are more urgent things that require large outlay--such as universal healthcare, research into alternate fuels,  and climate change preparation measures.  Priorities.","en","","64","1"],["1106212412372316162","1105980449652949002","1552576566","Tamarama","Metamarama",false,"MirWriter MassholeJP WokeMccain AOC",false,"Imagine how much faster we could get these things done if all those smart poor kids could go to college","en","","110","1"],["1106245017901953027","1105980449652949002","1552584339","Mirtika","MirWriter",false,"Metamarama MassholeJP WokeMccain AOC",false,"I was a smart, poor kid. Immigrant. Parents made minimum wage. Mom took extra night work to send me to Catholic school (she was religious). I worked part-time, went to school-part time and earned a scholarship, too. My engineer also poor BF worked/studied.","en","","72","2"],["1106255986673610752","1105980449652949002","1552586955","Gozer the [REDACTED]","The_Gozerian",false,"MirWriter Metamarama MassholeJP WokeMccain AOC",false,"And you go right back to \"I didn't have-\"","en","","41",""],["1106261332188381184","1105980449652949002","1552588229","Mirtika","MirWriter",false,"The_Gozerian Metamarama MassholeJP WokeMccain AOC",false,"I didn't have then I did. So, from ghetto to middle class. Isn't that what poor kids want: to do better?","en","","56","3"],["1106270519979110407","1105980449652949002","1552590420","Evil Author SK Balk","SKBalk",false,"MirWriter The_Gozerian Metamarama MassholeJP WokeMccain AOC",false,"I'm middle class, too, but it's not something that everyone can attain just because we have. You should know that there's a great deal of luck involved.","en","","32",""],["1106301524165169155","1105980449652949002","1552597812","Mirtika","MirWriter",false,"SKBalk The_Gozerian Metamarama MassholeJP WokeMccain AOC",false,"It's not just luck. It's hard work, sometimes w/support--from teachers, parents, friends. Also not doing stuff that derails/might derail you: drugs, not studying, dropping out, crimes, premature parenthood. The things you CAN control vs can't control (abuse, bad parents, etc.)","en","","40","3"],["1106303824044556288","1105980449652949002","1552598360","Tamarama","Metamarama",false,"MirWriter SKBalk The_Gozerian MassholeJP WokeMccain AOC",false,"It's never *just* luck (that wasn't the claim) but I agree that there is always some luck involved Esp when you're in a precarious position where any small thing could derail yr dream If I hadn't answered my phone when the call granting the rent controlled apt came in, who knows?","en","","11",""],["1106411878434000897","1105980449652949002","1552624122","Jonathan Abramson","ImJonAbramson",false,"Metamarama MirWriter SKBalk The_Gozerian MassholeJP WokeMccain AOC",false,"Here’s where partisanship gets in the way: Dems (of which I’m one) tend to place too much blame on the system to the point where they may be too stubborn to acknowledge hard work DOES create “luck”/opportunity, & ...","en","","12","3"],["1106414158176612352","1105980449652949002","1552624666","Tamarama","Metamarama",false,"ImJonAbramson MirWriter SKBalk The_Gozerian MassholeJP WokeMccain AOC",false,"Hard work is great. But if you’ve never been poor or black or brown it can be hard to understand that just one little mistake that would mean nothing for a middle class white person can be the end for you because the system does not allow you a second chance","en","","6",""],["1106415498969772033","1105980449652949002","1552624985","Jonathan Abramson","ImJonAbramson",false,"Metamarama MirWriter SKBalk The_Gozerian MassholeJP WokeMccain AOC",false,"Sure- totally fair. That’s why I’m a Democrat; it’s not binary... our world is stacked (and I’m the beneficiary)","en","","5",""],["1106415788506808321","1105980449652949002","1552625054","Tamarama","Metamarama",false,"ImJonAbramson MirWriter SKBalk The_Gozerian MassholeJP WokeMccain AOC",false,"Me too","en","","5",""],["1108217928887861248","1105980449652949002","1553054718","Chels","ItsmechelCB",false,"Metamarama ImJonAbramson MirWriter SKBalk The_Gozerian MassholeJP WokeMccain AOC",false,"It's also alot about \"who you know\" now in addition to luck and hard work. Look at all these rich people being indicted for bribing Universities to get their kids in. I know this has nothing to do with debt repayment, just pointing out our system is fucked.","en","","5",""],["1106070884429623298","1105980449652949002","1552542823","Jess","jdmelloyello",false,"AOC",false,"Yes let’s teach kids that when you borrow money you don’t have to return it. What a great lesson. I paid back all my loans. Sure I had a small amount compared to others but you still borrowed the money. We need to teach these ADULTS life lessons such as this.","en","","181","7"],["1106165877941129216","1105980449652949002","1552565471","ThinkTwiceGK","ThinkTwiceGK",false,"jdmelloyello AOC",false,"So you think the government should have let Wall Street fail when they bailed them out?","en","","11",""],["1106209288010100736","1105980449652949002","1552575821","Jess","jdmelloyello",false,"ThinkTwiceGK AOC",false,"We all know that when Wall Street fails our economy fails. You are attempting to compare economic failure of the entire country to financial struggle of the few. It’s a logical fallacy and the two can’t be compared.","en","","16","1"],["1106218809755500545","1105980449652949002","1552578091","Jess","jdmelloyello",false,"ian_becker ThinkTwiceGK AOC",false,"25 million is the few when there is an additional 300.7 million people who’s tax money the 25 million borrowed.","en","","12",""],["1106268001030930433","1105980449652949002","1552589819","Jess","jdmelloyello",false,"ian_becker ThinkTwiceGK AOC",false,"I did not agree with the bank bailouts. I strongly disagreed with it. And as a result we saw that despite President Obama giving the bailouts, the banks gave themselves a pay raise and didn’t help anyone. #socialism","en","/hashtag/socialism?src=hash","9","1"],["1106277576845086720","1105980449652949002","1552592102","Robert Cooper","Stonesphan",false,"jdmelloyello ian_becker ThinkTwiceGK AOC",false,"President Bush signed the bailout package...","en","","19",""],["1106279492538916864","1105980449652949002","1552592559","Jess","jdmelloyello",false,"Stonesphan ian_becker ThinkTwiceGK AOC",false,"You’re right. I apologize for my mistake. My opinion on the matter does not change however.","en","","3",""],["1105990932812443648","1105980449652949002","1552523761","Noah DeGarmo","NoahDegarmo",false,"AOC",false,"It isnt my job to pay for anyone else's debt, nor is it anyone else's job to pay for mine.","en","","123","2"],["1106019543183511552","1105980449652949002","1552530582","No Dulles","NoDulles",false,"NoahDegarmo AOC",false,"You are doing that for the GOPs donors","en","","37",""],["1106026034804256768","1105980449652949002","1552532130","Noah DeGarmo","NoahDegarmo",false,"NoDulles AOC",false,"I'm paying the debts of GOP donors?","en","","6",""],["1106030375300710400","1105980449652949002","1552533165","samurai jack","zainjal26",false,"NoahDegarmo NoDulles AOC",false,"With the current tax plan this tax season we all did. Yup","en","","23",""],["1106030900976992256","1105980449652949002","1552533290","Noah DeGarmo","NoahDegarmo",false,"zainjal26 NoDulles AOC",false,"We paid the debts of GOP donors through tax cuts?","en","","7",""],["1106034082339790853","1105980449652949002","1552534049","lolly","lollybell",false,"NoahDegarmo zainjal26 NoDulles AOC","true","Yes - https://www.google.com/amp/s/www.vox.com/platform/amp/policy-and-politics/2018/4/21/17265796/wells-fargo-fine-cfpb-tax-cut …","und","https://t.co/wPg6SCVyqv","17","2"],["1106034818859655168","1105980449652949002","1552534224","Noah DeGarmo","NoahDegarmo",false,"lollybell zainjal26 NoDulles AOC",false,"Tax cuts are not an expenditure. No one is \"making money\" off of tax cuts, let alone the odd specificity of \"GOP donors\"","en","","31","1"],["1106109383748907008","1105980449652949002","1552552002","Peter Park","gonyangnari",false,"NoahDegarmo lollybell zainjal26 NoDulles AOC",false,"Same thing in the end.","en","","4",""],["1105983327943696384","1105980449652949002","1552521948","David Falloure","dfalloure",false,"AOC",false,"Uh excuse me—I’m not wealthy but the tax deal helped me in a big way ! I do not agree with school debt relief .","en","","97","5"],["1105983910419152896","1105980449652949002","1552522087","Hell Raisin' Hippies","HellHippie",false,"dfalloure AOC",false,"Yeah - instead, let's give a giant tax break to the rich!!   Yay for the rich!  To hell with the poor!","en","","42",""],["1105998758943342593","1105980449652949002","1552525627","David Falloure","dfalloure",false,"HellHippie AOC",false,"That was never the deal.","en","","21",""],["1106009802461847554","1105980449652949002","1552528260","Serial Cornflake Pisser","communist_jerk",false,"dfalloure HellHippie AOC",false,"This is America. That was always the deal.","en","","44",""],["1106021590494519296","1105980449652949002","1552531070","David Falloure","dfalloure",false,"communist_jerk HellHippie AOC",false,"Uh ... no.","es","","13",""],["1106023298557767680","1105980449652949002","1552531477","Scott","schroesc1",false,"dfalloure communist_jerk HellHippie AOC",false,"Don't try to explain simple economics to these people David.  They'll never understand.  Increased jobs and higher wages due to corporate expansion and reinvestment as a result of tax cuts is not a benefit. To the libs, it's only a benefit if it's handed down from the government.","en","","23","2"],["1106291964654338048","1105980449652949002","1552595532","Gregg Davis","davispine",false,"schroesc1 dfalloure communist_jerk HellHippie AOC",false,"Great in theory, but that’s not what’s happening. The tax “incentives” are being turned in additional profit resulting in higher wages and bonuses for a select few.","en","","4",""],["1106320559565164546","1105980449652949002","1552602350","packerfan24","atheis_4",false,"davispine schroesc1 dfalloure communist_jerk HellHippie AOC",false,"Actually wage growth is the highest it’s been in some time. But knowing this would involve you spending 5 seconds doing some research.","en","","6",""],["1106341480724160512","1105980449652949002","1552607338","Scott","schroesc1",false,"atheis_4 davispine dfalloure communist_jerk HellHippie AOC",false,"Also have the largest workforce in history, with still more companies coming back.  I guess if you get all your news from CNN & MSNBC, all you know is Trump is a Russian agent and colluded w/ Russia, though the Mueller report may say different.","en","","3",""],["1106022034184814597","1105980449652949002","1552531176","StanceGrounded","_SJPeace_",false,"AOC","true","Let's not forget 6 trillion on Illegal Wars since 2001\n\nThank you for coming to my TED Talk. pic.twitter.com/JOsjmm8PhD","en","https://t.co/JOsjmm8PhD","2140","425"],["1106041461848662017","1105980449652949002","1552535808","steved","steved74904040",false,"_SJPeace_ AOC",false,"Yup - blame it on the military !! Haha haha","en","","22",""],["1106067314984783872","1105980449652949002","1552541972","GeordieLass","IndivisableJ",false,"steved74904040 _SJPeace_ AOC",false,"What...they haven’t mentioned the military. ","en","","18",""],["1106077147377000448","1105980449652949002","1552544316","Trebie","bunnyhuggr",false,"IndivisableJ steved74904040 _SJPeace_ AOC",false,"it was a bot  they seem confused lol","en","","17",""],["1106086044422701056","1105980449652949002","1552546437","Paul Sochacki","Cyberskout99",false,"bunnyhuggr IndivisableJ _SJPeace_ AOC",false,"Must have struck a cybernetic nerve somewhere in the #Twitterverse ... Good catch.","en","/hashtag/Twitterverse?src=hash","9",""],["1107594469950582817","1105980449652949002","1552906074","❌Deplorable J ⭐⭐⭐ (K) ❌","JcDeplorable",false,"AOC",false,"So let me see, when the government cuts taxes on the people paying taxes you call it a scam, but if it gives more handouts to the ones that don't, that's not? You're the scam you socialist thief! Buying votes with other people's money. #socialistscum #leftismisamentaldisorder","en","/hashtag/socialistscum?src=hash /hashtag/leftismisamentaldisorder?src=hash","168","136"],["1108199609682354177","1105980449652949002","1553050350","Trump Derangement Syndrome Therapy Inc.","SlickZillaZilla",false,"JcDeplorable AOC BernieSanders",false,"Socialism.A hierarchy formed by avoiding meritocracy.\n@AOC. A player in the hierarchy with no merit.\nThere is a remarkable consistency in the architecture of scientific economies. Also, note @BernieSanders , never held a real job in his life. A detached political communist zealot","en","/AOC /BernieSanders","45","46"],["1108224781546070016","1105980449652949002","1553056352","Trump Derangement Syndrome Therapy Inc.","SlickZillaZilla",false,"YoLadySunshine1 JulieReichwein1 JcDeplorable AOC BernieSanders",false,"She's a normal simpleton that is now in the performance of her life. Trying to act like an intellectual. Fail.\nScientific economies are ridiculously complicated in sourcing, logistics, production and distribution. They don't work because blase manager bureaucrats don't give a","en","","",""],["1108240735453757440","1105980449652949002","1553060156","Trump Derangement Syndrome Therapy Inc.","SlickZillaZilla",false,"YoLadySunshine1 JulieReichwein1 JcDeplorable AOC BernieSanders",false,"Process control and especially process improvement never happens without dire consequences weighing as motivation. Even in a meritocracy/capitalistic enterprise. I can imagine when only penal punishment/enforcement is the motivator. No wonder so many have died during socialism.","en","","18","22"],["1105981444936122369","1105980449652949002","1552521499","Steve","Speedee19",false,"AOC",false,"Why should someone not have to pay a debt they incur, and where does it stop if you we absolve student loan debt - mortgages, car loans, credit cards....what debts would you actually have to pay?","en","","87","6"],["1105984356995223554","1105980449652949002","1552522193","pmac1980","pmac1980",false,"Speedee19 AOC",false,"Education not only help the recipient of it but also the country. Since a lot of these individuals will make more and pay more in taxes.","en","","30",""],["1105985440883068929","1105980449652949002","1552522451","Steve","Speedee19",false,"pmac1980 AOC",false,"Maybe, but were that true they would be in a position to pay their student loans...no?","en","","38",""],["1105988868891914240","1105980449652949002","1552523269","Ariella Brown (PhD)","AriellaBrown",false,"Speedee19 pmac1980 AOC",false,"Exactly what I was thinking! If you argue they're earning more and can contribute more, they can certainly repay the loans that usually only accrue interest -- at a low rate -- after graduation.","en","","16",""],["1106000015330295808","1105980449652949002","1552525926","Steve","Speedee19",false,"maiulaa AriellaBrown pmac1980 AOC",false,"c'mon now, nobody \"put\" those kids in debt. They willing took on the debt to \"live their best life\". They could have joined the service and received generous college benefits. So I'm guessing you are not much on personal responsibility?","en","","13",""],["1106004697096355840","1105980449652949002","1552527043","Steve","Speedee19",false,"maiulaa AriellaBrown pmac1980 AOC",false,"Well, I have empathy for the challenge they face in dealing with the debts they incurred, but not so much that I want to spend my money to ease the pain of their bad decision. What is the pay-off for the citizens who make better decisions - they pay the debts of the others?","en","","9",""],["1106011366866014214","1105980449652949002","1552528633","Jason","BadAshJL",false,"Speedee19 maiulaa AriellaBrown pmac1980 AOC",false,"The economy as a whole would benefit, since all that money currently going towards debt would now be going towards a downpayment on a starter home, or a downpayment on a new vehicle or to buy furniture or appliances that they need but couldn't afford due to crushing debt.","en","","7",""],["1106013199797755904","1105980449652949002","1552529070","Steve","Speedee19",false,"BadAshJL maiulaa AriellaBrown pmac1980 AOC",false,"Fair point, but where does the money come from to retire the debt? Contrary to fiscal theory the past 40 years, governments do have to pay their debts as well. How about this - cut govt spending, balance the budget & use surplus to address student loans...or reduce the deficit.","en","","2",""],["1106297940144984069","1105980449652949002","1552596957","Jason","BadAshJL",false,"Speedee19 maiulaa AriellaBrown pmac1980 AOC",false,"Where does the money come from for the military budget? Where does the money come from for the tax cuts for the rich? Why does this question only seem to be asked when it comes to social issues?","en","","5","1"],["1105980980836425728","1105980449652949002","1552521388","Jon Shell","jonny3dog",false,"AOC",false,"I’d rather they pay their loans. I wish the fed would balance their budget to lead by example","en","","109","1"],["1105986957312749568","1105980449652949002","1552522813","Loren LaLonde","lorenlalonde",false,"jonny3dog AOC",false,"Most debate centers on the high interest rate for those loans, despite no bankruptcy protection, the high initial costs, and lack of public investment in education.\n\nExample is to demonstrate how \"cost issues\" is just a selective cover for those who like it this way.","en","","40","6"],["1106028274826670080","1105980449652949002","1552532664","Jorge Gonzalez","jorgeucf",false,"lorenlalonde jonny3dog AOC",false,"Before passing judgement lets look at the facts. Student loans can not be forgiven by bankrupcy, it's predatory lending to needy collage students, an 18% fee is added at any default so please stop treating loanshark banks as the victim, they barrow from fed nearly at 2.5%","en","","47","4"],["1106189790611947521","1105980449652949002","1552571172","Reese","ReeseTheRanting",false,"jorgeucf lorenlalonde jonny3dog AOC",false,"That is a good start.","en","","5",""],["1107588225630171136","1105980449652949002","1552904585","Dr-Spygate","ph_terry",false,"AOC",false,"You undermine your goal with the opening statement.  The Universities should pay the $ back.  They are the ones who ripped the students off.  \n\nBtw, globalist politicians like you created the policies that drove student debt..., you are the problem, not the solution.","en","","64","35"],["1107595752031875074","1105980449652949002","1552906380","❌Deplorable J ⭐⭐⭐ (K) ❌","JcDeplorable",false,"ph_terry AOC",false,"She'd never do such a thing because she wants institutions in her pocket with the rest of the dark money.  No, she's after those of us that work hard to earn our income. There's fewer of us, and we'd never vote for leeches in a million years, so she's pegged us for theft.","en","","8","4"],["1105980664724115456","1105980449652949002","1552521313","Bryan Lawrence🧔🏻","BreatheNewWinds",false,"AOC",false,"The rich get their cake and eat it too, while the working class doesn’t even get the crumbles.","en","","90","5"],["1105981139649355776","1105980449652949002","1552521426","Ben in LA® 🔞","bilarichfield",false,"BreatheNewWinds AOC",false,"They get the receipt","en","","52","1"],["1105986434547236864","1105980449652949002","1552522688","EqualJusticeUnderLaw","AllisonRhody56",false,"bilarichfield BreatheNewWinds AOC",false,"They get the bill.","en","","10",""],["1105989417037000704","1105980449652949002","1552523399","Eric","concernedDadMB",false,"AOC",false,"Has it occurred to anyone to simply pay back the money you borrowed?  Like, we have 3.5% unemployment, rising wages, and actually a lack of labor to fill existing jobs?  Maybe get a job?","en","","87","2"],["1106271829004570626","1105980449652949002","1552590732","Evil Author SK Balk","SKBalk",false,"concernedDadMB AOC",false,"My husband has been paying on his student loans for ten years and currently owes more than what was borrowed. Any suggestions?","en","","16",""],["1106330150923198464","1105980449652949002","1552604637","joseph tentacles","tootsiesproles7",false,"SKBalk concernedDadMB AOC",false,"You have to refinance. Get your husband to go through a company like SoFi or someone similar so you can get a lower payment and interest rate. Tbh that’s all he’s been paying for. Is interest rates","en","","16",""],["1106338966167404545","1105980449652949002","1552606738","Cat Herder","3catsandaspider",false,"tootsiesproles7 SKBalk concernedDadMB AOC",false,"SoFi will only give you a loan if you already have good credit, which the majority of millennials do not because we're out here living paycheck to paycheck and getting drowned by interest. The entire student loan system needs to be abolished.","en","","11",""],["1106339281222590464","1105980449652949002","1552606814","joseph tentacles","tootsiesproles7",false,"3catsandaspider SKBalk concernedDadMB AOC",false,"Agreed. I didn’t qualify and went with citizens bank. And that was with a co signer. I was just throwing that first one out there for an example- as it’s the most notable ones, etc. and I agree too","en","","8",""],["1106340590218674176","1105980449652949002","1552607126","Cat Herder","3catsandaspider",false,"tootsiesproles7 SKBalk concernedDadMB AOC",false,"I guess I got \"lucky\" because all of my loans were federal and when I became disabled, I was able to get them discharged after a long process, but will probably not be able to get student loans ever again. Free college would be my only hope for finishing my degree.","en","","7",""],["1106345182503432193","1105980449652949002","1552608221","joseph tentacles","tootsiesproles7",false,"3catsandaspider SKBalk concernedDadMB AOC",false,"You’re a specific case on why should college should assist the majority of Americans. I hope you get it done someway somehow ","en","","8",""],["1105985582449262596","1105980449652949002","1552522485","matty prohm 🌐","TheProhmKing",false,"AOC",false,"You'll say I'm selfish but I worked two jobs (though we shouldn't have to), overpaid my loan each month, parents helped with a 529 plan, etc. Lots of sacrifices to get to zero.  And then people who don't sacrifice just POOF get the same reward? 1/2","en","","57","2"],["1105985941381005313","1105980449652949002","1552522571","matty prohm 🌐","TheProhmKing",false,"AOC",false,"I'm not opposed to making future college free, but those of us (fellow millennials) who did everything right and streched our budgets to pay off loans shouldn't have to essentially be punished for being responsible. 2/2","en","","48",""],["1106010785413844993","1105980449652949002","1552528494","Jim Talley","jtalley56",false,"TheProhmKing AOC",false,"Hear hear! And congratulations to you. Your grit and determination though will take you into despised world of high wage earners. Get prepared to be vilified for you character, drive, discipline and determination, but today I tip my hat to you.","en","","22",""],["1106013350029348864","1105980449652949002","1552529106","matty prohm 🌐","TheProhmKing",false,"jtalley56 AOC",false,"Shocking to hear my wife and I make about 120,000 as a household.  Not anywhere close to high earners.  Just a solid living in a small town.","en","","11",""],["1106337764063232000","1105980449652949002","1552606452","Barrett Berry","BarrettBerry",false,"TheProhmKing jtalley56 AOC",false,"For a large portion of Americans $120k a year is a high income for your household. It is actually twice the median for all Americans and three times the amount for African American households. Your economic reality is not of the working poor.","en","","16",""],["1106338558791634944","1105980449652949002","1552606641","matty prohm 🌐","TheProhmKing",false,"BarrettBerry jtalley56 AOC",false,"I know. Never said otherwise.","en","","2",""],["1106429680939401216","1105980449652949002","1552628367","Barrett Berry","BarrettBerry",false,"TheProhmKing jtalley56 AOC",false,"Respectfully, your comments do not indicate you appreciate the economic realities of many, I would argue, most Americans.  Paying back student loans is beyond challenging for Americans which make half (even a third) less of your household income.","en","","5",""],["1106507157174927360","1105980449652949002","1552646838","matty prohm 🌐","TheProhmKing",false,"BarrettBerry jtalley56 AOC",false,"No, I understand where you're coming from. My point is I don't think it's equitable or correct to arbitrarily discharge student loans. Why not mortgages? What's stopping future students from racking up massive unpaid debt in the hopes of future forgiveness?","en","","3",""],["1106541933068013568","1105980449652949002","1552655130","Jim Talley","jtalley56",false,"TheProhmKing BarrettBerry AOC",false,"Our gov’t, in an effort to be equitable to all, made mortgages too easily available, and we had the housing crisis as a result. The same was true with student loans and now we have another looming financial crisis.","en","","1",""],["1106356960394465287","1105980449652949002","1552611029","Blake Bortle's Agent","MattyBrews",false,"AOC",false,"I took out a Stafford loan to pay for graduate school. It was very clearly explained how much I was borrowing, what the interest would be, and repayment options. It was my choice and I'm glad I did it. Why would anyone expect their debt to just be forgiven? That's ridiculous.","en","","51","3"],["1106358653630717952","1105980449652949002","1552611432","jcollinsucf1991GoT","SubDestroyer12",false,"MattyBrews AOC",false,"Exactly.  You are a responsible person.  Why not forgive car loans and mortgages too.  Crazy!","en","","31","1"],["1106366676658999296","1105980449652949002","1552613345","Blake Bortle's Agent","MattyBrews",false,"SubDestroyer12 AOC",false,"Forgiving mortgages I might be able to get behind ","en","","17",""],["1106000935275225088","1105980449652949002","1552526146","Adam Rifkin 🐼","ifindkarma",false,"AOC tinatamandua",false,"Why do Americans who are not wealthy support the #GOPTaxScam?\n\n“14 Republican senators hold financial interests in 26 income-generating real-estate partnerships — worth as much as $105 million in total.”\n\nThis kind of self-dealing looks like corruption: https://twitter.com/sharonvt75/status/942943957427798016?s=21 …","en","/hashtag/GOPTaxScam?src=hash https://t.co/6qROFlunB5","92","35"],["1106006554828931072","1105980449652949002","1552527485","Tim W707 🇺🇸","OneArmBandit707",false,"ifindkarma AOC tinatamandua",false,"Peloski worth 4 times that by herself","en","","7",""],["1105980913043701761","1105980449652949002","1552521372","Ole Odinsson","mjolnir59",false,"AOC","true"," pic.twitter.com/jjpalw0amJ","und","https://t.co/jjpalw0amJ","131","31"],["1105986842615316480","1105980449652949002","1552522786","Christopher","sdmallardman",false,"mjolnir59 AOC",false,"You go @mjolnir59 !!!","en","/mjolnir59","6",""],["1108108476289613826","1105980449652949002","1553028623","Coffee_Bean ג'ניפר ⭐️⭐️⭐️","nitronut128",false,"AOC","true","You are a Socialist who is utterly ignorant of history! pic.twitter.com/XwLLrP0NMu","en","https://t.co/XwLLrP0NMu","26","23"],["1108111387375493120","1105980449652949002","1553029317","Kawasook","kawasook",false,"nitronut128 AOC","true","This is how it starts. #MABA pic.twitter.com/nfKNsV6Bkp","en","/hashtag/MABA?src=hash https://t.co/nfKNsV6Bkp","3","3"],["1108116052154691590","1105980449652949002","1553030429","Defreels","TennesseTrash",false,"kawasook nitronut128 AOC",false,"They need to teach history in schools. It is being lost to our kids","en","","2","2"],["1106535186446118913","1105980449652949002","1552653521","Shannon B. Terry","sbterry247",false,"AOC",false,"If you do this, refund or stipend the people that worked, saved and paid back their loans.  Now do your math.","en","","120","7"],["1106536090821971970","1105980449652949002","1552653737","Cory 🎙","ScarletGreatCT",false,"sbterry247 AOC","true"," pic.twitter.com/A6ChcWDvVF","und","https://t.co/A6ChcWDvVF","8",""],["1105981955907166210","1105980449652949002","1552521621","Brad Devlin","bradleydevlin",false,"AOC",false,"I, too, think it’s great that wealthy people will have more money to invest and grow the economy so that Americans with student debt can get a job to repay the loans they chose to accept.","en","","43","5"],["1105988828572069889","1105980449652949002","1552523259","Janet Stevenson","JanetSt0831",false,"bradleydevlin AOC",false,"1) I am 50 years old. I made a conscious decision 10 years ago to go to college while working full time and living a normal life.  Husband, stepchildren, mortgage, etc. I will graduate in May. Then the debt payoff begins.","en","","2","2"],["1105989407868362752","1105980449652949002","1552523397","Janet Stevenson","JanetSt0831",false,"bradleydevlin AOC",false,"2) No one else is responsible for paying my debt. I chose it, it is my responsibility.  I don’t want handouts or charity.  I am an American. I work for what I have and my stepchildren are learning the meaning of “if you don’t work, you don’t eat”.","en","","2","2"],["1105989927827836929","1105980449652949002","1552523521","Janet Stevenson","JanetSt0831",false,"bradleydevlin AOC",false,"3) We don’t tolerate lazy.  Lazy did not found the country. Lazy did not win two World Wars. Lazy did not survive the Great Depression.  Hard work, dedication, and determination. That is what has made this country great.  That is what will keep us free.","en","","2","2"],["1105990710094974976","1105980449652949002","1552523708","Janet Stevenson","JanetSt0831",false,"bradleydevlin AOC RepAOC",false,"4) So @RepAOC @AOC you can keep your socialist plans for free everything. It isn’t how we do things here.  You will never convince hard working, patriotic, and loyal Americans to allow you to destroy us ir our nation. #NeverSocialist","en","/RepAOC /AOC /hashtag/NeverSocialist?src=hash","2","1"],["1106321609688670208","1105980449652949002","1552602600","Eric Paine","jrpaine",false,"AOC",false,"Don't take on unmanageable college debt:\n\n-Work to get an academic scholarship.\n-Stay home while attending, if possible\n-Transfer after going to community college for 2 yrs (no need for an exclusive, expensive school)\n-Work summers, nights, and weekends\n-Take longer to finish","en","","69","4"],["1106413347870695424","1105980449652949002","1552624472","David Steinberg","dmsclemson",false,"jrpaine AOC",false,"Don’t go to an overly expensive school...  get a degree in something that has good salary potential upon graduation...  take co-op positions while in school to earn money and experience while there...","en","","47","3"],["1107373041221357568","1105980449652949002","1552853281","Ugly Sam","gimme_a_kisss",false,"dmsclemson sreuling jrpaine AOC",false,"Mr Clemson: you’ve got horse sense.","en","","",""],["1106209912151891969","1105980449652949002","1552575970","Spencer Shanson","spencershanson",false,"AOC GOP",false,"I agree with your point about @GOP hypocrisy.\nBut I don’t understand why you think it’s OK to buy something you can’t afford and then be told that everyone will pay for it for you instead.\nWill the taxpayer pay off my mortgage for me? Or my credit card bills?","en","/GOP","27","2"],["1106274455796342784","1105980449652949002","1552591358","pastazor♍️","Flygirl0916",false,"spencershanson AOC GOP",false,"Because getting an education makes society better, and requiring new graduates to fork over 1/2 of their income isn’t good for the economy","en","","15","1"],["1106419117962059776","1105980449652949002","1552625848","Spencer Shanson","spencershanson",false,"Flygirl0916 AOC GOP",false,"I agree. Education is good. The problem is it costs too much. But saying “go ahead and buy it because someone else will pay it for you” is a terrible life lesson.","en","","9","1"],["1106025026464202752","1105980449652949002","1552531889","Kris Chandler","KrisChandler5",false,"AOC",false,"Why cant the students pay back their loans? I did. So the American tax payer has to pay back their loans for them? I dont think so. Its called working honey.","en","","53","2"],["1106058538097565701","1105980449652949002","1552539879","michael saltzman","coachsaltydog",false,"KrisChandler5 AOC",false,"Do they drug test at the capital? She’s on some good stuff! Clearly it sends your mind to another galaxy!","en","","25","1"],["1106201203640320001","1105980449652949002","1552573893","Kris Chandler","KrisChandler5",false,"coachsaltydog AOC",false,"Lol","und","","3",""],["1106137307873198080","1105980449652949002","1552558659","SUSAN BRANCH","dearsusanbranch",false,"AOC sagecottage",false,"What they mean when they say there isn't enough-- for education, healthcare, infrastructure etc, it's because they would rather spend OUR money on subsidizing billionaires. Which the tax cut did. #GOP","en","/hashtag/GOP?src=hash","154","7"],["1106391134706810880","1105980449652949002","1552619176","Steven Wallman","StevenWallman",false,"dearsusanbranch AOC sagecottage",false,"Susan are you really that dumb?  Do you understand the definition of subsidy?  If I take less in taxes from you this year am I now subsidizing you?  It is simple math when you provide a tax cut those that pay the most get the biggest benefit.  Jealousy is an ugly emotion.","en","","1",""],["1106563217092829186","1105980449652949002","1552660204","Christie Levin","christielevin50",false,"StevenWallman dearsusanbranch AOC sagecottage",false,"Mr. Wallman, I wonder if it makes you feel better about yourself somehow to discuss serious subjects in so judgemental, arrogant, supercilious, narrow-minded, and rude a way (for starters).  I feel so sad for your mother, and I pray you aren't married.","en","","3",""],["1106563887334334464","1105980449652949002","1552660364","SUSAN BRANCH","dearsusanbranch",false,"christielevin50 StevenWallman AOC sagecottage",false,"He talks to strangers like that, imagine how he treats the women in his life. He told someone else on his page to stop spreading hate. I think someone has a little hypocrisy problem to confront. It's okay, that's why we were born, to live, to learn, to find a better way.","en","","3","1"],["1106407087100313601","1105980449652949002","1552622980","⚾️Matt Veasey🇺🇸","MatthewVeasey",false,"AOC","true","Yo, AOC...how about anyone who has already paid off their debt themselves through hard work over time? We get that money back from your socialist government? How about folks 2-3-5-10 years down the road? “Free” college for everyone? Absolutely zero common sense. Keep dancing. pic.twitter.com/JC4TiEX3cY","en","https://t.co/JC4TiEX3cY","38","4"],["1106502809497804800","1105980449652949002","1552645802","NDJ","Fncysafetyshoes",false,"MatthewVeasey AOC",false,"The dancing looks like her thoughts.....spinning out of control!","en","","23",""],["1105984046771986432","1105980449652949002","1552522119","--","BLTTTTTTTT",false,"AOC",false,"I paid off my student loan debt after 10 years of working. Why do these people younger than me who willingly took out these loans deserve loan forgiveness?","en","","67","3"],["1106014066487644160","1105980449652949002","1552529276","Joe Dykstra","primarydenizen",false,"BLTTTTTTTT AOC",false,"\"nothing is good unless its benefitting me\" yet we're the entitled ones","en","","24","1"],["1106352894695989248","1105980449652949002","1552610059","Stephen Jen","stephenjenprime",false,"primarydenizen BLTTTTTTTT AOC",false,"I think @BLTTTTTTTT likely meant if people were able to get out of debt through hard work why can’t others, which is one of the main points of this discussion","en","/BLTTTTTTTT","6",""],["1106378748276981764","1105980449652949002","1552616223","--","BLTTTTTTTT",false,"stephenjenprime primarydenizen AOC",false,"Higher education should definitely be more accessible and affordable, but wiping out a generation's debt so they can buy more craft beer and avocados isn't going to help fix it.","en","","4",""],["1106379792151011329","1105980449652949002","1552616472","Joe Dykstra","primarydenizen",false,"BLTTTTTTTT stephenjenprime AOC",false,"or ya know, so they could afford to buy houses, have kids, or retire","en","","1",""],["1106708887971856384","1105980449652949002","1552694935","Stephen Jen","stephenjenprime",false,"primarydenizen BLTTTTTTTT AOC",false,"Does this play into people’s perception of entitlement?  This tweet seems to mention things that people work really hard to acquire, with or without student loans","en","","4",""],["1106725289424379904","1105980449652949002","1552698845","Joe Dykstra","primarydenizen",false,"stephenjenprime BLTTTTTTTT AOC",false,"The difference being millennials work really hard but instead of being able to save up the money they earn for the first ten or fifteen years of their career it all goes into paying ludicrously high student loan payments.","en","","",""],["1106810011106197504","1105980449652949002","1552719044","Stephen Jen","stephenjenprime",false,"primarydenizen BLTTTTTTTT AOC",false,"Seems like part of the solution should be to allow borrowers to refinance at a lower interest rate and to have programs that increase knowledge/awareness of loan terms and payment plans","en","","3",""],["1105984145078059008","1105980449652949002","1552522143","Bucky","BuckyBuckeye8",false,"AOC",false,"And what would you do for people that already paid off their student loans?","en","","15","2"],["1105986826467074048","1105980449652949002","1552522782","Not John Barron","NotJohnBarron",false,"BuckyBuckeye8 AOC",false,"Nothing. And we shouldn’t expect anything. This isn’t about those of us who have paid them off. It’s about helping a generation get a step up. Kind of a GI Bill for the public. I think it does need some limits and controls, but I’m not going to begrudge benefactors of this.","en","","45",""],["1105989637334622208","1105980449652949002","1552523452","TheG","TheG21688195",false,"NotJohnBarron BuckyBuckeye8 AOC",false,"Some people don't like anyone getting something when they don't. They're the types to step on children to get free ice cream or free samples at Costco...","en","","14",""],["1105991002945314818","1105980449652949002","1552523778","Da Reis","penjam0",false,"TheG21688195 NotJohnBarron BuckyBuckeye8 AOC","true","Damn TheG! you've seen this happen? That's phuhked up if true...\nKinda like #Costanza pushing elderly and the kids out of the way on #Seinfeld pic.twitter.com/rOlUtozdNh","en","/hashtag/Costanza?src=hash /hashtag/Seinfeld?src=hash https://t.co/rOlUtozdNh","3",""],["1106011521979551744","1105980449652949002","1552528670","Not John Barron","NotJohnBarron",false,"penjam0 TheG21688195 BuckyBuckeye8 AOC",false,"I got mine, go fu** yourself.\n\n—Republicans","en","","2",""],["1106253604783079424","1105980449652949002","1552586387","jimBeamer","jimBeamer13",false,"AOC",false,"AOC, I killed myself in college not to take out loans.  Can I just have the 30k?","en","","56","1"],["1106281523785932800","1105980449652949002","1552593043","BearNJ","jimbearNJ",false,"jimBeamer13 AOC","true","So called  tax scam for rich made an extra mortgage and car payment for me. Real money. Why are tuitions outpacing Inflation? Why not hold schools accountable? https://www.usatoday.com/story/college/2017/06/09/private-college-tuition-is-rising-faster-than-inflation-again/37432483/ …","en","https://t.co/2xmNLZJYRn","13","1"],["1105985220430446592","1105980449652949002","1552522399","Brick City Comics","BrickComics",false,"AOC",false,"In your plan do I get any money back for my student loans that I paid back in full over 10 years and working 2 jobs?","en","","85","6"],["1106017710465400832","1105980449652949002","1552530145","Geoff Ujdur","Gpu84",false,"BrickComics AOC",false,"Has every government policy ever created ever benefited 100% of people in the USA?","en","","8",""],["1106022054183165952","1105980449652949002","1552531181","William B. Fuckley","opinonhaver",false,"Gpu84 BrickComics AOC",false,"Yeah the argument here is basically ‘I had a bad experience so how dare you improve things for other people.’","en","","7",""],["1106023835671900161","1105980449652949002","1552531606","Brick City Comics","BrickComics",false,"opinonhaver Gpu84 AOC",false,"Who’s bad experience, I upheld my end of the agreement no complaints? When you agree to a loan one side puts up the cash for you and you pay it back. This does nothing to teach responsibility, bailouts won’t always get you out of irresponsible borrowing.","en","","2",""],["1106024115167596546","1105980449652949002","1552531672","William B. Fuckley","opinonhaver",false,"BrickComics Gpu84 AOC",false,"You’re right, we should never fix or improve anything because people wouldn’t learn ~responsibility~ lol","en","","7",""],["1106026027782991874","1105980449652949002","1552532128","Brick City Comics","BrickComics",false,"opinonhaver Gpu84 AOC",false,"It’s an extremely one sided policy that aims to only help one very specific age group and provides a large financial payoff for lenders with no plan attached for future student debt or lending practices.","en","","1",""],["1106026518642221056","1105980449652949002","1552532245","William B. Fuckley","opinonhaver",false,"BrickComics Gpu84 AOC",false,"if we're ever in a position where forgiving all student debt is a realistic possibility, i can't imagine tuition free college isn't on the table as well.","en","","4",""],["1106050329110564864","1105980449652949002","1552537922","Brick City Comics","BrickComics",false,"opinonhaver Gpu84 AOC",false,"Can’t agree on one without the other or it will be for nothing for future students. Nothing about tuition free college was mentioned in the either of the original tweet.","en","","",""],["1106059604100857856","1105980449652949002","1552540133","Luke Sampe","LukeSampe",false,"AOC",false,"As long as I get a refund for all 120 payments I made on time and in full.","en","","41",""],["1106151742939561984","1105980449652949002","1552562101","Area609Joe","area609joe",false,"LukeSampe AOC",false,"school i went to costs 4x what it does now. wage growth has stagnated... what was affordable just 15 years ago isn’t now, sadly.","en","","10",""],["1106178279407390720","1105980449652949002","1552568428","GnoMoore","SurvatiToula",false,"area609joe LukeSampe AOC",false,"They can't hear you.. they literally only care about their own experience not accounting for how it has changed for others. Amazing how bad at being selfish Americans are. We all benefit when we aren't in debt.","en","","9","1"],["1106254506436845571","1105980449652949002","1552586602","Area609Joe","area609joe",false,"SurvatiToula LukeSampe AOC",false,"the experience has changed and it’s dividing the country. no longer does hard work grant a pathway to the middle class.  now it’s how much your parents make. if wage growth kept up with the debt this would not have been an issue. wage growth hasn’t even kept with inflation.","en","","8",""],["1106172870294675456","1105980449652949002","1552567138","FatalDeviation","fataldeviation",false,"AOC",false,"I have no one problem paying off my loans. I knew what I was doing when I accepted them. What I have a problem with is the predatory interest rate. My student loans are at 6.5% (2x interest on my car, mortgage is 4%). The gov needs to stop treating students as profit centers.","en","","66","1"],["1106173547649605632","1105980449652949002","1552567300","FatalDeviation","fataldeviation",false,"AOC",false,"Not to mention the interest capitalizing, then you pay interest on the interest. I’ve paid tens of thousands of dollars into my student loans, only to have the principal amount barely move. It’s nearly impossible to get ahead of it.","en","","26",""],["1106336859041468417","1105980449652949002","1552606236","WindsorKnot","WinsorKnotTie",false,"fataldeviation AOC",false,"Which is why she’s a phony.  The feds LOVE their student loan racket.  Great way to tax young poor ppl w/o admitting it.  Expect more student debt, higher tuition —not forgiveness.","en","","1","1"],["1106369607210856448","1105980449652949002","1552614044","XRPZilla","ZillaDaKilla316",false,"AOC",false,"So we’re just supposed to forgive all student debt and give free education to everyone, and expect to not raise taxes tremendously ?  Yeah, Ok, good luck with lowering the national debt and keeping citizens happy with astronomically high taxes by doing that!!","en","","19","1"],["1106370432402419712","1105980449652949002","1552614241","Crypto Entropy","Crypt0Entropy",false,"ZillaDaKilla316 AOC",false,"Still don’t understand why we are supposed to forgive their debt? I gladly paid off all $83,000 of my student loan. Took a long time. Should we forgive home loans too? What a crock.","en","","19","1"],["1106372015391428608","1105980449652949002","1552614618","XRPZilla","ZillaDaKilla316",false,"Crypt0Entropy AOC",false,"Yeah man, it is a major crock! While we’re at it let’s give refunds to every other person who has gone to college previously too as it won’t be fair to those who’ve already paid.  While we’re at it it wouldn’t be fair to only give them money, so why not give everyone $ just cuz.","en","","8",""],["1105983228786208768","1105980449652949002","1552521924","Political Patty","handi817",false,"AOC",false,"Our kids are suffering. I know I'm not alone. Where are the parents as outraged as I am. Our kids are paying loans rather than buying homes, or getting married or buying cars. They have no $$ to rent their own apartments. They have their degree and their debt","en","","61","1"],["1106017381778968578","1105980449652949002","1552530067","OJ Bollinger","ojbollinger",false,"handi817 AOC",false,"They willingly took the loan knowing they’ll have to pay it back. Whose fault is that?","en","","30","1"],["1106020495651164161","1105980449652949002","1552530809","Political Patty","handi817",false,"ojbollinger AOC",false,"They had a sense that the market would pay them enough but it doesn't. The nurses, yes, even though the loans are high they are not suffering like the rest","en","","12",""],["1106032738656759813","1105980449652949002","1552533728","OJ Bollinger","ojbollinger",false,"handi817 AOC",false,"Just curious. What are their degrees in exactly?","en","","10",""],["1106170128864083968","1105980449652949002","1552566485","Buburubu","Badababa",false,"ojbollinger handi817 AOC",false,"Possibly a breadth of learning and becoming generally more conscientious people and better citizens rather than being solely and exclusively concerned with climbing out of the hole they didn’t know the market would punitively lock them in.  Is that your thrust?","en","","5",""],["1106213504481193986","1105980449652949002","1552576826","Political Patty","handi817",false,"Badababa ojbollinger AOC","true","Well said. They don't really understand what was done to impune them. I must have filled out a dozen applications and loans for others and natural children whose only hope was to manage in the working world and without a degree it is very difficult. It should be easier pic.twitter.com/vrf0AsIqGw","en","https://t.co/vrf0AsIqGw","1",""],["1106215050317103106","1105980449652949002","1552577195","OJ Bollinger","ojbollinger",false,"handi817 Badababa AOC",false,"Remember when a HS diploma would open lots of doors in the job market?  The reason was because not everyone had one. Now it means very little because 98% have one and college is pushed. What do you think happens when everyone has a college degree?","en","","1",""],["1106215322636435456","1105980449652949002","1552577260","Political Patty","handi817",false,"ojbollinger Badababa AOC",false,"We have a smarter country","en","","4",""],["1106223032094388225","1105980449652949002","1552579098","Epharian","borchard76",false,"handi817 ojbollinger Badababa AOC",false,"That would be nice if it were true, but a lot of diplomas aren't worth the paper they are printed on.  Oh you have a BA in Psychology?  Either get an MS/MA/PhD or prepare to have no money in 99% of cases.  A BA in psych is not really more valuable than a BA in Gen studies.","en","","3",""],["1106232496247717888","1105980449652949002","1552581354","Buburubu","Badababa",false,"borchard76 handi817 ojbollinger AOC",false,"Interesting.  She said “smarter” and you automatically and apparently unconsciously replaced it with “valuable” and carried on as if they were even similar.\n\nFor someone who sees no value in psychology, yours might be worth examining.","en","","1",""],["1106234093354840064","1105980449652949002","1552581735","Epharian","borchard76",false,"Badababa handi817 ojbollinger AOC",false,"I speak from experience. I have a degree in psychology.  Two actually.  This platform is bad for nuance.  Being smarter and being more valuable are not the same, no, but one could argue that education and smarter aren't the same either.","en","","3",""],["1106235108082761729","1105980449652949002","1552581977","Buburubu","Badababa",false,"borchard76 handi817 ojbollinger AOC",false,"Fair to say.  But whether an individual degree path is worthwhile or not, I’ve yet to meet a liberal arts grad who wasn’t more aware of the world and a better equipped citizen and voter for having gone.  Higher earning employee?  Maybe, maybe not.","en","","1",""],["1106235504939417601","1105980449652949002","1552582071","Epharian","borchard76",false,"Badababa handi817 ojbollinger AOC",false,"Sadly, while I loved my liberal arts degree, it hasn't done much for my finances.","en","","2",""],["1105985416539234304","1105980449652949002","1552522446","Sean Choi","seancpdx",false,"AOC",false,"Instead of debt forgiveness, how about devoting more resources to education about debt and personal responsibility instead?","en","","155","6"],["1105991887779975168","1105980449652949002","1552523989","ATX-MART","ATX_fight_club",false,"seancpdx AOC",false,"Or encourage more kids to go to trade school, or join the military.  We only need so many Masters in Gender Studies majors.","en","","101","3"],["1105994343280754690","1105980449652949002","1552524574","Robert","elevatorgodva",false,"ATX_fight_club seancpdx AOC",false,"Or economics majors who think earners keeping more of what they earned equals a government expenditure.","en","","9","1"],["1105994872236974080","1105980449652949002","1552524700","ATX-MART","ATX_fight_club",false,"elevatorgodva seancpdx AOC",false,"Starting to wonder if she cheated somehow to get that degree.  Explains the bartending.  Couldn’t pass the sniff test in an interview for a job in finance.","en","","11","1"],["1106001098299576321","1105980449652949002","1552526184","Robert","elevatorgodva",false,"ATX_fight_club seancpdx AOC",false,"Probably got her degree the same way Kamela Harris got her first government job.","en","","7","1"],["1106007694270439424","1105980449652949002","1552527757","Sylvanaqua Farms","SylvanaquaFarms",false,"elevatorgodva ATX_fight_club seancpdx AOC",false,"You two gonna make out now?","en","","18","1"],["1106320082047774721","1105980449652949002","1552602236","Robert","elevatorgodva",false,"SylvanaquaFarms ATX_fight_club seancpdx AOC","true"," pic.twitter.com/H8V50oCl5G","und","https://t.co/H8V50oCl5G","",""],["1106326813385601026","1105980449652949002","1552603841","Sylvanaqua Farms","SylvanaquaFarms",false,"elevatorgodva ATX_fight_club seancpdx AOC",false,"I appreciate the effort, but if they were Trump protesters they’d probably be a bit slimmer... what with all the vegan diets and yoga and such. This picture was more likely taken in the “bear suite” at Mar a Lago by POTUS himself as part of his screening for his next SCOTUS pick.","en","","1",""],["1105989065562824705","1105980449652949002","1552523316","Skywalker","BW_1970",false,"AOC",false,"And the Socialist continues to award those that have made bad decisions in life...I mean who thought that there would be a paying job at the end of a dead languages degree...or how about a general liberal arts degree...but hey let the taxpayers pay for it....","en","","42","4"],["1105991433327009792","1105980449652949002","1552523880","Kristina BABIES Lives MATTER","havameow",false,"BW_1970 AOC",false,"AGREED","en","","4",""],["1105993101888446466","1105980449652949002","1552524278","Skywalker","BW_1970",false,"havameow AOC",false,"If @AOC is representative of our younger generation we need to scrap public education because it has failed","en","/AOC","10","3"],["1106048475358097408","1105980449652949002","1552537480","Kristina BABIES Lives MATTER","havameow",false,"BW_1970 AOC",false,"So intelligent you are","en","","2",""],["1105993310865260544","1105980449652949002","1552524328","Secular Citizen #Resister","secularcitizen2",false,"AOC",false,"America lags behind the rest of the world in nearly every measurable metric. For a country that loves to pretend we're the best at everything, we sure seem to betray that concept when other countries have proven to succeed in ways we dismiss.","en","","53","18"],["1106027975038791681","1105980449652949002","1552532592","Mary Johanna","MaryJohanna6",false,"secularcitizen2 AOC",false,"The first thing I learned when I immigrated to America:\"if it ain't broke don't fix it\" and that's why other industrial nations passed them because they consistently fix & tinker while attending free college or doing apprenticeships ","en","","1",""],["1106235092530282496","1105980449652949002","1552581973","Kathy Soltani🍊","KathySoltani",false,"AOC",false,"Cost of abdicating personal responsibility? Insurmountable. Barkeep?  Bring us a lunch menu and a round of Stellas.  Thanks! #RedAwaken #MAGA","en","/hashtag/RedAwaken?src=hash /hashtag/MAGA?src=hash","20","21"],["1106236226410082304","1105980449652949002","1552582243","Toni Ann 🇺🇸❤🇺🇸❤","NJ_2_FL",false,"KathySoltani AOC",false,"Bud light lime for me please. ","en","","4",""],["1105992314160332801","1105980449652949002","1552524090","Janet Iadanza","mshalo18",false,"AOC",false,"I wanted to go to NYU, and I was accepted. Ended up going to city and state schools bc that’s what I could afford. People make some bad decisions & incur way too much student loan debt, and in many cases they don’t even have a career path in mind. Why is that my responsibility?","en","","28","2"],["1106002848779829249","1105980449652949002","1552526602","Steven Trimmer","trimmerfund",false,"mshalo18 AOC",false,"Same here. I even was offered a $10K scholarship, on $40K tuition. Ended up doing SUNY and CUNY and graduating with a 3.8 and less than $20K in debt. Paid it off in 2 years. Financial Illiteracy is a major problem in today's society.","en","","15",""],["1105983044450766849","1105980449652949002","1552521880","Clay Spence 🔷","fancy_spancy_22",false,"AOC",false,"There is no “cost” to tax cuts you illiterate moron. People get to keep more of their own money.","en","","46","6"],["1106404004609826816","1105980449652949002","1552622245","MinMax 🇩🇴","RealMinMax",false,"AOC",false,"I'd rather take responsibility of my own loans, pay them off in my own time, and do it without being a detriment to those around me and those currently financially ahead of me. Maybe I'm just old fashioned, but I dont want a handout. Good luck to those who need their hand held.","en","","43","5"],["1106003321922293760","1105980449652949002","1552526715","Alan Parker #MMT - The Neoliberalism Destroyer","Truman_Town",false,"AOC","true","Dr. Jane Sanders sits down with economist Dr. Stephanie Kelton to talk about the macroeconomic effects of student loan debt cancellation in the United States. https://youtu.be/GIo-5d4xBlQ ","en","https://t.co/INxmv6x2ku","16","12"],["1106065905644113921","1105980449652949002","1552541636","James S. Henry, Esq.","submergingmkt",false,"AOC CHHolte",false,"Pls get nums straight. 25mm x $30k = $750b. And why cancel all at once? Just have FedGov assume all bona fide student debt ovr the life of loans, at Fed borrowing rate (eg 2.8% nom vs students 9%)...ANNUAL gross amort=< $150b! Int saving alone =7% x $750 = $52b/yr.","en","","26","5"],["1106180275615268864","1105980449652949002","1552568904","James S. Henry, Esq.","submergingmkt",false,"AOC CHHolte",false,"“But you are a #”socialist!” A: “If it is #”socialist” to use gov to solve big probs for ord ppl + fight just wars on poverty+ignorance+climate ch +injustice+old age+disease+banksters, +support arts+parks+explore the universe, then gdstraight: I am #”socialist.” And so are YOU!”","en","","10","2"],["1106198210840748032","1105980449652949002","1552573180","Olaf J. Ogland","platoinCT",false,"submergingmkt AOC CHHolte",false,"The plutocratic minority, driven by envy and fear, will use explosive tropes to try to destroy anyone w/ real human gifts - a practice akin to cartoon anarchists w/ little round bombs, but who at least were sincere.\n\nThe 'anti-socialists' are greedy, invidious, and wholly false.","en","","1","1"],["1106387971660492800","1105980449652949002","1552618422","andrew katz","andrewkatz4",false,"platoinCT submergingmkt AOC CHHolte",false,"They’re pretty accurate tropes.","en","","1",""],["1106580457439809536","1105980449652949002","1552664314","Olaf J. Ogland","platoinCT",false,"andrewkatz4 submergingmkt AOC CHHolte",false,"They try their best to destroy accurately.","en","","1","1"],["1106590201986641922","1105980449652949002","1552666638","andrew katz","andrewkatz4",false,"platoinCT submergingmkt AOC CHHolte",false,"Would you not say you’re engaging in similar activity (e.g. “plutocratic minority driven by envy and greed”) ?","en","","",""],["1106610605136535554","1105980449652949002","1552671502","Olaf J. Ogland","platoinCT",false,"andrewkatz4 submergingmkt AOC CHHolte",false,"I would not.\n\nBut your logic is noteworthy: \"if he is too, then he can't criticize others who are:\" \n\nyou are then conceding that THEY are, which perhaps you hadn't noticed.","en","","2","1"],["1106733277661052928","1105980449652949002","1552700750","andrew katz","andrewkatz4",false,"platoinCT submergingmkt AOC CHHolte",false,"Point taken. But your initial attack was based on motive. Your own motive would be relevant.","en","","",""],["1106769710727745536","1105980449652949002","1552709436","Olaf J. Ogland","platoinCT",false,"andrewkatz4 submergingmkt AOC CHHolte",false,"Observation","en","","1",""],["1106173723235672065","1105980449652949002","1552567341","Sarah🌊","Sarah_SKG_1983",false,"AOC",false,"I get tired of the intellectual dishonesty that goes on with the GOP daily. Any reform designed to help middle class Americans is described as “Socialist”. Now that @AOC is in the House, this word is being bandied like it’s the latest dance craze or something.","en","/AOC","101","30"],["1106174283972308994","1105980449652949002","1552567475","AmieMW","AmieMcWayne",false,"Sarah_SKG_1983 AOC",false,"Totally. The GOP own that slide rule and they’re moving it to the left to suit their needs. They are all liars.","en","","1",""],["1106174542458687493","1105980449652949002","1552567537","Sarah🌊","Sarah_SKG_1983",false,"AmieMcWayne AOC",false,"Instead of discussing real issues, the GOP attacks Democrats over things that were manipulated, distorted, and taken out of context.","en","","1",""],["1106174769177726976","1105980449652949002","1552567591","AmieMW","AmieMcWayne",false,"Sarah_SKG_1983 AOC",false,"It’s all the GOP have, they certainly don’t have the truth on their side.","en","","",""],["1108424115315200000","1105980449652949002","1553103877","BC","Guitarlover67",false,"AOC",false,"So, again, this is something you would raise taxes to accomplish. I have enough of my money going to you morons to be wasted. Why should I have to pay more for people to get out of debt that they put themselves in?","en","","29","27"],["1108525779921633286","1105980449652949002","1553128116","Denise Rau","raudrau",false,"Guitarlover67 AOC",false,"Maybe your parents were able to pay your tuition?","en","","",""],["1106174390964641792","1105980449652949002","1552567501","Christopher Nathan Mason","mason4922",false,"AOC","true"," pic.twitter.com/uzN9OymTIi","und","https://t.co/uzN9OymTIi","21","17"],["1106180038171467777","1105980449652949002","1552568847","Cassandra/Resist","Cassand29017794",false,"mason4922 LCARS_24 AOC","true"," pic.twitter.com/ULS2cPsQB8","und","https://t.co/ULS2cPsQB8","1",""],["1106082313018986496","1105980449652949002","1552545548","Black Panther Peeps","godofwine77",false,"AOC",false,"They realize the elimination of #studentloan debt and how it would benefit society and our economy. People who are hamstrung on debt can't buy anything. You free up the debt, people can afford to live, they put the money back into the #economy. Stop giving cuts to billionaires","en","/hashtag/studentloan?src=hash /hashtag/economy?src=hash","43","3"],["1106243034901934080","1105980449652949002","1552583867","Shellee Landsberger","Samijo61Shellee",false,"godofwine77 AOC",false,"Agreed. Lets build the economy rather than government chosen lending institutions.","en","","3",""],["1106344676309811200","1105980449652949002","1552608100","elephantsgerald","elephantsgerald",false,"Samijo61Shellee godofwine77 AOC",false,"We gave millionaires more than we’ll make from student loans. Where’s the outrage.","en","","3",""],["1106431824694255616","1105980449652949002","1552628878","Mom, R.N.","MomRN9",false,"elephantsgerald Samijo61Shellee godofwine77 AOC",false,"There's no outrage because it's not true. The only ones \"outraged\" are losers consumed by envy.","en","","1",""],["1106383599878750210","1105980449652949002","1552617380","nathanprows","homeskillet777",false,"AOC",false,"I’m not rich and I benefited from the tax break. I also paid my school loans in full and on time per the agreement I signed when I took them out for my education. Lest you say it was my privilege, I was the first in my family’s history to graduate college. #hardworkpaysoff","en","/hashtag/hardworkpaysoff?src=hash","15","1"],["1106386760471404544","1105980449652949002","1552618134","nathanprows","homeskillet777",false,"AOC benshapiro",false,"In case questions linger...my dad stocked groceries and my mom worked at a fast food restaurant when I was born. They raised 3 boys, completed their own degrees, and paid their way. @benshapiro #thiscanpreach","en","/benshapiro /hashtag/thiscanpreach?src=hash","10","1"],["1107331811074555905","1105980449652949002","1552843451","crosby spencer","crosbyspencer1",false,"AOC",false,"So I have to pay for my college AND your college?","en","","28","1"],["1107340794317295616","1105980449652949002","1552845593","Nancy","NancyDelthia",false,"crosbyspencer1 AOC",false,"Only if you choose to work, by @AOC  standards.","en","/AOC","7",""],["1106910255596949504","1105980449652949002","1552742944","Bill Wilhelm","gwwilhelmjr",false,"AOC",false,"The left pretend as the party of fairness but are extraordinarily dim thinkers. \n\nHow fair is it for waiters, construction workers and others who didn’t get to college to have to pay taxes to pay off college debt for ’poets’ who drive Uber and unemployed feminist studies experts?","en","","11","3"],["1107355708343881728","1105980449652949002","1552849149","jim chambers","jimchambers2",false,"AOC",false,"it's called a loan for a reason you simple-minded ignoramus! just like if you fail to pay it back you are considered a bad credit risk. they got the benefit of the education, now it's time to pay back the benefactor.","en","","2","3"],["1107364939646357510","1105980449652949002","1552851350","Nikita marie","Nikitam37415117",false,"jimchambers2 AOC",false,"Not to mention we are not responsible for other kids debts. Hold the universities overpaying their professors with the money they are making off of organized sports responsible for excessive costs.","en","","2",""],["1107366952568143872","1105980449652949002","1552851830","Newspeaktogo","cpzimmon",false,"Nikitam37415117 jimchambers2 AOC",false,"Not to mention the leftist indoctrination that those kids get from their communist professors. I’m not paying to ruin my own country. AOC in a mindless twit!","en","","2","1"],["1107370280924708865","1105980449652949002","1552852623","Nikita marie","Nikitam37415117",false,"cpzimmon jimchambers2 AOC",false,"You are 100% right!","en","","1",""],["1107376633089011712","1105980449652949002","1552854138","michael d young","michaeldyoung1",false,"AOC",false,"I'm unaware of anyone that has been forced to take out a student loan, but the government sure as hell forces me to hand over my money, so the more of it Trump lets me keep the better.","en","","17","1"],["1107471285456502784","1105980449652949002","1552876704","X Fair and Transparent Govt X","patrici59152026",false,"michaeldyoung1 AOC",false,"Exactly","en","","1",""],["1107333055671349260","1105980449652949002","1552843748","Proactive Preppers👍🇺🇲🐘","proactivePrep",false,"AOC",false,"AOC you need to Sue whatever college you got your economics degree from","en","","21",""],["1107357131232165889","1105980449652949002","1552849488","MD Cooks","MDCooks",false,"proactivePrep AOC",false,"And the Millieniaks are worried about climate change when the gave leadership like AOC leading them astray to starvation...","en","","3",""],["1107390042375282693","1105980449652949002","1552857335","Original Sconnie 🧀","corrcomm",false,"AOC",false,"Fine. I don't want to pay off a loan someone else took on to buy something they wanted to benefit their own lives.\n\nYou got me.","en","","8","4"],["1107594682194948096","1105980449652949002","1552906125","Maria Gillette","mariapa1776",false,"corrcomm BeanfromPa AOC",false,"You'd think they'd learn....college=scam","en","","1",""],["1106713659533938689","1105980449652949002","1552696072","Lorenzo VonMaterhorn","RocketOrrGretz",false,"AOC",false,"Meanwhile I have been paying mine for 20 years. Sorry pay your debts don’t expect government to do it for you.","en","","11","1"],["1106719664258908160","1105980449652949002","1552697504","druggedzebra","druggedzebra",false,"RocketOrrGretz AOC",false,"Cant wait for my $30k bonus check to show up because I paid my bills...","en","","2",""],["1108571314250342401","1105980449652949002","1553138972","USCG Hawkeye Metalhead","PsychoMetalHed",false,"AOC",false,"How about getting a degree in something in demand in the marketplace where there's 1 million more jobs than people to fill them?  Activism, gender studies, art history, liberal arts, \"journalism\" (what it appears to be nowadays)... don't seem so hot.","en","","10","2"],["1106653273803546624","1105980449652949002","1552681675","Tech4hire","Tech4hireonline",false,"AOC",false,"EXPLAIN to me why tax payers should be on the hook for students bad choices? If you spend 100k for a Liberal Science Major and can only get a job as a Barista, why is that my problem? You don't need a degree to be successful. Don't take the loan if you can't pay it back.","en","","7","2"],["1108579256991473664","1105980449652949002","1553140865","Luke OBX","lukeobxx",false,"AOC",false,"Why forgive student loans? Life isnt free. Major in something that will pay the bills and people wont have student loan problems.","en","","7","2"],["1106922963205582849","1105980449652949002","1552745974","Claire H.","ClaireH30676183",false,"AOC",false,"You must have a lot of friends who have student loans. Maybe you will consider putting them on your payroll like you did with your boyfriend. Get real, you are starting to unveil yourself","en","","6","3"],["1106704991019024389","1105980449652949002","1552694006","Daniel Pelayo","DPelayolll",false,"AOC",false,"Can I get my house loan forgiven too? How do I get in on this free money?","en","","12","1"],["1106585140124401665","1105980449652949002","1552665431","Coach Sliwa","CoachSliwa",false,"AOC",false,"You cannot just forgive student loans.  That is not how economics works.  If you do that, the cost of education will simply rise.  Supply and demand.  Cost benefit analysis.  Ugh","en","","12","1"],["1107325473124700160","1105980449652949002","1552841940","monkeyglasses","monkeyglasses11",false,"AOC",false,"\"Cost of GOP Tax Cuts:\" $119 MORE each month in my take-home pay!!! (I realize you might think that's a pittance, but to us \"little peons\" it's a HUGE difference!!)\n\nStop lying to people!!\n\n#GetYourHandsOffMyMoney\n#LiberalismIsAMentalDisorder \n#WalkAwayFromDemocrats","en","/hashtag/GetYourHandsOffMyMoney?src=hash /hashtag/LiberalismIsAMentalDisorder?src=hash /hashtag/WalkAwayFromDemocrats?src=hash","4","6"],["1107088526586318850","1105980449652949002","1552785448","5280 Ron","kangarew113",false,"AOC",false,"Cost of @AOC green plan, 30 trillion.","en","/AOC","5","1"],["1107088906154053632","1105980449652949002","1552785538","5280 Ron","kangarew113",false,"AOC",false,"Current us debt, 22 trillion. Wake up.","en","","4",""],["1107383661379444738","1105980449652949002","1552855813","Mr Dirt","oldmanluvsmineo",false,"AOC",false,"I have paid my mine in full. Can I get a $100000 gift card?","en","","7","2"],["1107386456115277825","1105980449652949002","1552856480","Purple = #Squidley","S246278910",false,"oldmanluvsmineo AOC",false,"","und","","1",""],["1107589908900835328","1105980449652949002","1552904986","🔥🍒Bean🍒🔥","BeanfromPa",false,"AOC",false,"I don’t want to pay off OTHER PEOPLES LOANS OFF YOU DUMB BITCH","en","","9","2"],["1107592565291921408","1105980449652949002","1552905620","Maria Gillette","mariapa1776",false,"BeanfromPa AOC",false,"She's making more then I am, let these lefty loony commies pay off somebody else's loan themselves....you first dumb ass","en","","1",""],["1106585209082966016","1105980449652949002","1552665447","Shane Huffman","HuffdaddyShane",false,"AOC",false,"What’s gonna happen to the ppl that chose not to attend college because they didn’t see any way to pay for it, how you gonna make it up to them??","en","","16",""],["1107174213301866496","1105980449652949002","1552805877","Chris Cordes🇺🇸","Rabuuf",false,"AOC",false,"My question is, why is any of this the government’s problem? As government expands, liberty contracts.","en","","6","2"],["1107628015456907268","1105980449652949002","1552914072","Glen Kraig","g_kraig",false,"AOC","true","The reason you have become a laughing stock is that you speak without knowledge. The tax cuts put more money into the pockets of all taxpayers. pic.twitter.com/Yy1Zcs9WyX","en","https://t.co/Yy1Zcs9WyX","2","2"],["1107629177455415296","1105980449652949002","1552914349","❌ Gabby ❌ 😺🇺🇸😸 Nationalist (& yes I'm white)","realGabbygirly",false,"g_kraig AOC",false,"#IfSheOnlyHadABrain","und","/hashtag/IfSheOnlyHadABrain?src=hash","1",""],["1107630309187579905","1105980449652949002","1552914619","Glen Kraig","g_kraig",false,"realGabbygirly AOC",false,"How true, the key word being \"if.\" Democrats are like children, they would vote for Santa Claus as long as he gives them free gifts. Anyone wonder why Dems want to lower the voting age to 16?","en","","1","1"],["1106606547692634113","1105980449652949002","1552670535","DEATH","RoundWorldDeath",false,"AOC",false,"Cost of #AOC's \"education\" and welfare to patriotic American taxpayers:  $277,000.\nValue of #AOC's \"education\": ZERO","en","/hashtag/AOC?src=hash /hashtag/AOC?src=hash","6","2"],["1107457115768139781","1105980449652949002","1552873326","Duke","somethingldsay",false,"AOC",false,"I want my 30 year mortgage forgiven too! It's oppressing me.","en","","6","2"],["1107640771107307521","1105980449652949002","1552917113","Code Monkey","ClickLogical",false,"somethingldsay AOC",false,"Mortgages only oppress people of color. You’re white. You’re privileged to be paying that gorilla interest!","en","","1",""],["1106906211088285697","1105980449652949002","1552741980","ask the NSA: Unofficial dryland proxy for McAfee","ImDudeLiberty",false,"AOC",false,"Simple Sandy takes on \"numbers\" in todays special.","en","","1",""],["1106907861580435456","1105980449652949002","1552742374","Dread Pirate Calvin🎙","DarthCalvin",false,"ImDudeLiberty AOC",false,"Now I’m going to be hearing #SimpleSandySays every time she prattles on about anything...","en","/hashtag/SimpleSandySays?src=hash","2","1"],["1106934495209549825","1105980449652949002","1552748724","erik","e_nordin",false,"DarthCalvin ImDudeLiberty AOC",false,"#prattle deserves a hash tag as well.","en","/hashtag/prattle?src=hash","2",""],["1106934858427842566","1105980449652949002","1552748810","ask the NSA: Unofficial dryland proxy for McAfee","ImDudeLiberty",false,"e_nordin DarthCalvin AOC",false,"I agree!","en","","2",""],["1106876557262356482","1105980449652949002","1552734910","SlyFox07 🇺🇸","AggieSlyFox07",false,"AOC",false,"It isn’t a “cost” to let people keep their own property. It doesn’t belong to you.","en","","20",""],["1107326224622342145","1105980449652949002","1552842119","Hamm36","hamm36",false,"AggieSlyFox07 AOC",false,"Fact: incoming taxed, I use taxed income to buy property, then it is taxed, i use the same taxed income to buy materials and taxed on materials. I build a structure on my property, then it is taxed. Property values go up, because the building I built now my taxes go up.","en","","1",""],["1107410654774870016","1105980449652949002","1552862249","Stephanie Kienzle","dwightyoakamfan",false,"hamm36 AggieSlyFox07 AOC",false,"But according to morons like @AOC you're not taxed enough.","en","/AOC","",""],["1107433269539340292","1105980449652949002","1552867641","Hamm36","hamm36",false,"dwightyoakamfan AggieSlyFox07 AOC",false,"Thus the term taxed to death.","en","","1",""],["1107441911550394368","1105980449652949002","1552869701","Stephanie Kienzle","dwightyoakamfan",false,"hamm36 AggieSlyFox07 AOC",false,"And then you’re taxed after death to make sure your kids get a mere fraction of what you worked hard to amass your entire life.","en","","1",""],["1107328639182491649","1105980449652949002","1552842695","Ronald Ivey","itexasivey",false,"AOC",false,"What do we get a new body?  I worked and paid my way through college and a masters program. Started a family I was rewarded by being drafted. Spent next 30 yrs living where I was told and working at what I was told. Never even got a safe space a special loan a preference","en","","9",""],["1107470112204840960","1105980449652949002","1552876425","X Fair and Transparent Govt X","patrici59152026",false,"itexasivey AOC",false,"Ronald we have a bunch of men and women adult children who feel they are owed everything and shouldn't have to work for it. Happy hands are healthy hands . I was taught a shovel one size fits all. You got problems or anger issues dig. Work pays and everyone has to pitch in.","en","","2",""],["1106590153210892293","1105980449652949002","1552666626","Lisa","Lisa88436640",false,"AOC",false,"Why should other people have to pay for another’s debt? Why don’t we take responsibility for ourselves and pay off our own loans? I am a millennial with multiple degrees including two graduate degrees and guess what? They are paid off by my own hard work and sacrifice!","en","","6","1"],["1106681520960475137","1105980449652949002","1552688410","K.G.C.","cameronkgvi",false,"AOC","true","The liberty of a democracy is not safe if the people tolerated the growth of private power to a point where it becomes stronger than the democratic state itself. That in its essence is fascism: ownership of govt by an individual, by a group, or any controlling private power.” pic.twitter.com/KS6hG1KICg","en","https://t.co/KS6hG1KICg","3","2"],["1106625447507488768","1105980449652949002","1552675041","Joe Szczepanski","Blackadder1023",false,"AOC",false,"You cancel existing student loans, better be ready to write me a check for the student loans I already paid off for my daughter to go to school as well. #iwantminetoo","en","/hashtag/iwantminetoo?src=hash","5","1"],["1106635361059569666","1105980449652949002","1552677405","Darkside Dave","vanguardman",false,"AOC",false,"\"Cost\" implies that it was the govt's money. It wasn't. WE earned it. Now WE get to keep it.\n\nHow many Chuck E. Cheez tickets did you have to trade for that economics degree?","en","","4","2"],["1106598226537394178","1105980449652949002","1552668551","Ricky Flynn","rickyflynn24",false,"AOC",false,"Take an economics class","en","","13",""],["1108545784444784645","1105980449652949002","1553132885","d janko","djanko112",false,"AOC indebturedsrv2d",false,"AOC doesn't have a clue about economics. She would destroy entire financial system in under a year.","en","","4","2"],["1108575552242413574","1105980449652949002","1553139982","MZ","OLDFLACO",false,"AOC","true"," pic.twitter.com/C6zdp2xRLC","und","https://t.co/C6zdp2xRLC","6","1"],["1107588290520248320","1105980449652949002","1552904601","🔥🍒Bean🍒🔥","BeanfromPa",false,"AOC",false,"Gawd you are dumb... your constituents are even dumber apparently","en","","6",""],["1107592863855116288","1105980449652949002","1552905691","Maria Gillette","mariapa1776",false,"BeanfromPa AOC",false,"They didn't ask about her math skills in her audition","en","","2",""],["1107328352782708736","1105980449652949002","1552842627","JupiterNest","JupiterNest",false,"AOC",false,"Kinda like how Dems don't want to give Trump a few billion dollars to protect our country from illegals, drugs, human trafficking, disease, etc, etc.\nI guess the Dems have no will to protect this country. ..Smh","en","","2","2"],["1107352337662832641","1105980449652949002","1552848345","🇺🇸 Cris 🇵🇷","ThePatriot006",false,"AOC","true"," pic.twitter.com/n3UjxYkTxd","und","https://t.co/n3UjxYkTxd","3","1"],["1107449424173826049","1105980449652949002","1552871492","Ruben Vega","rubendelavega11",false,"AOC Photo59Smart",false,"What we need are more honest people, like the ones that got elected in November 6, 2018 elections!","en","","3","1"],["1107469283691364352","1105980449652949002","1552876227","Michael Messer","spiker5977",false,"AOC","true"," pic.twitter.com/uG5L33TgR7","und","https://t.co/uG5L33TgR7","3","1"],["1107411570387234817","1105980449652949002","1552862467","tim ❌(independent American Indian)","exdemtim",false,"AOC",false,"College is not tax payers problem to pay, you go-to college, pay for it yourself.\nTax breaks was for all, this is another lie you push.\nI don't want my tax dollars paying for some kid to go to college, they are not my problem","en","","3","1"],["1107367952460857344","1105980449652949002","1552852068","🇺🇸JAMIE🇺🇸","TWwg1wga",false,"AOC",false,"I can't believe that out of 10,000 actors/actresses they picked you... the others must've had an even lower IQ! Like .....you know what I mean?","en","","2","1"],["1107370555068444672","1105980449652949002","1552852688","🇺🇸JAMIE🇺🇸","TWwg1wga",false,"AOC",false,"Lmao!","ht","","1",""],["1106917726713335808","1105980449652949002","1552744726","Cherry Garza","GarzaCherry",false,"AOC",false,"Then I ask for the average of the student loan debt that is forgiven a gift from the government because I was responsible when I went to school and don’t have that debt! Not fair for us if we don’t get rewarded for being responsible! Just saying!","en","","4","1"],["1107328678252314624","1105980449652949002","1552842704","Julie ⭐️⭐️⭐️","julieannolson75",false,"AOC",false,"Your damn right we don’t want to do it you idiot freak! I paid my own way through college and worked 2 jobs! And then I continued to work extra hours to pay off my loan! The only SCAM is you the actress ! You were hired to be the mouthpiece for socialists/ communists ","en","","3","1"],["1106608281487925248","1105980449652949002","1552670948","betsy larson","legaleye_",false,"AOC",false,"@AOC. My student loan is at $48,000.00 for a two year paralegal degree. Can not find a career in my  field AND my school was bought out by another so now my school doesn't even exist any longer. Both well known colleges, @kaplanuniversity and @purdueuniversity! Diploma=worthless!","en","/AOC","2",""],["1107424234572337153","1105980449652949002","1552865487","Are Student Loans a Scam?","allyscimmer",false,"legaleye_ AOC",false,"Join our movement","en","","1",""],["1107459534098960384","1105980449652949002","1552873903","betsy larson","legaleye_",false,"allyscimmer AOC",false,"I'm in! $15,000.00 of that is interest alone. ","en","","2",""],["1107497687946067968","1105980449652949002","1552882999","Are Student Loans a Scam?","allyscimmer",false,"legaleye_ AOC",false,"Thank you! I’m following you back as soon as they allow us to. The twitter lords are preventing us from growing at the rate it inevitably will.","en","","1",""],["1106613073635356673","1105980449652949002","1552672091","Jack Wilson","jw12050_jack",false,"AOC",false,"Maybe you should make it mandatory that 18 yr old children take a number of classes on debt, interest rates, etc... And have to do job shadowing before they declare a worthless major they never end up using instead arguing for yet another socialist policy","en","","14",""],["1113325200203046912","1105980449652949002","1554272386","ProfessorMaxwell","Professor__Max",false,"jw12050_jack AOC",false,"Pretty sure there are a few mandatory business classes now in Junior high or high school nowadays covering just that.","en","","",""],["1107360538412138497","1105980449652949002","1552850300","Paul Russo","PaulieRusso",false,"AOC",false,"Cost of forgiving student loans for millennials?  Why, sot they don’t cry?  Or to guarantee they vote Dem forever?  \n\nWhat about Gen X or those who already paid their student loans?","en","","6",""],["1107471138899156992","1105980449652949002","1552876669","X Fair and Transparent Govt X","patrici59152026",false,"PaulieRusso AOC",false,"We owe no one anything. You go to college expect to put away for the cost","en","","1",""],["1107233969869914112","1105980449652949002","1552820124","Sher","Sher_Henderson",false,"AOC","true","We agree @AOC The facts show that it is plausible a student debt bailout, a student debt payment tax credit a refund and free of tuition college education   https://www.sherwork.com/student-loan-forgiveness-cancelation-discharge-and-free-education-by-shirley-henderson/ … pic.twitter.com/GZQBgVGEnB","en","/AOC https://t.co/YemV0zuthv https://t.co/GZQBgVGEnB","","1"],["1108108179706179584","1105980449652949002","1553028552","Sher","Sher_Henderson",false,"AOC","true","#ResearchandDevelopment #taxcut #taxincentive. Start ups may apply up to $200,000 Inserted on their income tax liability. In case insufficient tax liability, tax credits can be carried -forward for 20 years. I think #Studentloandebt should be included in the tax bracket too pic.twitter.com/7VZEQJha7k","en","/hashtag/ResearchandDevelopment?src=hash /hashtag/taxcut?src=hash /hashtag/taxincentive?src=hash /hashtag/Studentloandebt?src=hash https://t.co/7VZEQJha7k","","1"],["1108895032134766592","1105980449652949002","1553216152","Sher","Sher_Henderson",false,"AOC","true","STEP 1: READ THE BILLS\n\nSTEP 2: PRINT THE BILLS\n\nSTEP 3: SEND THE BILLS TO CONGRESS \n\nTITLE OF BILL:STUDENT LOAN DEBT BAILOUT\nTITLE OF BILL: STUDENT LOAN PAYMENT TAX CREDIT\nTITLE OF BILL: FREE COLLEGE TUITION\nBY SHIRLEY HENDERSON\n https://www.sherwork.com/3690-2/  #studentloandebt pic.twitter.com/MpMSwM5sPN","en","https://t.co/dTkYaA7Wsx /hashtag/studentloandebt?src=hash https://t.co/MpMSwM5sPN","","1"],["1108927073308106752","1105980449652949002","1553223791","Sher","Sher_Henderson",false,"AOC","true","How to potentially get a Student loan Payment Tax Credit in 3 Steps \nStep 1 Read: Title of Bill Student loan Payment Tax Credit\nStep 2 Print  https://drive.google.com/file/d/1StIpgiSdh3uKM_peb6nIWUh0z3-jblWt/view …\nStep 3 Mail it to Congress here's a list of representatives https://www.house.gov/representatives  #studentloandebt #taxcredit pic.twitter.com/ixyc8GF9iu","en","https://t.co/ao1SS7lH43 https://t.co/0RscO9PM6m /hashtag/studentloandebt?src=hash /hashtag/taxcredit?src=hash https://t.co/ixyc8GF9iu","","1"],["1110629797091254277","1105980449652949002","1553629752","Sher","Sher_Henderson",false,"AOC","true","Here’s a recap of people’s voices on the topic of Student Loan Debt:\nStep 1 Read: Title of Bill Student loan Payment Tax Credit\nStep 2 Print  http://drive.google.com/file/d/1StIpgi …\nStep 3 Mail it to Congress here's a list of representatives http://house.gov/representatives  #studentloandebt #taxcredit pic.twitter.com/BpUCGE4dhd","en","https://t.co/MOHKLFOyAh https://t.co/W2BmFhcmWE /hashtag/studentloandebt?src=hash /hashtag/taxcredit?src=hash https://t.co/BpUCGE4dhd","","1"],["1107596424265363457","1105980449652949002","1552906540","Lewcipher","LewSchafer",false,"AOC",false,"It means they don't want the government to steal their money to pay for the bad decisions of others.","en","","2","1"],["1107518926701899776","1105980449652949002","1552888063","DC Cesspool","dontcha_know1",false,"AOC",false,"Why should we TAXPAYERS forgive loans parents and kids willingly signed? F- that and you for even thinking that is ok.","en","","2","1"],["1107341039768141824","1105980449652949002","1552845651","Switch625  🇺🇸 🔸(Doug)🔸","Doug625",false,"AOC",false,"Thanks for the laugh. AOC = Almost Occasionally Coherent","en","","2","1"],["1107327399933415426","1105980449652949002","1552842399","Furious A Rae","IheartAlby",false,"AOC",false,"So my taxes will go up AND, after paying back my student loans, I get to pay for the loans of others too? Piss off.","en","","2","1"],["1107328549042692096","1105980449652949002","1552842673","Tony Landry","palandry3",false,"AOC",false,"Look they signed a note that said, I promise to pay, I don’t want my tax dollars to pay for these people. I took care of mine with everything being relative.","en","","6",""],["1106918462100832261","1105980449652949002","1552744901","Oz61","go4uga",false,"AOC",false,"Giving people back more money that they earn isn't a cost to the government,  spending is the reason  our national debt is 22 trillion not tax cuts.","en","","5",""],["1106609865332543489","1105980449652949002","1552671326","Ken Journey","JourneyKen",false,"AOC",false,"Inaccurate again!","en","","5",""],["1107060132020658177","1105980449652949002","1552778678","Jose Luis Franco 🤡🌎 [Run a ₿⚡️🔑 Node]","DJoseLuisFranco",false,"AOC",false,"Why stop there, think BIG, cost of forgiving all home mortgages $8.88T, imagine how famous YOU could be! ","en","","2","1"],["1108574074513444864","1105980449652949002","1553139630","Paul Gerlack","Seahawkfan4x4",false,"AOC",false,"Average student loan debt is 44k. I bought a 62k new truck. I made a choice and I pay my debts. I own a home. I have a family. These college adults can drive a 500 dollar car until they pay their debt. The BMW can come later.","en","","2","1"],["1106695194165026816","1105980449652949002","1552691670","Michael Crawford","mdcraw4d",false,"AOC",false,"What’s the cost of providing social services to illegals?","en","","5",""],["1107344151836872706","1105980449652949002","1552846393","ScottMoNationalist❌","scottmont108",false,"AOC",false,"How about reimbursement for my self funded college degree? Also while you are at it, cover my loan for my house and car. While I’m waiting for you to socialize everything, I will continue to use my extra money from your so call “tax scam” to continue to pay for my decisions.","en","","2","1"],["1106914256992108544","1105980449652949002","1552743898","Richard L.","sergeant1789",false,"AOC",false,"You go Alexandria we support everything you do... Your the best thing that's happened to the system ever wish they were more like you.","en","","1",""],["1107468450459324416","1105980449652949002","1552876029","X Fair and Transparent Govt X","patrici59152026",false,"sergeant1789 AOC","true","I an guessing you don't support freedom either or are willing to support the guy down the street who won't work. Being taxed so much you starve. pic.twitter.com/bAWqzCytvl","en","https://t.co/bAWqzCytvl","1","1"],["1107113985017434114","1105980449652949002","1552791517","Johnny Utah","tyneumann",false,"AOC",false,"I have a car loan. It should be forgiven...just cuz.","en","","3",""],["1107328160755052544","1105980449652949002","1552842581","BDiane","99Bubbles",false,"tyneumann AOC",false,"you should buy a Ferrari ","en","","1",""],["1106672730034892801","1105980449652949002","1552686314","Treff","TreffAdam",false,"AOC",false,"I think we should go after the guy that held a gun to their head and made them take out the loan.","en","","7",""],["1107355968046813185","1105980449652949002","1552849211","Sean (Smitty) Smith","PGSmitty12",false,"TreffAdam AOC",false,"They'll just go after the gun at that point.","en","","",""],["1107333003993407489","1105980449652949002","1552843736","Jmaclove1111","jmaclove1111",false,"AOC Qwest336",false,"And put more spending money in the economy instead of making rich banks richer!\n\nThey already got saved when Barack Obama didn't send them all to jail after the mortgage lending scam in 2008-2009!  They all should've been put under the jail, but as usual..NO JAIL, JUST A BAILOUT!","en","","5",""],["1107428182091878406","1105980449652949002","1552866428","Jonathan Quick","Qwest336",false,"jmaclove1111 AOC",false,"@jmaclove1111 you're seriously one of my favorite follows...\n\nYour comments are always on point. ","en","/jmaclove1111","1",""],["1107501052897755136","1105980449652949002","1552883802","Jmaclove1111","jmaclove1111",false,"Qwest336 AOC",false,"Thanks! You have encouraged me to keep posting. We all have to say something when we see wrong & also to spread love & encouragement to one another.\n\nI wish I had the patience to proofread my posts before I hit the send button... I am terribly lazy at doing the grammatical stuff.","en","","",""],["1107338401429311488","1105980449652949002","1552845022","Blondekat65","kristinegetty",false,"AOC",false,"Clearly you dont get that most of America is laughing at you. Why dont you stop trying to act like a big deal and sit down, shut up and try to learn something. U dont have all these followers because ur smart or have great ideas. They follow cuz ur a trainwreck","en","","1",""],["1107353891241426946","1105980449652949002","1552848715","Jeramey Neely","JerameyNeely",false,"kristinegetty AOC",false,"Blonde, you just won the \"Best comment of my week\" award. Well said.","en","","1",""],["1107356034207793153","1105980449652949002","1552849226","Blondekat65","kristinegetty",false,"JerameyNeely AOC",false,"Had to keep it in Texas!!","en","","1",""],["1107357489446744065","1105980449652949002","1552849573","Jeramey Neely","JerameyNeely",false,"kristinegetty AOC",false,"Lol that's where it belongs....home sweet home!","en","","1",""],["1108386810630230016","1105980449652949002","1553094983","Skidz","TA_Skidz",false,"AOC",false,"One of the big differences, is that the forgiveness of student debt would greatly boost the economy.  More houses built, more cars bought, more jobs created.\n\nGiving the top 1% $2T doesn't do that.  It doesn't increase demand.","en","","3",""],["1107344985245007872","1105980449652949002","1552846592","Carnage","I_am_Carnage",false,"AOC",false,"They put themselves in debt, likely for a degree that is useless. They can deal with it without my tax dollars. Take government subsidies out of the equation and student debt absolutley will go down. No reason to be inexpensive when payment is guaranteed by the government. Basic.","en","","3",""],["1107347929986203648","1105980449652949002","1552847294","Cpizzy⭐️⭐️⭐️","carlepaul140",false,"AOC",false,"Apples and oranges! You’re trying to equate two different things. The top 1% pays 90% of taxes. Giving them a break which proves AGAIN that it helps the economy is much different than ppl who borrow money than not want to pay it back ","en","","1","1"],["1108572658256539654","1105980449652949002","1553139292","Buster Bunker 🕇 🗡⚔🔫🏹🛡","BusterBunker1",false,"AOC","true"," pic.twitter.com/b0WmtnbqBe","und","https://t.co/b0WmtnbqBe","3",""],["1106633862497611777","1105980449652949002","1552677047","Dakota Cross","rapcody15",false,"AOC Jurrellc",false,"Funny, the people complaining about kids making smart choices when it comes to wether they should/shouldn't go to college due to debt are probably the same crying about how McDonald's workers shouldn't get a living wage and should have went to college!","en","","3",""],["1107380142622629890","1105980449652949002","1552854974","Jeff Kearns 🍀","jeffkearns1317",false,"AOC realDonaldTrump",false,"What GOP Tax Scam for the rich?  Everyone benefited from @realDonaldTrump tax breaks. The net result was more revenue for the federal government.\n\nWhy are you trying to make the rich pay for student debt?They didn't cause it and many already provide grant $.\n\nSTOP GOV'T SPENDING!","en","/realDonaldTrump","1","1"],["1107469145891717120","1105980449652949002","1552876194","Michael Messer","spiker5977",false,"AOC",false,"How are your ratings lately? Pretty close to being flushed down the toilet. I hope your getting ready to go back to work taking a new position as a barfly instead of a bartender","en","","4",""],["1106592474083012609","1105980449652949002","1552667179","Colt Clemens","Mr_Clemens",false,"AOC",false,"What would you say to those who did it the right way?","en","","3",""],["1107325281977667586","1105980449652949002","1552841894","Chad  Wensloff","cwens70",false,"AOC",false,"Why should anyone pay for someone else's s kid to go to college?? Its not a right. Money shouldn't even matter, its principal. #Socialism is #Communism","en","/hashtag/Socialism?src=hash /hashtag/Communism?src=hash","3",""],["1106858998005944321","1105980449652949002","1552730724","Joshua Priester","jspries1",false,"AOC",false,"Here is an idea @AOC you took out the loans pay them back. You made the choice to go to school even though you knew you would have to take out a loan.","en","/AOC","4",""],["1107325107536576518","1105980449652949002","1552841853","Joe Murphy MAGA","jpmurphyhmsiac1",false,"AOC",false,"Many of us who paid for our own college and now pay for our kids college don't agree with you.  The tax plan helped the lower and middle class big time and hurt the higher earners because it eliminated the SALT deductions.  wake up. MAGA","en","","1","1"],["1107352438208524288","1105980449652949002","1552848369","SassyRedPill","sassyredpill",false,"AOC",false,"When are you going to promote people accepting THEIR responsibilities. Nobody forced them to take out a loan.  It’s not OUR responsibility to pay for it!  Quit enabling moochers. You and they need to grow up. BTW - pay your taxes!  ","en","","1","1"],["1107326189054636038","1105980449652949002","1552842111","The Rombach Report","club_ed8",false,"AOC",false,"How much can a college tuition really be worth if the student loan obtained to pay for it can be disposed of so nonchalantly via the Student Loan Forgiveness Program?","en","","3",""],["1106614726522560512","1105980449652949002","1552672485","Rody Moreira","rody_moreira",false,"AOC",false,"Please stop giving us a bad name.. this is embarrassing!!","en","","3",""],["1107468473192505344","1105980449652949002","1552876034","Mike","bigern245",false,"AOC",false,"You have a hard time grasping basic economic principles.","en","","3",""],["1107365505302704129","1105980449652949002","1552851484","SusieQ825","svsmith825",false,"AOC",false,"No such thing as free money!  Someone has to pay the debt! ","en","","1","1"],["1107379665000386560","1105980449652949002","1552854860","Lisa","ljcljf",false,"AOC",false,"Your math blows my mind.","en","","4",""],["1106880612483432448","1105980449652949002","1552735877","Kelly Joyce Sr.","ChopnWoodUGA",false,"AOC POTUS",false,"I’m not rich, I’m as middle class as they come and the @POTUS tax cut helped me.\n\nWhy must you spread lies and give free stuff to get votes.\nGrow up!","en","/POTUS","3",""],["1106700425229561857","1105980449652949002","1552692917","Ted Baker","tedbaker2000",false,"AOC",false,"I want to start a school and charge an excessive amount to students and then have the gov pay - that makes sense","en","","4",""],["1107325588551929862","1105980449652949002","1552841968","Robert Burdett","Reburd",false,"AOC",false,"So I just finished paying my student loan. Took me 20 years of paying every single month. I had to make things work. Now college kids getting out now will be way ahead of me because they do not have student loans. Is that fair to people who have paid their loans off?","en","","4",""],["1107327444263059456","1105980449652949002","1552842410","Name","WhereAreWeNowX",false,"AOC",false,"Seriously how is this person who made tips in office. She is dumb beyond dumb. Should we also give reparations to those who were able to pay off students loans? Where do we draw the line for those dumb enough to sign up for a lifetime of debt.","en","","4",""],["1106624832739962883","1105980449652949002","1552674894","Seth Crocker","Crocker",false,"AOC",false,"Letting people keep more of their own money is a “cost” to the government.","en","","3",""],["1107331819177938944","1105980449652949002","1552843453","Herman Huffman","HuffmanHerman",false,"AOC",false,"The lesson of students paying their just debts costs the taxpayer nothing, but is priceless for the individuals.","en","","4",""],["1108280073361260544","1105980449652949002","1553069534","BettyBoop75","ogcoffeethatpay",false,"AOC BlissvilleL",false,"Well, just think about all those jobs that NYers could of had if Amazon was in town.... probably would of helped some of those students pay off their student loans. ","en","","1","1"],["1107743084656427012","1105980449652949002","1552941506","Jeffrey Hale","bodiesipha",false,"AOC",false,"I want mine forgiven to. You can send me a check In the amount of $80k","en","","3",""],["1108574763839033344","1105980449652949002","1553139794","Darrell Boone","tazmandb",false,"AOC",false,"Forgiving student loans wouldn't be a self serving benefit for you by chance would it?","en","","1","1"],["1107334549338492928","1105980449652949002","1552844104","Brant Bramblette (Bo Dog's Dad)","brantbramblette",false,"AOC",false,"Just as soon as my mortgage is forgiven. I opened that loan just like a student loan. Willingly.","en","","4",""],["1107368375834079233","1105980449652949002","1552852169","🇺🇸RickB🇮🇱","BassmanRickB",false,"AOC",false,"No they actually mean. There's no way to pay for it princess. Simple capitalism economics 101. Everything cost money. You are proof that stupidity cost taxpayers money","en","","1","1"],["1106608717540274176","1105980449652949002","1552671052","Rich","richardworth77",false,"AOC",false,"I was wise and chose a useful degree from a state school with in-state tuition so a AS, BS, and MS only cost me $40k.  My last loan payment after 13y is due next month. Millennials made their bed, now they can sleep in it and pay off their loans like us.","en","","3",""],["1107327574286483457","1105980449652949002","1552842441","Mark Longmire","LongmireMark",false,"AOC",false,"Some scam. My wife and I saw more money in our pay checks every month. Also, our tax bill was less this year than last year. We made the same gross income for 2018 and 2017.","en","","3",""],["1107430734451470336","1105980449652949002","1552867036","FL410_over_HNL","CaptKimoW",false,"AOC",false,"Why don’t you forgive my mortgage while you are tweeting stupid shit ","en","","3",""],["1107344562350157835","1105980449652949002","1552846491","Jimmy","JamesPa51395548",false,"AOC",false,"When the hell did America become the give me everything country? Here is an idea. Get off your ass and work for everything.","en","","1","1"],["1107381841974177792","1105980449652949002","1552855379","Amy G","Morning_Star2",false,"AOC",false,"So will my sons, who PAID for their own college, be given money too? If you're giving away money, it's wrong to only give it to the ones who made bad choices.","en","","4",""],["1107376102325043200","1105980449652949002","1552854011","Michael Fitzgerald","Michael79534173",false,"AOC ShellyMcgough",false,"Who pays the banks the money owed them. You forgive the students loan debt with money which is not yours. Who pays the debt to the banks who are a private entity. This is a serious question. Please don't say banks are evil. Who makes the bank's whole","en","","1","1"],["1106667104474939397","1105980449652949002","1552684973","ed","spinedoc1995",false,"AOC",false,"It’s great that a bunch of millennials decided it was important to get degrees in gender studies & 17th century gothic architecture. But it isn’t our fault they can’t pay their loans in useless areas. Better yet, what’s the benefit for the millions of us that paid off our loans?","en","","1","1"],["1107615787903270914","1105980449652949002","1552911156","@canadiangirl49","canadiangirl49",false,"AOC",false,"#IDIOT YOU ARE AN EMBARRASSMENT","en","/hashtag/IDIOT?src=hash","3",""],["1107492548916985856","1105980449652949002","1552881774","independentthnkr","thinking4myslf",false,"AOC",false,"I worked and paid for my school. Will your plan give me my money back. Just because I wasn’t irresponsible and didn’t take out a loan that I couldn’t pay back. Shouldn’t I get something??!!!","en","","1","1"],["1107367259687870465","1105980449652949002","1552851903","Todd Bailey","ToddABailey",false,"AOC",false,"That’s a dangerous point you’re trying to make. What if I paid mine off? Do I get a check?  How far back do we give checks?  1776?  Borderline stupid. (No borders)","en","","4",""],["1107438303303868416","1105980449652949002","1552868841","Greg Weisheipl","GregWeisheipl",false,"AOC",false,"Why should we cancel any student loan debt? Give me one good reason beyond just using it to buy votes? Why don’t we cancel all debt for Seniors first? At least those with student loans have more time to pay it off! #Liberalism_MentalDisorder","en","/hashtag/Liberalism_MentalDisorder?src=hash","1","1"],["1107423716412133382","1105980449652949002","1552865363","Are Student Loans a Scam?","allyscimmer",false,"AOC",false,"EVERYONE FOLLOW US TO END THIS STUDENT LOAN CRISIS!!!!!!!!!!!!!","en","","2",""],["1107488408467836928","1105980449652949002","1552880787","ProudPatriot","ucchristinme",false,"allyscimmer AOC",false,"QUIT BORROWING MORE MONEY THAN YOU WILL EVER MAKE WITH THAT PSYCH DEGREE!!!!   \n\nWhy should I pay for your poor decisions??","en","","1",""],["1106646109479301120","1105980449652949002","1552679967","TraderMoe","Trader_Moe",false,"AOC",false,"The GOP tax cut went straight to wages and new jobs for working people, with pay increases hitting 6% for the lowest-paid American workers, far ahead of inflation.","en","","1",""],["1106646312395522048","1105980449652949002","1552680016","TraderMoe","Trader_Moe",false,"AOC",false,"It's not fair to ask the 2/3 of Americans who didn't go to college to pay the college expenses of elites like @AOC who are lording it over them.","en","/AOC","2",""],["1106619865861742592","1105980449652949002","1552673710","ComicCrowe90","CCrowe90",false,"AOC RealArtistJaye",false,"Ok, so I make the voluntary decision to go to college, take a degree that isn’t useful(generally) and now it’s fair for someone else to pay my debt? No. It’s not fair. And frankly unless you are going for a skillset(which many are not doing) you shouldn’t go to college period.","en","","1",""],["1106626797515481089","1105980449652949002","1552675363","Jaye_Sové","RealArtistJaye",false,"CCrowe90 AOC",false,"I don't know who gets a degree and generally doesn't use it as they intended, but even so those people do end up with a job thus paying taxes. So since we all pay more taxes over a lifetime how is it someone else paying. Isn't that my tax money hard at work? #Rhetorical","en","/hashtag/Rhetorical?src=hash","",""],["1106629924725518336","1105980449652949002","1552676108","ComicCrowe90","CCrowe90",false,"RealArtistJaye AOC",false,"The majority of people in humanities. Or that major in something easy to pass. And yes, it’s your money. And my money. And my sisters money and my moms money and my aunts and uncles and friends and neighbors. You don’t have the right to use it to pay your debts.","en","","2",""],["1106738681979813888","1105980449652949002","1552702038","Jaye_Sové","RealArtistJaye",false,"CCrowe90 AOC",false,"So if it's ok for then to pay the debts of building a rocket, a missile, and for places in government I didn't vote for, but somehow it's not ok to ask them to pay our education debt? And what @AOC is saying is that the tax cut saved them that much","en","/AOC","",""],["1106759797183897600","1105980449652949002","1552707072","ComicCrowe90","CCrowe90",false,"RealArtistJaye AOC",false,"Yes, because we all benefit from national defense. I don’t benefit by paying your debt. If you told me you wanted to take govt out of the equation of subsidizing worthless degrees, sure. That way this never happens again, ok. If you want us to all pay and start the cycle over? No","en","","1",""],["1106929259422121986","1105980449652949002","1552747475","Jaye_Sové","RealArtistJaye",false,"CCrowe90 AOC",false,"We do not benefit from. National defense, it's only cuz past generations created hostile situations do we even need defense. US has instigated every hostile situation. We use defense to attack and \"defend\" US interests. Basically we rape take and bully and then say we need defens","en","","",""],["1106972474128760832","1105980449652949002","1552757779","ComicCrowe90","CCrowe90",false,"RealArtistJaye AOC",false,"You do. You can disagree with it, but we all benefit from national defense. I don’t benefit by paying people’s degrees.","en","","1",""],["1106649990632488961","1105980449652949002","1552680892","Dene Conway","ConwayDene",false,"AOC",false,"If only civilized societies realised that fair taxation can pay for all the things that contribute to a nicer life. Free education to find your true potential, free public transport, free health service. Unfortunately that relies on people being basically nice  and unselfish.","en","","1",""],["1107325508155592704","1105980449652949002","1552841948","Bernardo Really","Sublime12NO",false,"ConwayDene AOC",false,"I have a nice unicorn to sell you.","en","","1",""],["1107338606463647747","1105980449652949002","1552845071","Dene Conway","ConwayDene",false,"Sublime12NO AOC",false,"It's ok I'll ride the tax subsidised public transport.","en","","",""],["1107347494009221120","1105980449652949002","1552847190","Bernardo Really","Sublime12NO",false,"ConwayDene AOC",false,"Not me...and I don't want to subsidize your free rides either.","en","","1",""],["1107380218522685450","1105980449652949002","1552854992","Wynterklaus ⭐⭐⭐","wynterklaus",false,"AOC",false,"Robbing Peter to pay Paul is not good economics","en","","1",""],["1107380992967213056","1105980449652949002","1552855177","MagaKathryn","KathrynMaga",false,"wynterklaus AOC",false,"She wants her student debt paid - she has to buy furniture for her new apartment(s).","en","","1",""],["1106596548736094208","1105980449652949002","1552668151","Rory","rttate1",false,"AOC",false,"I'm 58. I want my money, plus  interest back also. Only fair right?","en","","3",""],["1106588502240591872","1105980449652949002","1552666233","joan hendrix erickson","HendrixErickson",false,"AOC",false,"I realize this is the ultimate KISS Principal but why can't we have a 10% tax for everyone. That's it, no loop holes and I include churches and non-profits.","en","","3",""],["1107683141144051719","1105980449652949002","1552927215","🙊🙉🙈","LiberalsSuck321",false,"HendrixErickson AOC",false,"Imagine if everything you buy is taxed at 10% and most of the IRS is abolished.\n\nThe money saved would be astonishing.","en","","",""],["1106624933088673792","1105980449652949002","1552674918","JMS315","jschon15",false,"AOC BLIP35",false,"Sooooo, the college debt I paid back, am I going to get some refund check?","en","","3",""],["1107325482431860741","1105980449652949002","1552841942","Johnny [LTC]","freespeechjohn",false,"jschon15 AOC BLIP35",false,"No you're a sucker!!! Thanks","en","","",""],["1106640179689717760","1105980449652949002","1552678553","Michael Bice","bicemk",false,"AOC",false,"There should be debt forgiveness...for a cost. Public service or military service would be one way to do that.","en","","3",""],["1107393383285379072","1105980449652949002","1552858131","Eddie Jewell ⭐️⭐️⭐️","EddieJewell",false,"bicemk AOC",false,"I’m pretty sure there is debt forgiveness if you work certain jobs for 10 years. Not sure of all the details.","en","","",""],["1107327963744399360","1105980449652949002","1552842534","Timothy Edward","trumpmyman",false,"AOC",false,"I got to keep more of my money, it didn’t cost the government anything. Why forgive college debt? Why not mortgage debt, or credit cards, or car loans.... why not forgive all of it! Because the economy will collapse and we will be Venezuela, starving to death.","en","","2",""],["1107392973606666241","1105980449652949002","1552858033","12,999,999 🇺🇲 🇮🇱","Thewarrantymann",false,"AOC",false,"Why should loans be forgiven?  Because irresponsible counselors told the young minds of mush to major in economics, and they became bartenders?\nGender studies should not even be allowed to be a class!  #snowflakes","en","/hashtag/snowflakes?src=hash","2",""],["1106642102899879936","1105980449652949002","1552679012","John Fuller","jfullerin",false,"AOC",false,"It’s not that there “isn’t enough,” it’s just that we don’t want to. Very simple!!  Pay you’re own way!!! We want to reduce handouts not increase them.","en","","2",""],["1106600473400795138","1105980449652949002","1552669087","MS Venezia","msvenezia",false,"AOC",false,"Is it possible to be more stupid than @AOC?","en","/AOC","2",""],["1107333271132745728","1105980449652949002","1552843799","Liz K","lizgreen5578",false,"AOC",false,"So, you’re saying that we should all incur the debts of other people’s free will to choose whatever college they wish to attend?  They graduate with a  degree, or a useful degree and WE have to pay for it?  GET LOST!","en","","2",""],["1107444239116300288","1105980449652949002","1552870256","MrRoach Sir","MrRoachdotCom",false,"AOC","true","Cost of GND 70 Trillion in 10 years. \n\nAdvantages of being a vapid twit......PRICELESS! pic.twitter.com/hFAK9qgDaJ","en","https://t.co/hFAK9qgDaJ","","2"],["1107327478304071686","1105980449652949002","1552842418","Dom","dballz19",false,"AOC",false,"You are a idiot go back to school","en","","2",""],["1108864020432351232","1105980449652949002","1553208758","Soquel by the Creek","SoquelCreek",false,"AOC",false,"LOL. Taking less of other people's $$$ is NOT a cost to taxpayers.\n\nForcing taxpayers to forgive debt incurred by others IS a cost to taxpayers, whether it be failed mortgages, TARP, or student loans.","en","","2",""],["1106611764085645318","1105980449652949002","1552671779","Chris Shannon","ChrisSh93725760",false,"AOC",false,"so lets continue to craddle millennials and protect them from the real world.  if you entered into a legal contract to borrow money for college you are obligated to pay it back.  getting a worthless degree that does not provide a path to a good paying job is your fault","en","","2",""],["1106584490900627457","1105980449652949002","1552665276","Leslie E. Yarbrough","BigLes71Arm",false,"AOC",false,"Are you crazy if you wanted somebody to pay for college education you should joined the military! We the taxpayers are not repeat are not going to pay for your education or know body else's education. 1.5 trillion sure could help paying the National Debit!","en","","2",""],["1107659902129004545","1105980449652949002","1552921674","Asian Persuasion","FinebcFuchs",false,"AOC",false,"@AOC we will call you DUMB SHIT from now on. Why do dumb shits alway have idea to spend other people's money but their own? Put your money where your mouth is Dumb Shit! Oh I forgot you don't have non that's why you're spending Taxpayer money.","en","/AOC","2",""],["1107326017201426440","1105980449652949002","1552842070","right rolla ✖️jonny quid","johnjquid1984",false,"AOC",false,"How do you reconcile advocating for struggling families and against letting them keep more of their own money at the same time !! \n\nI didn’t go to college because I didn’t want the debt !!  \n\nNow you want me to pay for those that did !!\n\nHow nonsensical !!!!","en","","2",""],["1107403104864124928","1105980449652949002","1552860449","Mary Edmonds","Trapshooter61",false,"AOC",false,"Uh AOC, why should student loans be forgiven???  They shouldn’t!  People make a choice to attend college!  People can also make a choice to attend a trade school which ends up paying much higher wages!  I wish YOU would STFU about money, you don’t know anything about it! ","en","","2",""],["1107325148103958528","1105980449652949002","1552841863","🇺🇸 Tattoo Josh 🇺🇸","tattoojoshiz",false,"AOC",false,"What's funny is aoc thinks it's just 1.5 trillion.  But add that to the 93 trillion for GND and 40 trillion for health care and we start to see the pattern of how she likes to spend other people's money...","en","","2",""],["1107331454193885192","1105980449652949002","1552843366","Jeff Crawford","JT_Crawdaddy",false,"AOC",false,"Why the hell should taxpayers cover the cost of student loans when the majority of liberals who want this spent thousands on worthless degrees? Why should I pay for some idiot who took gender studies, liberal arts, etc. Take real classes, get real job, pay off YOUR OWN debts.","en","","2",""],["1107336050232434688","1105980449652949002","1552844462","The Stagman","StagmanCC",false,"AOC",false,"Please tell me you skipped a lot of classes at BU. You are devaluing my degree.","en","","2",""],["1106635744171515906","1105980449652949002","1552677496","Matt","mphilpott0220",false,"AOC",false,"What makes student loan debt more important than any other debt? Ate their plans to forgive my mortgage? Or someone's car loan? Credit card debt?","en","","2",""],["1106712640695558144","1105980449652949002","1552695829","Alicia Mellor","AliciaMellor",false,"AOC",false,"We are not socialists nor communists, this is a country built on capitalism. I paid my student loans, why should I also pay theirs?? Why don’t you solicit Hollywood Dems? Fundraising? Not? Why?","en","","2",""],["1107663121437638656","1105980449652949002","1552922442","martin ratcliff","mratcliff57",false,"AOC",false,"Heres a novel idea..get your degree..start your career and pay on it..the concept works.","en","","2",""],["1107372037251567616","1105980449652949002","1552853042","🌹🌟Rain Golden Grace🌟🌹","Eliza_4_God",false,"AOC",false,"Why would anyone want a free loan? Does that teach a kid responsibility? NO, it doesn't. That's what is wrong with kids these days. No parenting, no responsibility, free this, free that. Wrong way to live.","en","","2",""],["1107409427605454848","1105980449652949002","1552861956","Matt Graham","maizeandbluefan",false,"AOC",false,"In order to get an Income Tax Cut a person has to pay Income Taxes.","en","","2",""],["1106608584622788608","1105980449652949002","1552671021","Linda Spina","LinSpina",false,"AOC",false,"Should we also cancel mortgage debt and car loan debt and credit card debt???? If you took out a student loan, you need to pay it back!! It’s as simple as that. I’m so sick of people making choices in their lives that the rest of the American taxpayers have to pay for in the end!","en","","2",""],["1107369028161552386","1105980449652949002","1552852324","lefletd","lefletscott",false,"AOC",false,"2.9 billion in federal grant money was left unclaimed last year........unfortunately they have to fill out paperwork to get the grants, too much work easier to hold out their hands for freebies","en","","2",""],["1106672802395029506","1105980449652949002","1552686331","fredwho","fredwho",false,"AOC",false,"Show me the actual math, instead of just saying numbers and hoping I'll believe them","en","","2",""],["1107325185391157248","1105980449652949002","1552841871","Dani Bryant","LaGryphon",false,"AOC",false,"Forgiving student loan debt is the hallmark of a juvenile delinquent thought pattern....do not attempt to paint it as  anything else.","en","","2",""],["1108213405117083649","1105980449652949002","1553053640","Chels","ItsmechelCB",false,"AOC GOP",false,"Denmark pays for college AND pays students while they are in college so they can afford to live and focus on school. Higher taxes for everybody, but the benefit to their society is incredible. Its BS we'll be paying higher taxes bc of the @GOP w/o any benefits.TY for fighting","en","/GOP","2",""],["1106625396773212160","1105980449652949002","1552675029","Robert Ricks","TheRicksassin",false,"AOC",false,"It's an absolute shame of the people to have more compassion for these big corporations that are basically allowed to cheat the system than the average working class human that just needs a simple break for once.","en","","2",""],["1106880228645896192","1105980449652949002","1552735786","Kelly Joyce Sr.","ChopnWoodUGA",false,"AOC",false,"She wants to make a college degree as worthless as a high school diploma.\n\nThere are tons of very affordable local colleges out there that if you WORK you can leave with very little debt.\n\n#LiveWithinYourMeans\n#NothingIsFree","en","/hashtag/LiveWithinYourMeans?src=hash /hashtag/NothingIsFree?src=hash","2",""],["1107468281638735872","1105980449652949002","1552875988","jase72","jase_1972",false,"AOC",false,"So basically what you are saying is, you don't want to take responsibility for a decision that you made? That is like saying I bought a Mercedes and can't pay for it and want the  loan that I paid for to go away.","en","","2",""],["1106641242316771329","1105980449652949002","1552678807","Johnnie Walker","Blue_Label4",false,"AOC",false,"......... I’m too tired","en","","2",""],["1107610981772021760","1105980449652949002","1552910011","Corporation Domains","CorporationDom",false,"AOC",false,"You signed the paper. You agreed to the terms. I repaid my #studentloans by working hard for yrs. Why can't you? Why are some millennials so entitled to think everyone else should repay THEIR debts? Spoiled brats aren't #adulting very well. #Truth. WahWah. You benefitted, u pay.","en","/hashtag/studentloans?src=hash /hashtag/adulting?src=hash /hashtag/Truth?src=hash","2",""],["1106605683473113089","1105980449652949002","1552670329","Thomas Bu","ThomasBu12",false,"AOC",false,"Nobody held a gun to their heads, when they signed the loan applications.   Nobody made them earn degrees that have very little use, demand or wages.","en","","2",""],["1106631428731736070","1105980449652949002","1552676467","The Non-Conformist","JBurt73",false,"AOC",false,"That's $1.5 trillion dollars financed by taxpayers. Taxpayers deserve to be paid back every single cent.","en","","2",""],["1107454479568379906","1105980449652949002","1552872698","Duke","somethingldsay",false,"AOC",false,"If you're not also proposing a way to stop kids from knowingly taking out student loans they'll be paying forever, then no, this is a short sighted, won't do anything but buy you votes, BS idea.","en","","2",""],["1107328092261867521","1105980449652949002","1552842565","HIgland Lass","Highland__Lass",false,"AOC",false,"Missy,I served my country for 8 years, used the GI Bill & loans to get through school with a degree that provided a living, bought a house, car & paid off the loans. If people are so darn stupid to get get into debt for useless “degrees”,that is their problem, should not be mine!","en","","2",""],["1107326906683269120","1105980449652949002","1552842282","Leosian67","Leosian67",false,"AOC",false,"Especially since you have all these 'wonderful' ideas but no way to actually pay for them because you don't know the damn difference between a tax break and a slush fund. You cost your area 25k new jobs and the tax revenue to go along with those jobs.","en","","2",""],["1106609865466761216","1105980449652949002","1552671326","American Joe","mikell24",false,"AOC",false,"Percent of students that want their debts forgiven that are ignorant freeloaders... 100.","en","","2",""],["1107823027587371008","1105980449652949002","1552960566","mike stead","wiredbymike",false,"AOC",false,"I want a free Tesla...can you get me that too","en","","2",""],["1107452358060052480","1105980449652949002","1552872192","Shelly","ShellyJones88",false,"AOC",false,"Nobody canceled my student loan debt I raise three kids work three jobs and paid my debt and was grateful that it was set up for payments but then again I didn’t borrow more that I needed it’s called growing up if you can’t afford it then don’t do it","en","","2",""],["1107345288069550080","1105980449652949002","1552846664","Thomas Wictor Lives","czyolman",false,"AOC",false,"Since I paid for every cent of my 4 years of College can I get reimbursed?","en","","2",""],["1106909040850993156","1105980449652949002","1552742655","Semper Fidelis 0321","shocker23456",false,"AOC",false,"This is how the anti American socialist Democratic and baby killers party thinks. No one forced anyone to get these loans and no one forced them to go to college. They don't think of the cost of running that college to pay staff and teachers etc. The Gov should not do loans!","en","","1",""],["1106911251748270080","1105980449652949002","1552743182","OM 🇺🇸🇮🇱","Observant_mind",false,"shocker23456 AOC",false,"The Federal Student Loan Program caused the cost of a College Education to skyrocket. Another well intentioned but, FAILED government program.","en","","",""],["1106914942563860480","1105980449652949002","1552744062","Semper Fidelis 0321","shocker23456",false,"Observant_mind AOC",false,"And everytime government gets involved with anything that should be private it screws it up fast!","en","","1",""],["1106585945124552704","1105980449652949002","1552665623","Robert","mirobertv",false,"AOC",false,"(1) Less not forget $8 billion for a needless Vanity Wall. However, $22 Trillion in US debt is a national security concern. It should be treated as such. That does not even include personal consumer debt. The next Bubble burst will be devastating.","en","","",""],["1107340114785529858","1105980449652949002","1552845431","Nancy","NancyDelthia",false,"mirobertv AOC",false,"Yes and the Dems want to send 140 billion to foriegn aid.","en","","3","1"],["1107390624259559425","1105980449652949002","1552857473","Robert","mirobertv",false,"NancyDelthia AOC",false,"It’s called diplomacy & protecting our interest. Keeps foreigns off our soil. If DT & other absurd wealth cheaters pay their taxes...we’re good.","en","","",""],["1107604835149332480","1105980449652949002","1552908545","Nancy","NancyDelthia",false,"mirobertv AOC",false,"Nobody was concerned when it went from 10 trillion to 20 trillion in 8 years.","en","","",""],["1107605880281788416","1105980449652949002","1552908794","Nancy","NancyDelthia",false,"mirobertv AOC",false,"Nothing is free and America 1st. We are not the Worlds welfare train anymore.","en","","",""],["1108022138403995648","1105980449652949002","1553008038","Robert","mirobertv",false,"NancyDelthia AOC",false,"“WE” ?We are part of the human race ... all on this Earth together “We” are against evil, greed & gluttony. “WE” should be grateful,selfless, humbled by our privileges & thankful we live in the most prosperous country on Earth. America First is a narrow minded selfish pnt of view","en","","",""],["1108030558750175232","1105980449652949002","1553010046","Nancy","NancyDelthia",false,"mirobertv AOC","true","You think it can't happen here? You are wrong if your so shallow minded. https://www.gatestoneinstitute.org/5128/france-no-go-zones …","en","https://t.co/0h5VP9vBAi","",""]]}