{"origin":["1108020712021868547","8:01 AM - 19 Mar 2019","Alexandria Ocasio-Cortez","AOC",true,"68% of all NYC public school students are Black or Latino.\n\nTo only have 7 Black students accepted into Stuyvesant (a *public* high school) tells us that this is a system failure.\n\nEducation inequity is a major factor in the racial wealth gap. This is what injustice looks like. https://twitter.com/elizashapiro/status/1107744299582660609 …","elizashapiro","NEWS: Today, seven black students got into Stuyvesant High School, one of the most prestigious public schools in the nation, out of 895 offers. \n\nThe grim statistics will raise pressure on NY's politicians to confront segregation…","65956","16969"],"replies":[["1108025783707160576","1108020712021868547","1553008907","Carmine Sabia","CarmineSabia",false,"AOC",false,"It is called earning it. Stuyvesant has 74 percent Asian students. Do you want more white kids in the school? Your idea is if you cannot earn it you force the school to take unqualified kids.\n\nThis is not what injustice looks like. It is what merit looks like.","en","","4105","390"],["1108027546380181504","1108020712021868547","1553009327","Josh Matera","josh_matera",false,"CarmineSabia AOC",false,"Your tweet is what myopia looks like.  The problem isn't one school's admissions process, it's the inequal educational opportunities given to the applicants BEFORE they apply. Poor schools get unqualified teachers with high turnover & out of date textbooks","en","","1392","71"],["1108039933569232896","1108020712021868547","1553012281","Keees","mfgonzalez24",false,"josh_matera CarmineSabia AOC",false,"If the majority of admitted students are Asian, are they coming from advanced junior and middle school programs? Instead of discrediting can we uplift those who studied and worked hard?","en","","758","35"],["1108094230751338496","1108020712021868547","1553025226","Carmine Sabia","CarmineSabia",false,"mfgonzalez24 josh_matera AOC",false,"As someone who comes from the multicultural city of Newark NJ I could tell you that in my experience Asian parents focus more on having their kids study than white, black and Hispanic parents do. We are told to do our best. My Asian friends were told do the best.","en","","976","63"],["1108111059498475522","1108020712021868547","1553029238","OcalaNurse","THensleyRN",false,"CarmineSabia mfgonzalez24 josh_matera AOC",false,"Agreed...while there are some parents who not only don’t give a crap about theirs kids education, they also expect the school to RAISE their child. Don’t expect education to be handed to you.","en","","303","13"],["1108347478833856519","1108020712021868547","1553085605","Kaila","ohheykaila",false,"THensleyRN CarmineSabia mfgonzalez24 josh_matera AOC",false,"I know so many incredibly bright students who would have excelled and thrived in such a rigorous program. But, they could not afford a private tutor or test prep books. This is such a small thing that the NYCDOE can easily step in and make more equitable.","en","","109","3"],["1108348307443802113","1108020712021868547","1553085803","Carmine Sabia","CarmineSabia",false,"ohheykaila THensleyRN mfgonzalez24 josh_matera AOC",false,"That would be a wise use of taxpayer funds. Kids who want to excel should be given the tools. That is an investment in America.","en","","116","4"],["1108350343627358208","1108020712021868547","1553086288","Kaila","ohheykaila",false,"CarmineSabia THensleyRN mfgonzalez24 josh_matera AOC",false,"Absolutely. I volunteered after-school to do SAT prep with our HS students. It’s a cycle. Lack of resources gets compounded over time. There’s a disparity in resources and many parents/students don’t even know to ask/demand better. But those of us who know better should do better","en","","68","4"],["1108357834939469824","1108020712021868547","1553088074","The Boss","BeingtheThe",false,"ohheykaila CarmineSabia THensleyRN mfgonzalez24 josh_matera AOC",false,"A lot of these students have parents with degrees, meaning that they can help their kids with homework through most grades. We spend an hour every night doing homework with our kids, they've excelled nicely. I have friends that can't, their kids homework is over their heads.","en","","10",""],["1108546925459066880","1108020712021868547","1553133157","Suzi Castiglione","MrsStigg",false,"BeingtheThe ohheykaila CarmineSabia THensleyRN mfgonzalez24 josh_matera AOC",false,"Neither of us spent an hour doing homework with our son for years. He's a 4.0+ student w/o any special tutors, etc...when I was growing up, I had a friend whose parents lacked HS diplomas, we grew up in a  blue collar, coal mining town, He went to Cornell and was a Rhodes Scholar","en","","7",""],["1108553128511787008","1108020712021868547","1553134636","Kaila","ohheykaila",false,"MrsStigg BeingtheThe CarmineSabia THensleyRN mfgonzalez24 josh_matera AOC",false,"This is a thread about low-income students of color in NYC. You just stated you are a middle-aged white woman from a blue-collar mining town. You don’t fit the demographic. We’re also focused on what is happening in NYC currently. How can you not see the flaws in your tweet?","en","","",""],["1108559388749516808","1108020712021868547","1553136128","MerlynnSage1","MerlynnSage1",false,"ohheykaila MrsStigg BeingtheThe CarmineSabia THensleyRN mfgonzalez24 josh_matera AOC",false,"White people grow up poor too! It's only sad if a black person doesn't have opportunity. So sick of that crap. We grew our own food, 6 kids, we had nothing growing up. If they were smart they would do better on the testing, I did and I didn't have tutors or special books.","en","","1","1"],["1108563465499799552","1108020712021868547","1553137100","Kaila","ohheykaila",false,"MerlynnSage1 MrsStigg BeingtheThe CarmineSabia THensleyRN mfgonzalez24 josh_matera AOC",false,"No one stated white people cannot grow up in low-income households. The fact of the matter is, people of color in America have a lack of generational wealth due to slavery, Jim Crow, redlining, and other deplorable tactics that were once legal and barred access.","en","","",""],["1108563592226451457","1108020712021868547","1553137131","MerlynnSage1","MerlynnSage1",false,"ohheykaila MrsStigg BeingtheThe CarmineSabia THensleyRN mfgonzalez24 josh_matera AOC",false,"She stated it was about black people.","en","","",""],["1108564348845346816","1108020712021868547","1553137311","Kaila","ohheykaila",false,"MerlynnSage1 MrsStigg BeingtheThe CarmineSabia THensleyRN mfgonzalez24 josh_matera AOC",false,"@AOC retweeted an article that illuminates the disparity in race of students accepted into elite NYC public schools. That’s the full extent of the comment. Where did anyone say white people are immune from growing up poor? That never happened. Please be truthful.","en","/AOC","",""],["1108864049385783302","1108020712021868547","1553208765","MerlynnSage1","MerlynnSage1",false,"ohheykaila MrsStigg BeingtheThe CarmineSabia THensleyRN mfgonzalez24 josh_matera AOC",false,"But the disparity has a false conclusion. Yes disparity, but the reasons are wrong. They say it all the time, you be truthful, Bernie likes to say whites don't know what it's like to be poor. I can tell you are not too bright and not seeing the pic. Critical thinking skills...","en","","",""],["1108021111239921664","1108020712021868547","1553007793","Ed Krassenstein","EdKrassen",false,"AOC",false,"It's my opinion that every student who wants an education should have the same right to that education no matter the color of their skin, their religion, or their economic background.  We need to fix this mess, and give everyone a fair chance in America.","en","","3181","507"],["1108080900359815168","1108020712021868547","1553022048","Save America Please","SaveAmericaPle2",false,"EdKrassen AOC",false,"Right! Since someone can't pass the high standard, we should lower it. Great way to fix it. I'm not fast enough to qualify for 100 meter in the olympics, so lets everyone run and don't record the time and we all get gold medals. NYC kids have the right to an education already","en","","553","28"],["1108094300871626752","1108020712021868547","1553025243","Christine Budell","TBudell",false,"SaveAmericaPle2 EdKrassen AOC",false,"It is not a out lowering standards. It is a out ensuring that all students have equal access to a quality education. Not all students will rise to the top, but the opportunity should be afforded to all students.","en","","184","4"],["1108097257772072976","1108020712021868547","1553025948","Save America Please","SaveAmericaPle2",false,"TBudell EdKrassen AOC",false,"They had an opportunity. did they get denied to take the test? True, not everyone can rise to the top, but SHS are meant for those who do. Nothing stopping a child from doing good and excelling in school. Don't need a SHS to get ahead in life, you need passion and drive.","en","","216","7"],["1108127672477970432","1108020712021868547","1553033199","PBCDMX","pbcdmx",false,"SaveAmericaPle2 TBudell EdKrassen AOC",false,"Poorer schools provide poorer education, resulting in less opportunities for those students. If that's not fixed then there won't be an even playing field.","en","","128","1"],["1108131515853086721","1108020712021868547","1553034116","Save America Please","SaveAmericaPle2",false,"pbcdmx TBudell EdKrassen AOC",false,"Sorry, not true in NYC. Schools are what you make of it together with your child. If you believe what you say, then your issue is with the Teachers. \n\nAlso, schools get funded by how many children are in attendance. Not a poorer school, just a poorer school environment.","en","","18","2"],["1108210339630456832","1108020712021868547","1553052909","Ryan Masnyk","Masnyk",false,"SaveAmericaPle2 pbcdmx TBudell EdKrassen AOC",false,"The majority of public school funding comes from local property taxes. Not from how many people are in the school. The federal govt barely provides any funding to public schools. It literally depends on the housing market. It’s not a simple fix.","en","","8",""],["1108211590443220992","1108020712021868547","1553053207","Christine Budell","TBudell",false,"Masnyk SaveAmericaPle2 pbcdmx EdKrassen AOC",false,"Agreed. Our government has scaled back funding to public schools & mental health funding since the 80's. I remember when California  approved Prop. 8 back in the late 70's; funding dried up, school districts went broke, downsized schools increased class size.","en","","3",""],["1108425005250080769","1108020712021868547","1553104089","Neil harden","Slipknott76",false,"TBudell Masnyk SaveAmericaPle2 pbcdmx EdKrassen AOC",false,"Because the federal government has no business being involved in the educations system. Haven't you noticed how much worse things got after the DOEd was created. We need to get all government out of schools","en","","1",""],["1108051575321309186","1108020712021868547","1553015056","David A Roche","droche1959",false,"AOC",false,"It should be all about merit. That is true fairness","en","","123","4"],["1108060133681233921","1108020712021868547","1553017097","Alexander Michels","alexcmichels",false,"droche1959 AOC",false,"Imagine two students:\n\nStudent A never had to worry about money, has a well funded school, tutors, and their parent paid for test prep.\n\nStudent B works part-time, school has little funding, can't afford tutors/test-prep.\n\nIs it fair? No, student A has an advantage.","en","","101","7"],["1108102606734409729","1108020712021868547","1553027223","Ken Kao","kenk616",false,"alexcmichels droche1959 AOC",false,"I think data shows a high portion of Asian students at these high schools come from poor financial backgrounds. The rich ones in NY get sent to private high schools.","en","","203","8"],["1108106049280790534","1108020712021868547","1553028044","Ken Kao","kenk616",false,"alexcmichels droche1959 AOC",false,"See my other response https://twitter.com/kenk616/status/1108104482691391488?s=21 …","en","https://t.co/TC7Urpnj1e","40","3"],["1108230201652068352","1108020712021868547","1553057644","Billy Cheney 〰️","CheneyShow",false,"kenk616 alexcmichels droche1959 AOC",false,"Thank you for educating!  Also important to note... despite only representing 15% of kids in the NYC Public School system - more Asian kids chose to take the exam than black and hispanic students, combined.","en","","6",""],["1108030356324794369","1108020712021868547","1553009997","Boomieleaks","notwokieleaks",false,"AOC",false,"Lol! The school is only 22% white!\n\nCongratulations, you've played yourself. https://twitter.com/AOC/status/1108020712021868547 …","en","https://t.co/2EKoRXX5zR","565","101"],["1108064383266160645","1108020712021868547","1553018110","Bruce Thompson51","BruceThompson51",false,"notwokieleaks AOC",false,"She knows that; she also knows that her marks--I mean, constituents--don't know that.","en","","184","7"],["1108140869553737728","1108020712021868547","1553036346","Cromagnon the breaker of tables","mikolowiska2",false,"BruceThompson51 notwokieleaks AOC",false,"Nicely done sir\nNicely done","en","","19",""],["1108024077426532354","1108020712021868547","1553008500","Angela Belcamino","AngelaBelcamino",false,"AOC",false,"The sad reality is, Republicans will think 7 students of color is progress.","en","","440","26"],["1108072319115821058","1108020712021868547","1553020002","Jason Chung","ChungSports",false,"AngelaBelcamino AOC",false,"Since when are Asian-Americans not students of color? I'm all for progressivism but let's not reinvent language to fit ideology.","en","","1177","44"],["1108165492030750722","1108020712021868547","1553042216","Navneet Kaur","NKaur99",false,"ChungSports AngelaBelcamino AOC",false,"The issue here is that there is a huge difference in education standards/resources across 5 bouroughs & if city takes steps to bridge that gap, lot more black/Latino kids will get in merit too. Give them equal resources. Merit isn’t an issue here","en","","78","4"],["1108397934188490754","1108020712021868547","1553097635","James Miller","DelNorteMiller",false,"NKaur99 ChungSports AngelaBelcamino AOC",false,"It is not resource variations among the boroughs that explains the “under representation” of certain skin colors. Consider family values and immigrant work ethic as a possible explanation for the  “disproportionate” Asian student body.  Poor people can earn high test scores too.","en","","8","1"],["1108406616519598080","1108020712021868547","1553099705","Navneet Kaur","NKaur99",false,"DelNorteMiller ChungSports AngelaBelcamino AOC",false,"Certainly. Cultural differences do make a difference as Asians/South Asians see education as religion. But resources in schools do matter a lot. Many schools have big class sizes, no aids for teachers & sadly lack basic technology. Learning is dependent on latter much more","en","","1",""],["1108452211577810950","1108020712021868547","1553110575","GuXena","guzifer2",false,"NKaur99 DelNorteMiller ChungSports AngelaBelcamino AOC",false,"Most of the Asians kids who got in and who make up the majority of student pop of these elite schools are poor and have the same resources as the other minorities (Latino and black). And they don’t see education as “religion”; they value education. \n\nYou just want equal outcome.","en","","3",""],["1108502961800601601","1108020712021868547","1553122675","Jay","sole_nyc23",false,"guzifer2 NKaur99 DelNorteMiller ChungSports AngelaBelcamino AOC",false,"If everyone’s complaining about big class sizes now they gonna be in for a surprise at the college level. The parent/kid need to actually want to succeed before anything can happen. Life ain’t fair, some kids need to work harder than others -________________-","en","","2",""],["1108021698383745025","1108020712021868547","1553007933","Taylor J. Smith","tjsphoto_",false,"AOC",false,"Were they turned down based on the color of their skin or their academic abilities? I have a strong feeling that it’s the latter.","en","","415","8"],["1108043820816654337","1108020712021868547","1553013207","Rex","StillHateRex",false,"tjsphoto_ AOC",false,"This is not about stuy's admissions, it's about what is happening before that makes this result possible.","en","","70","1"],["1108050342313422848","1108020712021868547","1553014762","Kurt Van Horn","KurtVanHorn1",false,"StillHateRex tjsphoto_ AOC",false,"I’m guessing the “before” you’re talking about is the K through 8 education that prepares (or doesn’t) kids for high school. That’s way too late. Minus 9 months to 5 years is the foundation.  If parents (preferably 2) get that right, the rest will follow.","en","","44","1"],["1108077023870795779","1108020712021868547","1553021124","Doombringer","missionhillman",false,"KurtVanHorn1 StillHateRex tjsphoto_ AOC",false,"That's not true, schools are the educators.  The onus has to be on them for failing these young people, and on the politicians for cutting education budgets, and for the school board for distributing the funds in a manner that exacerbates the whole problem.","en","","22",""],["1108162337725390849","1108020712021868547","1553041464","Kurt Van Horn","KurtVanHorn1",false,"missionhillman StillHateRex tjsphoto_ AOC",false,"My point is that the fight is mostly won or lost before kids start school. If they don’t start with the right tools, schools can’t do much for most.  If there aren’t books in the home, if they aren’t read to, aren’t nurtured, etc., they will likely have limited success in school.","en","","49","1"],["1108219839582072832","1108020712021868547","1553055174","Marcus 橘","MarcHarts",false,"KurtVanHorn1",false,"I agree Kurt and that issue needs to be handled upstream thru additional educational resources provided for these kids sooner, and not blame the school for admitting students based on test scores.","en","","6",""],["1108023847700307969","1108020712021868547","1553008446","Harry Gato ✝️ ⛪🇻🇦","harrygato",false,"AOC",false,"Equality of opportunity doesn't mean equality of outcome...","en","","189","16"],["1108355167471071232","1108020712021868547","1553087438","Winks & Nods ✨😉🇺🇸 #Karmageddon #Trumenfreude👠✨","wink_nod",false,"harrygato AOC","true","Well said. This is the entire goal of the left.  Hard work should not be required.  That’s why we have participation trohpies.  We have #GenerationVerukaSalt  who expect to get what they want right now even if they did nothing to earn it #LittleMissMarxist  #PompousLittleTwit pic.twitter.com/PL6BeRyqq5","en","/hashtag/GenerationVerukaSalt?src=hash /hashtag/LittleMissMarxist?src=hash /hashtag/PompousLittleTwit?src=hash https://t.co/PL6BeRyqq5","60","33"],["1108369699421585408","1108020712021868547","1553090903","GnoMoore","SurvatiToula",false,"wink_nod harrygato AOC",false,"No..that's not what we want...  Holy crap you people love making straw men out of our very valid arguments.\nYour comments literally prove you do not understand systemic racism. It's not your fault it happened but don't act like it's our fault we are here. Wrk tgthr","en","","15",""],["1108389025998651393","1108020712021868547","1553095511","⚡️Totally👁Veryfried⚡️","totalveryfried",false,"SurvatiToula wink_nod harrygato AOC",false,"It’s the most myopic response to cry “systemic racism” when a failure is multi varied and complex. “Equity” programs perpetuate the myth that these communities can’t thrive without the very system that you claim keeps them from succeeding.","en","","14",""],["1108400243794677762","1108020712021868547","1553098185","Martie-bee 🐝","BeeMartie",false,"totalveryfried SurvatiToula wink_nod harrygato AOC",false,"Are you literally making an argument that POC aren’t making it bc they *inherently* have lower intellect? Wowza.","en","","6",""],["1108405361222905856","1108020712021868547","1553099405","⚡️Totally👁Veryfried⚡️","totalveryfried",false,"BeeMartie SurvatiToula wink_nod harrygato AOC",false,"To be clear I would like for every community to succeed - bar none. In this case there is already a program that takes a look at “underrepresented” communities and gives spots even when the cutoff is not made. Lowering standards en mass perpetuates cycles of inequality.","en","","6",""],["1108158836790231047","1108020712021868547","1553040629","SpaceNinja 🛰","SpaceNinja15",false,"AOC freenaynow wehking_pamela VoxDawg BannedJay JB_Dougy_9217Q","true","@freenaynow @wehking_pamela\n@VoxDawg @BannedJay @JB_Dougy_9217Q\nSo, we're past the whole \"New Zealand Massacre\" thing and going right back to the \"Racism\" theme.. so predictable. Meanwhile, around the world, this is still happening: \n\n https://en.wikipedia.org/wiki/Murder_of_Farkhunda … pic.twitter.com/mUKGOYVQOd","en","/freenaynow /wehking_pamela /VoxDawg /BannedJay /JB_Dougy_9217Q https://t.co/wOsrOxkOpl https://t.co/mUKGOYVQOd","28","29"],["1108160098059325440","1108020712021868547","1553040930","SpaceNinja 🛰","SpaceNinja15",false,"AOC freenaynow wehking_pamela VoxDawg BannedJay JB_Dougy_9217Q Ilhan RashidaTlaib karoolatas aceof_red AnonCassi MikeinHalifax","true","@Ilhan @RashidaTlaib\n@karoolatas @aceof_red @AnonCassi @MikeinHalifax\n\nWhat do we do about these Christians getting slaughtered? Should we hold Every Muslim Accountable? https://christiannews.net/2019/03/17/6-christians-killed-470-flee-in-congo-attack/ …","en","/Ilhan /RashidaTlaib /karoolatas /aceof_red /AnonCassi /MikeinHalifax https://t.co/0h7oS9ZXSE","11","9"],["1108160768023973888","1108020712021868547","1553041090","SpaceNinja 🛰","SpaceNinja15",false,"AOC freenaynow wehking_pamela VoxDawg BannedJay JB_Dougy_9217Q Ilhan RashidaTlaib karoolatas aceof_red AnonCassi MikeinHalifax IlhanMN","true","Oh, here we have some JEWS murdered by a PALESTINIAN. Any words of compassion from @RashidaTlaib or @IlhanMN on these murders? http://www.bicom.org.uk/news/two-israelis-killed-in-west-bank-shooting-attack/ …","en","/RashidaTlaib /IlhanMN https://t.co/GF2P7hiEOl","5","6"],["1108162268615737344","1108020712021868547","1553041448","Tee/  RawHoney5","Jack00482816",false,"SpaceNinja15 AOC freenaynow wehking_pamela VoxDawg BannedJay JB_Dougy_9217Q Ilhan RashidaTlaib karoolatas aceof_red AnonCassi MikeinHalifax IlhanMN",false,"No. We know what they are.","en","","4","2"],["1108030729449959424","1108020712021868547","1553010086","Morris Wanchuk","J7MF2g2FPKnpaft",false,"AOC",false,"You left out the complete racial makeup of the school's student population, the corresponding GPAs of applicants broken down by race, & the Stuyvesant entrance standards, to name a few data points. By only relating 1 data point, you're being manipulative & race baiting.","en","","91","8"],["1108031846837714944","1108020712021868547","1553010353","Ralphie the American 🇺🇸","DeploRalph",false,"J7MF2g2FPKnpaft AOC",false,"If she didn’t race bait, what would she do? Come on man.","en","","32","3"],["1108020961331179520","1108020712021868547","1553007757","derek schwartz","derek_mafs",false,"AOC",false,"I think it is great that these students were accepted to this school. Only you would be able to spin it into a problem.","en","","194","14"],["1108022429669093377","1108020712021868547","1553008107","Al","WhiteWhine2",false,"derek_mafs AOC",false,"Are you saying that only 7 of 895 were smart enough to qualify? Derek that’s damm weak of you.","en","","5",""],["1108026898490318854","1108020712021868547","1553009173","Chris Campbell","ChrisCampbell32",false,"WhiteWhine2 derek_mafs AOC",false,"No actually that’s what the school said based on the performance of testing.","en","","39",""],["1108036891692142592","1108020712021868547","1553011555","Reymon Rubio","reymonrubio",false,"AOC",false,"How do you fix this without taking those seats away from Asian students that are more qualified?","en","","105",""],["1108052393923629057","1108020712021868547","1553015251","Luna Makara","GodivaKitty",false,"reymonrubio AOC",false,"Bring back Black families, traditions and entrepreneurship. Group economics which Asians practice. I understand systemic racism and the disadvantage of being disenfranchised however we have to adapt or perish.","en","","72","3"],["1108133076188782597","1108020712021868547","1553034488","jdanbennett","humerusfx",false,"GodivaKitty reymonrubio AOC",false,"The current welfare system as constructed encourages and incentivizes single parent households and rewards additional pregnancies with additional $. There needs to be reform to encourage stronger family units.","en","","9",""],["1108146150744297472","1108020712021868547","1553037605","TheDarknesse","lennypowens",false,"humerusfx GodivaKitty reymonrubio AOC",false,"This is not true and a continuation of the racist welfare queen myth.","en","","5",""],["1108146752681660416","1108020712021868547","1553037748","jdanbennett","humerusfx",false,"lennypowens GodivaKitty reymonrubio AOC",false,"No racism meant. These comments would apply to any race.","en","","8",""],["1108104482691391488","1108020712021868547","1553027670","Ken Kao","kenk616",false,"AOC",false,"According to the annual report from the mayors office, in 2016 Asian Americans had the highest poverty rate in NYC. Can we also include Asians in the discussion of racial income inequality & systemic issues in our education?","en","","86","10"],["1108105242137247746","1108020712021868547","1553027851","Ken Kao","kenk616",false,"AOC",false,"Report here:  https://www1.nyc.gov/assets/opportunity/pdf/18_poverty_measure_report.pdf … page 12. \nUpdated report for 2018 shows the same trend: https://www1.nyc.gov/assets/opportunity/pdf/NYCPov-Brochure-2018-Digital.pdf …","en","https://t.co/sCNzEWxqxZ https://t.co/elrsyqD828","24","5"],["1108381820234670080","1108020712021868547","1553093793","truthBfree","truthBfree",false,"kenk616 AOC",false,"I guarantee you most Asian households do not encourage children to watch idiotic TV shows, play video games, use smart phones. They require their children to complete their homework,  read books, learn to play musical instruments. There is discipline, chores, respect at home.","en","","2",""],["1108023168718065664","1108020712021868547","1553008284","NYCFreespirit","NYCFreespirit",false,"AOC",false,"Not sure what you’re suggesting. This seems to be a blanket statement. My daughter, who is Hispanic, was admitted to a gifted program because of academic achievement. Stuy has always accepted the best of the best. The solution is not quotas, if that’s your suggestion.","en","","135","4"],["1108024193944178688","1108020712021868547","1553008528","Vicky_Ace","victoria_ace",false,"NYCFreespirit AOC",false,"...Because it never happened to me, so it doesn't happen.","en","","38",""],["1108076573704384512","1108020712021868547","1553021016","jack_dean_1980","jackdean19801",false,"victoria_ace NYCFreespirit AOC",false,"You’re twisting his words. He’s saying the admission procedure is based on merit and then provided an example. You’re likely to take the position it’s based on race, but can’t provide evidence to support your position.","en","","15",""],["1108088124612190219","1108020712021868547","1553023770","NYCFreespirit","NYCFreespirit",false,"jackdean19801 victoria_ace AOC",false,"Thank you for clarifying. That was exactly what I was saying but you see the incendiary responses. Like @AOC is always right and it’s all premised on systemic racism which simply not true.","en","/AOC","10",""],["1108023516845232129","1108020712021868547","1553008367","Naomi Peña","naomi325",false,"AOC","true","This is the direct result of a purposeful state law to limit black/brown kids from populating these schools who at the time was over 50%. The law worked and continues to work: https://www.nytimes.com/1971/05/20/archives/assembly-votes-high-school-curb-limits-city-boards-power-to-ease.html …","en","https://t.co/OYkx1WmCf6","14","2"],["1108024536048517120","1108020712021868547","1553008610","Naomi Peña","naomi325",false,"AOC",false,"Stop perpetuating the code language that K-8 schools are subpar when this test quizzes kids on material that is NOT taught in schools...intentionally. Only way to master the mater is thru test prep. Something that all families can’t invest in.","en","","16","2"],["1108029777477283843","1108020712021868547","1553009859","michelle neumann","michelleneutim",false,"naomi325 AOC",false,"it is a math and english entrance exam. I certainly hope that these are being taught in school!","en","","31",""],["1108100615069155332","1108020712021868547","1553026748","Naomi Peña","naomi325",false,"michelleneutim AOC",false,"They type of math being covered is NOT taught until later on which is the reason why folks flock to test prep. All tactics that are done intentionally to limit who gets in.","en","","7",""],["1108102192098168833","1108020712021868547","1553027124","michelle neumann","michelleneutim",false,"naomi325 AOC",false,"Unless they drastically changed the test, which is certainly possible, when I took it it was everything that I had learned in class -  I never took a single prep course in my life","en","","16",""],["1108105730945634305","1108020712021868547","1553027968","Naomi Peña","naomi325",false,"michelleneutim AOC",false,"Not going to question how many yrs ago that was but i will tell you from personal experience with kids, the math is not taught in 8th grade.","en","","3",""],["1108134142426914816","1108020712021868547","1553034742","michelle neumann","michelleneutim",false,"naomi325 AOC",false,"well, it WAS a while ago ","en","","3",""],["1108031820346650624","1108020712021868547","1553010346","Kris N","KrsJams",false,"AOC",false,"Preparation for an exam like that starts in preK. If we want more representation in our elite high schools we have to better support those communities early on.","en","","51",""],["1108032651494154240","1108020712021868547","1553010545","Osvaldo Oyola 🇵🇷","themiddlespaces",false,"KrsJams",false,"Do you mean explicit exam prep or do you mean general quality education as a form of prep?\n\nBecause the former sounds like a problem to me. I would not want kids prepping for an exam 15 years ahead of time or whatever.","en","","14",""],["1108033404803735554","1108020712021868547","1553010724","Kris N","KrsJams",false,"themiddlespaces",false,"I do not mean test prep from preK I mean high quality instruction at community schools. However the group of students that are most prepared start some form of test prep for that exam around 5th grade and take the exam in 8th.","en","","18",""],["1108034005138661376","1108020712021868547","1553010867","Osvaldo Oyola 🇵🇷","themiddlespaces",false,"KrsJams",false,"Right . I was conflating the HS placement exams and the SAT for some reason. Oops!\n\nAnyway, even three years is too much. I feel bad for those kids. So much more fun and productive things to do with your time as a kid.","en","","8",""],["1108034390226014208","1108020712021868547","1553010959","Kris N","KrsJams",false,"themiddlespaces",false,"The “specialized” high schools are not for everyone. They are students that can sink or swim with an intense work load.","en","","22",""],["1108063473307537408","1108020712021868547","1553017893","Diane W.","Oxfarm",false,"KrsJams themiddlespaces",false,"Trust me.  The test was the easy part.","en","","17",""],["1108063656783347712","1108020712021868547","1553017937","Kris N","KrsJams",false,"Oxfarm themiddlespaces",false,"Yup I went to Stuy and the test was in fact the easiest part of my whole experience there.","en","","12",""],["1108064213501505537","1108020712021868547","1553018069","Osvaldo Oyola 🇵🇷","themiddlespaces",false,"KrsJams Oxfarm",false,"oh I'm sure! I am fairly certain I would not have lasted if I ended up at one!","en","","3",""],["1108090766394482688","1108020712021868547","1553024400","Diane W.","Oxfarm",false,"themiddlespaces KrsJams",false,"Yet Osvaldo, you have lots to contribute to the world and we need everyone to participate in this great Life experiment.  School admission is never the full measure of a person, we need to remember that.","en","","4",""],["1108125430987542530","1108020712021868547","1553032665","Osvaldo Oyola 🇵🇷","themiddlespaces",false,"Oxfarm KrsJams",false,"Definitely agree, but if a distinct segment of our society is not systematically underrepresented it is our duty to figure out why and address it.","en","","1",""],["1108128476748488707","1108020712021868547","1553033391","Osvaldo Oyola 🇵🇷","themiddlespaces",false,"Oxfarm KrsJams",false,"Clearly, this tweet was meant to read: if a distinct segment of our society *IS* systematically underrepresented https://twitter.com/themiddlespaces/status/1108125430987542530 …","en","https://t.co/HfY9pREYHv","2",""],["1108021179363872768","1108020712021868547","1553007809","Robert Bekkers","dutchguitar",false,"AOC",false,"I believe the entry requirements are pretty obvious, maybe these kids as a group just can’t meet the standards? Nothing broken there","en","","296","6"],["1108023532955541505","1108020712021868547","1553008370","Dave","TheBigRedSpoon",false,"dutchguitar AOC","true","And now you’re on the cusp of understanding systemic racism. https://www.raceforward.org/videos/systemic-racism …","en","https://t.co/8lQ8mngCB5","41","3"],["1108023962301333505","1108020712021868547","1553008473","Betsy","UrBetsyJean",false,"TheBigRedSpoon dutchguitar AOC",false,"If that's true, why is the left so against School vouchers?","en","","11",""],["1108025747514580992","1108020712021868547","1553008898","Charmed Void","charmed_void",false,"UrBetsyJean TheBigRedSpoon dutchguitar AOC",false,"They have to have victims, and if they actually solved a problem (school vouchers) , then no more victim. The left elites can't have that....","en","","9",""],["1108027755474620416","1108020712021868547","1553009377","Brianna","brielayne11",false,"charmed_void UrBetsyJean TheBigRedSpoon dutchguitar AOC",false,"They also need to keep the impoverished kids in failing schools to keep them impoverished and dependent on the govt. Future votes. Dems are racist.","en","","8",""],["1108028483370926089","1108020712021868547","1553009551","Betsy","UrBetsyJean",false,"brielayne11 charmed_void TheBigRedSpoon dutchguitar AOC",false,"It really is sick, isn't it?","en","","4",""],["1108037262200225797","1108020712021868547","1553011644","Boozy Beggar (Seth)","BoozyBeggarChi",false,"MiLindoEcuador AOC",false,"You are missing all the points AOC and others make about opportunity. If you did that it would heavily favor wealthy white kids. The system gives them the best education because it favors wealthy school districts.","en","","230","8"],["1108040814385659904","1108020712021868547","1553012491","Glem3","Glem3",false,"BoozyBeggarChi MiLindoEcuador AOC",false,"Think abt what you're saying here. If your argument is that this isn't a systemic issue, the alternative is that you believe black parents care less about their kids.\n\nUnless you can offer another explanation (and I'm willing to hear what you have to say), that's textbook racism.","en","","209","8"],["1108045086238101506","1108020712021868547","1553013509","Glem3","Glem3",false,"BoozyBeggarChi MiLindoEcuador AOC",false,"Ok, but you're saying it disproportionately affects black parents.\n\nEither your argument is that black parents naturally care less, which is the definition of racism, or you believe it's because black parents are treated differently than white parents. \n\nWhich is it?","en","","71","1"],["1108022361142394880","1108020712021868547","1553008091","EssenViews/Commentary","essenviews",false,"AOC",false,"The foundation of education is fairness, except in America...","en","","119","26"],["1108025590559526913","1108020712021868547","1553008861","All_My_Relations","Nokomaq",false,"essenviews AOC",false,"Soon they'll say that education is socialism.  Oh wait ! they are already saying so....","en","","18",""],["1108032300686675970","1108020712021868547","1553010461","Mitchell","ViceroyChicken",false,"Nokomaq essenviews AOC",false,"America performs worse on education than the rest of the modern nations, and this is part of the reason if someone doesn’t achieve higher success then it’s by default that they didn’t work hard enough instead of actually trying to see why.","en","","11","3"],["1108046188664836097","1108020712021868547","1553013772","Mitchell","ViceroyChicken",false,"Nokomaq essenviews AOC",false,"The majority of Americans want equal opportunity not a pat on back for trying A kids family financial situation shouldn’t hinder his opportunities in life Having a system where being born poor doesnt effect you getting a STEM job or starting a small business is the American Dream","en","","3","1"],["1108122146092388352","1108020712021868547","1553031882","Mitchell","ViceroyChicken",false,"Nokomaq essenviews AOC",false,"What do you do if you live in Harlem or Detroit and you don’t have a local and if you do it’s underfunded and not useful. What’s wrong with giving everyone the same chance for success?","en","","",""],["1108457244746792963","1108020712021868547","1553111775","The Conservative Latina","TheConservati19",false,"AOC",false,"Remind me who’s been running NYC again? Dems or Republicans? ","en","","109","5"],["1108462029503815680","1108020712021868547","1553112916","Jason","jrsmitty79",false,"TheConservati19 AOC",false,"Could probably free up resources to help these kids as opposed to funding sanctuary city initiatives...whaddaya think?","en","","7","1"],["1108029174436884480","1108020712021868547","1553009716","STARK STAN ACCT","_kiarajoseph_",false,"AOC",false,"This isn’t a money issue. It’s a values issue. Education starts at home. It’s not fair that teachers are expected to teach and parent students. There are many Asians in NYC and they help make up Stuyvesant’s 74% Asian student body. Values must change and results will follow.","en","","117","2"],["1108053180892499968","1108020712021868547","1553015439","Jennifer S ❄️️","jens522",false,"_kiarajoseph_ AOC",false,"It is a money issue. The only criteria to get into these schools is a test. Kids with more money get very intensive training and coaching.","en","","11",""],["1108057351490174976","1108020712021868547","1553016433","STARK STAN ACCT","_kiarajoseph_",false,"jens522 AOC",false,"1/2 of Stuyvesant students are classified as poor by the federal government.","en","","41","1"],["1108061616397041664","1108020712021868547","1553017450","Jennifer S ❄️️","jens522",false,"_kiarajoseph_ AOC","true"," https://www.google.com/amp/s/www.nydailynews.com/new-york/education/nyc-elite-high-school-students-wealthy-neighborhoods-article-1.2195345%3foutputType=amp …","und","https://t.co/zotwoWkthk","4",""],["1108032999185137664","1108020712021868547","1553010627","Rajiv Kaushal","RajThePhoenix",false,"AOC",false,"I can tell you from an Asian perspective,  it would be parents and the kids taking the responsibility of that, that's why if you ever dared to put the complete figures, you would know how Asians would be doing better... Don't throw racism card here","en","","187","6"],["1111850077931429888","1108020712021868547","1553920690","Jason Ren","JasonRe87474275",false,"RajThePhoenix AOC",false,"Politicians’s logic: If we cant beat Asian, cancel the game.","en","","",""],["1111960117644283905","1108020712021868547","1553946925","Rajiv Kaushal","RajThePhoenix",false,"JasonRe87474275 AOC",false,"Not really they call is still racism if Asians are doing well, somehow AOC think Asians are white","en","","",""],["1108027824559087617","1108020712021868547","1553009394","Senile, Old Grumpy Bastard!","bamatide214",false,"AOC",false,"You’ll play the race card every chance you get, huh? While I agree every child should have equal education opportunities. I believe it could be worded without a reference to race, by politicians! It is nothing more that your attempt to influence votes!","en","","40","7"],["1108058351613685762","1108020712021868547","1553016672","CHRIS for TRUMP⭐⭐⭐","Trumpster4Trump",false,"bamatide214 AOC",false,"Thing is. They already lost the black vote. Someone tell AOC. \n#WalkAwayFromDemocrats","en","/hashtag/WalkAwayFromDemocrats?src=hash","13","3"],["1108064789803270144","1108020712021868547","1553018207","taylor davis","AAAAAPlus",false,"Trumpster4Trump bamatide214 AOC","true","You don't even know any black people to say what \"they lost\" pic.twitter.com/1KHmmhOGYG","en","https://t.co/1KHmmhOGYG","1",""],["1108027527329665024","1108020712021868547","1553009323","DaveK67","K67Dave",false,"AOC",false,"Equal Opportunity does not mean Equal Outcome.  There are far too many variables to distinguish this as any act of systemic racism.  But you'll keep playing the victim card, because if you tell someone their a victim long enough, they'll believe it.","en","","92","8"],["1108038222515458049","1108020712021868547","1553011873","MedicinalTrolls","MedicinalTrolls",false,"K67Dave AOC",false,"Ive lived in the intecity gheto and went to school there sadly. Id say alot of it is the culture and peoples broken homes that leads to no one being able to learn. What happens is everyone dosent know how to act and the teachers spend all day yelling at kids rether then teaching.","en","","11",""],["1108043696669425664","1108020712021868547","1553013178","DaveK67","K67Dave",false,"MedicinalTrolls AOC",false,"Agreed.  Broken homes absolutely affect students' abilities to study. Just one of many factors.","en","","5",""],["1108393746545012736","1108020712021868547","1553096636","ztan","tantenaia",false,"K67Dave MedicinalTrolls AOC",false,"Asians have the lowest single parent household rate and highest academic focus culture. I would venture to guess that there were more Asians who applied to this high achievement school than whites, blacks & latinos which would account for the high asian & low black admission.","en","","1",""],["1108022144036814849","1108020712021868547","1553008039","Jules","Jules_SanJose",false,"AOC",false,"Didn't help that you alienated jobs for the people living in that area of NY. Amazon was coming with over 25k jobs. You shut it down . Convincing people their lives are better off with hand outs. Again you want to hand something to people who didn't EARN it.  America you Earn it","en","","165","12"],["1108028686748565505","1108020712021868547","1553009599","Gabriel Soto","PR_CHAUFFEUR",false,"Jules_SanJose AOC",false,"Besides, Amazon was only going to give the lowest paying jobs to NYC! They are union busters! This is why NYC has kept Walmart out! Why else  you think LIC real estate market was booming? Cuz of the invasion of outsiders from Amazon!","en","","12",""],["1108037031643344896","1108020712021868547","1553011589","Brian Guy","brianguy714",false,"PR_CHAUFFEUR Jules_SanJose AOC",false,"The average salary of those 25,000 jobs was going to be $150,000. So I'd say not","en","","3",""],["1108038653849198592","1108020712021868547","1553011976","Joshua Arnott","Winterhawks03",false,"brianguy714 PR_CHAUFFEUR Jules_SanJose AOC",false,"In case you aren't sure how averages work, that's probably 23K jobs at 65K, another 1K middle managers actually in the 6 figure range, and then a few hundred upper managers/execs in the high 6-7 figures.\n\nViola, an average of 150K, and less than 10% can afford to live there.","en","","4",""],["1108047521727827973","1108020712021868547","1553014090","Gabriel Soto","PR_CHAUFFEUR",false,"Winterhawks03 brianguy714 Jules_SanJose AOC",false,"Wow!! 23k jobs with a starting salary of 65k!!!! To stuff & sort packages!! Your right! Sign me up!! Or was that clerical jobs? Hmmm ... still sign me up!!","en","","",""],["1108077477312806912","1108020712021868547","1553021232","Doombringer","missionhillman",false,"PR_CHAUFFEUR Winterhawks03 brianguy714 Jules_SanJose AOC",false,"It wasnt a warehouse it was a headquarters, most jobs werent going to NYers and they werent entry level positions by and large","en","","1",""],["1108021113664229378","1108020712021868547","1553007794","Tom Templeton","TETempleton",false,"AOC",false,"There is no way to spin this without admitting that racism is a factor.","en","","42","1"],["1108030532259102725","1108020712021868547","1553010039","Sendoh Jin","sendohjin",false,"TETempleton AOC",false,"I would like to know how you can make the admissions test less racist.","en","","24",""],["1108033711763804160","1108020712021868547","1553010797","gihea y","ygihea",false,"sendohjin TETempleton AOC",false,"the exam paper is white","en","","16",""],["1108038799328727040","1108020712021868547","1553012010","TRUMP 2020","MAGAfor45",false,"ygihea sendohjin TETempleton AOC",false,"Yeah but the ink is black.","en","","2",""],["1108058826631270402","1108020712021868547","1553016785","Mike Scott","MikeSco23720492",false,"MAGAfor45 ygihea sendohjin TETempleton AOC",false,"The school has 81% minority enrollment.  Whites make up 19% of the student.  The problem isn’t racism.","en","","1",""],["1108187664858210304","1108020712021868547","1553047503","Moto Vader","TheDaddler",false,"oxy586 AOC",false,"I didn't study one bit for the test and got into Stuyvesant.","en","","12",""],["1108039700298825728","1108020712021868547","1553012225","DouglasTerborg","DougTerborg",false,"AOC",false,"So, as someone who worked in education, let me ask...\nHow do we ensure parental involvement, role modeling, etc. in our public schools?  The number one issue I see is a lack of that, which is unfortunately heavily tired to lower incomes as well.  To me, this is a key issue.","en","","24","2"],["1108094363861569536","1108020712021868547","1553025258","Victoria Woodhull","vwoodhull938",false,"DougTerborg NewsMassCentral AOC",false,"Schools should be family community centers. If a parent had a bad school experience they are less likely to become an involved parent.  But if they feel part of a community that will change.","en","","5","1"],["1108098387474292736","1108020712021868547","1553026217","DouglasTerborg","DougTerborg",false,"vwoodhull938 NewsMassCentral AOC",false,"It’s not just a bad experience though, either.\nMany parents are struggling to survive (single parent, low income families) are working much of the time, maybe multiple jobs.\nAt the poverty line, we also have more at-risk kids from families with drug/alcohol use, or abuse/neglect.","en","","3",""],["1108098961892610048","1108020712021868547","1553026354","DouglasTerborg","DougTerborg",false,"vwoodhull938 NewsMassCentral AOC",false,"It will require a multifaceted effort that targets families as much as it does education, and we have to realize this is as much a poverty issue as it is a race issue if not more. People in poverty are less likely to to look at high end schools or have transportation resources.","en","","4","1"],["1108415630506524672","1108020712021868547","1553101854","ALs2cents","ALs2cents",false,"DougTerborg vwoodhull938 NewsMassCentral AOC",false,"Except a lot of the Asians going to Stuvy come from the same neighborhoods and schools as a lot of the Black and Latino applicants. Do an audit and check for racism, but if it was purely based on merit, let the chips fall where they did.","en","","3",""],["1108134135523131394","1108020712021868547","1553034740","SilverFox 🌀","FoxOfSilver2000",false,"AOC",false,"What you SHOULD be doing is praising the blacks who did make it in, invite them and their families to a round table luncheon, and find out what made THEM successful so it can be shared with the rest of the community. Success doesn’t have quotas. Success is hard work rewarded.","en","","40","3"],["1108136317127483392","1108020712021868547","1553035260","L","skis416",false,"FoxOfSilver2000 AOC",false,"Racism & privilege doesn't apply here. It's a free test!\n\nAOC knows this but needs to lie to cause division. It's easy to fool the foolish\n\nMy boys took entrance tests by picking up number 2 pencils!\n\nAOC should champion #SchoolChoice & #SchoolVouchers","en","/hashtag/SchoolChoice?src=hash /hashtag/SchoolVouchers?src=hash","4",""],["1108138009604603904","1108020712021868547","1553035664","SilverFox 🌀","FoxOfSilver2000",false,"skis416 AOC",false,"Undoubtedly some of these students come from true shithole schools where everyone has pretty much given up on them. But as you can see, some DO make it. @AOC and the rest of the NYC delegation need to embrace those kids and share that hope. I bet Joe Crowley would have.","en","/AOC","4",""],["1108139562914775040","1108020712021868547","1553036034","L","skis416",false,"FoxOfSilver2000 AOC",false,"Which is why I said the teachers' union needs to address this \n\nPutting children in a highly competitive school like Stuyvesant just bc is the recipe for failure","en","","4",""],["1108141893412704256","1108020712021868547","1553036590","SilverFox 🌀","FoxOfSilver2000",false,"skis416 AOC",false,"Totally agree. And though most people would, some socialist like DeBlasio would savor the idea ( and is prob already working on it,) and that has to be stopped.","en","","5",""],["1108142960594567173","1108020712021868547","1553036844","L","skis416",false,"FoxOfSilver2000 AOC",false,"He is\n\nMeanwhile his child attended one of those special public HS...Brooklyn Tech (as did my oldest brother)","en","","3",""],["1108041234730414080","1108020712021868547","1553012591","We the Internet TV","WeTheInternetTV",false,"AOC",false,"Congratulations to those 7 students for having the test scores necessary to get into Stuy. Not an easy feat. ","en","","65","3"],["1108059190478671872","1108020712021868547","1553016872","Matuco","LoveWisdomNico",false,"WeTheInternetTV AOC",false,"190 qualified dipshit","en","","1",""],["1108060204166463488","1108020712021868547","1553017114","We the Internet TV","WeTheInternetTV",false,"LoveWisdomNico AOC",false,"\"Of the nearly 4,800 students admitted into the specialized schools, 190 are black — compared to 207 black students admitted last year out of just over 5,000 offers.\" Only 7 were admitted to Stuy. Work on your reading comprehension and maybe one day you'll be Stuy material. ","en","","11",""],["1108330438509121536","1108020712021868547","1553081542","Steven Wallstedt","stevenwallstedt",false,"AOC",false,"You see a racial issue, the real world sees kids who studied, worked hard and wanted to go to some of the best schools in the country.  They had a goal and reached it.  Not everyone should get a participation trophy.","en","","83","6"],["1108507062013775873","1108020712021868547","1553123653","LeighHolm","LeighHolm",false,"stevenwallstedt AOC",false,"Exactly, thank you Steven!I am so sick of everyone has to have a trophy or present or ribbon! We taught our kids that if you do the work and you do a good job, you get a reward called a paycheck!! No one deserves something just for showing up","en","","15",""],["1108610689130741761","1108020712021868547","1553148359","❌💖🙏newhorizons777❤🙏","newhorizon7771",false,"LeighHolm stevenwallstedt AOC",false,"Ohhh it womt be free.AOC wants 70%!!","en","","",""],["1108026558298492928","1108020712021868547","1553009092","pesach 'pace' lattin","pacelattin",false,"AOC",false," https://twitter.com/pacelattin/status/1108026433429893121?s=19 …","und","https://t.co/OKwRPuzHWC","39","4"],["1108027299897769985","1108020712021868547","1553009269","danbeers","danbeers",false,"pacelattin AOC",false,"She said only 7 black students got into Stuyvesant for this upcoming year. Which is true.","en","","22",""],["1108033048984080385","1108020712021868547","1553010639","Patty Edwards","toopool1",false,"danbeers pacelattin AOC",false,"Sometimes they make the score but like my son, have learning disability that they may suggest that he remain in regular school and take advanced classes. My son is as white as can be. He had a near perfect score as did the other students! How do I know? I met with the admin!","en","","3","1"],["1108110563656253443","1108020712021868547","1553029120","Henry","Sigerlion",false,"toopool1 danbeers pacelattin AOC",false,"I'm sorry that your son couldn't get in because of his disability. Hopefully he will remain a top student in his future HS & get into a good college. Colleges usually take a % of top students from different HS, so maybe your son will have a good shot in a less competitive school?","en","","1",""],["1108157959945809921","1108020712021868547","1553040420","Patty Edwards","toopool1",false,"Sigerlion danbeers pacelattin AOC",false,"Thanks but HS failed him because he had difficulty writing...back when he was in school computers were not being used...he is now a police officer and doing very well, although I am a nervous wreck! ","en","","3",""],["1108836677206900736","1108020712021868547","1553202239","Dan Davis","firestorm31xt",false,"toopool1 Sigerlion danbeers pacelattin AOC",false,"God bless him for becoming a protector of men.  And may he stay safe out there, so you dont have a nervous breakdown.","en","","2",""],["1108865473641353217","1108020712021868547","1553209105","Patty Edwards","toopool1",false,"firestorm31xt Sigerlion danbeers pacelattin AOC",false,"Thank you ","en","","",""],["1108367573257588736","1108020712021868547","1553090396","Bryan Green","jjgiablue",false,"AOC",false,"Wait -benefiting Asian applicants is educational inequity? What advantage are Asians given that other minority groups are not given? Other than having an amazing educationally-focused family mindset and community culture? We should celebrate their success, not racialize it.","en","","64","5"],["1108509291097571330","1108020712021868547","1553124184","brian green","briangreen710",false,"jjgiablue AOC",false,"Well, this didn't age well! But, keep it coming @AOC  ! This is fun","en","/AOC","4",""],["1108021118600830977","1108020712021868547","1553007795","Dom Knight","domknight",false,"AOC",false,"How many of the 895 had celebrity parents with access to Photoshop?","en","","50","2"],["1108022060499062784","1108020712021868547","1553008019","wilsenal","wilsenal",false,"domknight AOC",false,"Lol","und","","3","1"],["1108052531509260288","1108020712021868547","1553015284","Jason Gastrich💧","jasonagastrich",false,"AOC elizashapiro",false,"Were the people rejected because of their grades or skin color? @elizashapiro","en","/elizashapiro","54",""],["1108065327315865602","1108020712021868547","1553018335","0r161n4l h4ck3r","0r161n4lh4ck3r",false,"jasonagastrich AOC elizashapiro","true","They were rejected by their low test scores, that is it. @AOC is pandering for the Black vote, this is a #FakeNews post.\n\n\"Admission to Stuyvesant is based solely on a candidates scores on an entrance exam; race and ethnicity are not considered. \" http://blackyouthproject.com/why-are-there-so-few-black-students-at-nycs-specialized-high-schools/ …","en","/AOC /hashtag/FakeNews?src=hash https://t.co/ucLVKTNo1C","46","1"],["1108066239035985920","1108020712021868547","1553018552","Never Better","Nutsin1983",false,"0r161n4lh4ck3r jasonagastrich AOC elizashapiro",false,"But,like... I mean,ya’know... kinda like, the thing is.. like.","en","","1",""],["1108083510856683520","1108020712021868547","1553022670","Jason Gastrich💧","jasonagastrich",false,"Nutsin1983 0r161n4lh4ck3r AOC elizashapiro",false,"Did it include a swim test?","en","","1",""],["1108027315508908032","1108020712021868547","1553009272","Robert Martinez","bodhisattvabob",false,"AOC",false,"It is a system failure, but not on the part of Stuyvesant, nor any of the big three (the others being Bronx Sci and B'klyn Tech). The source starts much earlier, practically from when those kids are in the womb. Don't put this burden on Stuy et al.","en","","59","1"],["1108035154197516290","1108020712021868547","1553011141","Lissa Hattersley","lissahat",false,"bodhisattvabob AOC",false,"I must have missed the part where AOC put the failure blame on Stuyvesant......","en","","35",""],["1108163637015916544","1108020712021868547","1553041774","Allen W. Wallis","Twizzlercowboy",false,"lissahat bodhisattvabob AOC",false,"She did it was just via nasty old mean white people","en","","",""],["1108046730652803073","1108020712021868547","1553013901","Myron Cooper Jr","cmcoop11",false,"AOC SavianNugent",false,"Perhaps a test of some sort to get in would be in order?","en","","25","1"],["1108064075769147392","1108020712021868547","1553018037","Andrew Talbot","TheAndrewTalbot",false,"Nevermore6913 cmcoop11 AOC SavianNugent",false,"EXACTLY","en","","11",""],["1108153988208345088","1108020712021868547","1553039473","WeTheCitizensOfMA (taxpayers)","laxmammi",false,"TheAndrewTalbot Nevermore6913 cmcoop11 AOC SavianNugent","true","Just as you swamp creature want EQUALITY. SAME TEST FOR EVERYBODY. Too bad it doesn’t fit you entitlement or your agenda.  Guess what because there is no such thing as an equal playing field.  Ask this fraud she headed to Westchester for school right Sandy! Too good for the hood? pic.twitter.com/8Dl8A1BmLO","en","https://t.co/8Dl8A1BmLO","",""],["1108446058000973824","1108020712021868547","1553109108","CalFreedomMom ❤️🇺🇸","CalFreedomMom",false,"AOC","true","Having only 7 Black American students get into a prestigious school in NYC is NOT a “system” failure when 70% of Black children live in fatherless homes.\n\nFatherless homes is a result of Democrat Party policies. Do your homework\n\nThese kids also suffer from so much more. pic.twitter.com/7HNTWln2R5","en","https://t.co/7HNTWln2R5","21","18"],["1108737354196496384","1108020712021868547","1553178559","Steve Cav","scav61",false,"CalFreedomMom AOC",false,"It's a total failure of common core n democratic policies when the high school graduation rate is under 70% in some cities yet these morons are calling for free college tuition but students don't finish free high school.","en","","1",""],["1108165076568162304","1108020712021868547","1553042117","kenneth aull 🌹","KenAull",false,"AOC",false,"For a STEM Only high school, you need a rigorous STEM test.  Only one in 30 is admitted.  You really need to go visit and see the intensity of this type of school.   What America needs is a Stuyvesant type school available for EVERY QUALIFIED student in every district in America.","en","","57","1"],["1108166638413795329","1108020712021868547","1553042489","Rocks~1968 All Over Again","julynewmoon",false,"KenAull AOC",false,"And schools preparing the younger minds so they are prepared for a \nSTEM High School requirement #EducationStartsEarly","en","/hashtag/EducationStartsEarly?src=hash","6",""],["1108022469229727744","1108020712021868547","1553008117","EsDesquire","Es_Desquire",false,"AOC",false,"It's one of the toughest high schools to get into. You ever think they accept the smartest students?","en","","24","3"],["1108022830216564736","1108020712021868547","1553008203","Bill Nash","billndotnet",false,"Es_Desquire AOC",false,"You're so close to getting it.","en","","8","1"],["1108054029064519680","1108020712021868547","1553015641","Adam Ryland","conway299",false,"billndotnet Es_Desquire AOC",false,"No he got it the first time.","en","","",""],["1108024842400354304","1108020712021868547","1553008683","Gonzalo Vergara","GlenSalo",false,"AOC",false,"What happens at home matters. 74% of kids at Stuyvesant are Asian.  The term \"Tiger Moms\" originated in reference to Asian mothers to drive their kids hard to succeed.  Perhaps people should start learning from them","en","","58","1"],["1108026423464394752","1108020712021868547","1553009060","Matthew","mattdude255",false,"GlenSalo AOC",false,"The problem with that is that some of these parents do things borderline child abuse","en","","5",""],["1108029855533170690","1108020712021868547","1553009878","Gonzalo Vergara","GlenSalo",false,"David17498001 mattdude255 AOC",false,"TOUCHE!","fr","","2",""],["1108064034253873152","1108020712021868547","1553018027","MF","meli788O",false,"GlenSalo David17498001 mattdude255 AOC",false,"The Asian community also statistically have the higher suicide rate. How about our schools just get all the same resources and all our students the same education.","en","","",""],["1108074519128731648","1108020712021868547","1553020527","Gonzalo Vergara","GlenSalo",false,"meli788O David17498001 mattdude255 AOC",false,"It's not an issue of schools and resources.  It's the home environment, where study is not only encouraged but demanded as well, that counts more so than anything else.","en","","1",""],["1108075349194219522","1108020712021868547","1553020724","MF","meli788O",false,"GlenSalo",false,"The Asian community also forms 90% of the students that take outside of school prep programs that cost a ton of money that others can’t always afford. It’s not only at home. If these children had all the tools evenly it would be better chances for the students.","en","","",""],["1108076258791837696","1108020712021868547","1553020941","Gonzalo Vergara","GlenSalo",false,"meli788O",false,"There are programs for those that can afford it... and you know how Asian parents afford it?  By working really hard, saving and skimping so that they can pay for them.  All I'm saying is that we can learn from this example","en","","2",""],["1108029850353393664","1108020712021868547","1553009877","BEV","_Jack_Sour",false,"AOC dopehope_2",false,"My brother went to Stuyvesant .. I could’ve went too if I went as hard as him to pass the test .. somethings ain’t meant to be handed out.. but what could be handed out is the resources Stuyvesant gets .. instead of tryna force stuy to accept everyone just make our schools better","en","","102","7"],["1108046173623984128","1108020712021868547","1553013768","Katherine McNair","KatBonesCrazy",false,"_Jack_Sour AOC dopehope_2",false,"You're absolutely correct.  MAKE ALL OUR SCHOOLS BETTER!!!!","en","","7","1"],["1108186607688077312","1108020712021868547","1553047251","KAD","KSLAKLD",false,"AOC",false,"Alexandria will come after Asian kids. They are too smart ","en","","43","2"],["1108382872250077189","1108020712021868547","1553094044","Nickla Roberts-Byrd","nicklaroberts",false,"AOC",false,"Need to study more \nand be better prepared for the test ?","en","","20",""],["1108396384531689474","1108020712021868547","1553097265","Scott_psc","psc_scott",false,"nicklaroberts AOC",false,"Honey that takes too much time and energy. So much easier to blame everyone else. Since she made it I wonder how she accomplished it?  Did she work hard or was it given to her?  If she worked hard why can’t others do the same?","en","","25",""],["1108022063099314179","1108020712021868547","1553008020","AppSame","AppSame",false,"AOC TheDemocrats BilldeBlasio",false,"Yes another @TheDemocrats who cares nothing about Black youth\nBill de Blasio\n@BilldeBlasio","en","/TheDemocrats /BilldeBlasio","44","5"],["1108063753571102730","1108020712021868547","1553017960","Joel","Happyja",false,"AppSame AOC TheDemocrats BilldeBlasio",false,"I agree, Democrats blaming Democrats for failed Democrat policies.  It’s funny to watch.","en","","9",""],["1108065407292694528","1108020712021868547","1553018354","Justin Garrett","JustinG54126720",false,"Happyja AppSame AOC TheDemocrats BilldeBlasio",false,"Not bending down and licking people’s boots just because they are in your party; that would beta funny concept to you.","en","","",""],["1108066110988005377","1108020712021868547","1553018522","Joel","Happyja",false,"JustinG54126720 AppSame AOC TheDemocrats BilldeBlasio",false,"Still funny to see them act like they are blaming Republicans when it’s obviously Democrat policies that failed.","en","","6",""],["1108067188022411265","1108020712021868547","1553018779",".","smdftbbn",false,"Happyja JustinG54126720 AppSame AOC TheDemocrats BilldeBlasio",false,"It’s not Democrat policies there’s way too many intricacies to blame a specific policy it’s just how NY is set up.","en","","",""],["1108068724421132288","1108020712021868547","1553019145","Joel","Happyja",false,"smdftbbn JustinG54126720 AppSame AOC TheDemocrats BilldeBlasio",false,"NY is run and set-up by Democrats.  Put the blame on those who are responsible.","en","","10",""],["1108246237604732928","1108020712021868547","1553061467",".","smdftbbn",false,"Happyja JustinG54126720 AppSame AOC TheDemocrats BilldeBlasio",false,"Democrats don’t have anything to do with who goes to what school you bot","en","","",""],["1108318448826884097","1108020712021868547","1553078684","Joel","Happyja",false,"smdftbbn JustinG54126720 AppSame AOC TheDemocrats BilldeBlasio",false,"AOC is blaming someone for this, who is it then?","en","","",""],["1108220008704806913","1108020712021868547","1553055214","Lorem Ipsum","_lorem_ipsum_1",false,"AOC EvaGree85009375",false,"@EvaGree85009375: \n\"Is there a possibility that only these 7 students met the academic standard of this school?  Injustice looks like accepting students based on the color of their skin to fulfill affirmative action quotas.\"","en","/EvaGree85009375","27","2"],["1108359400132173824","1108020712021868547","1553088447","virg williams","Vwms63",false,"AOC",false,"This is not a race issue, it is a cultural issue. If you want to equalize the education system then start looking at WHY certain cultures excel and others don’t. It has nothing to do with race and everything to do with the breakdown of family units that has become the norm.","en","","39","1"],["1108403031157006336","1108020712021868547","1553098850","Harley","HarleyMonster",false,"AOC","true","You are correct it is a system failure by Democrats and progressive states. People like you who blame the color of their skin as the reason they can't succeed in this country is utter bulls*hit. pic.twitter.com/Z9L5Uzfwws","en","https://t.co/Z9L5Uzfwws","7","6"],["1108405056301195265","1108020712021868547","1553099333","Harley","HarleyMonster",false,"AOC","true","More from Carl Jackson.. pic.twitter.com/kePpQqhWD0","en","https://t.co/kePpQqhWD0","3",""],["1108229097090482177","1108020712021868547","1553057381","Billy Cheney 〰️","CheneyShow",false,"AOC",false,"Less than 5% of Black and Hispanic kids chose to take the test and/or apply.","en","","14","2"],["1108233396377907200","1108020712021868547","1553058406","Billy Cheney 〰️","CheneyShow",false,"AOC",false,"Well, and the funny thing is... NYC does allow school to chose kids based on affirmative action. This school in particular, by law, MUST chose only the highest exam scores taken.","en","","2","1"],["1108234606174564352","1108020712021868547","1553058694","Billy Cheney 〰️","CheneyShow",false,"AOC",false,"I miswrote that* does not allow* it should say","en","","","1"],["1108212771500539904","1108020712021868547","1553053488","WB","nouseriously",false,"AOC",false,"Asian kids, often the children of 1st generation immigrants,  shouldn't be discriminated against because of their race. And if you're suggesting putting more black or latino kids in Stuyvesant regardless of their test scores, that's what you'd be doing.","en","","51","1"],["1110695574116933633","1108020712021868547","1553645435","Shah Jacob","shahjacobb",false,"nouseriously AOC",false,"Exactly. This sounds more like a pandering tool to appeal to her voter base. 74% of Stuy is first-generation, poor Asian Americans, not fucking white peoole. Her device of bastardizing white people with income inequality fails here. This is a MERIT based system, not racial.","en","","",""],["1108528520416747521","1108020712021868547","1553128769","We Fight 4 Freedom","WeFight4Truth",false,"AOC",false,"It’s decades of failed liberal ideas in NY, including teacher’s unions, that are destroying young black and Latino minds. Without poverty and crime and chaos YOU LIBERALS WOULD HAVE NO POWER! You need chaos and poverty. People like you are the cause of it all. YOU MAKE ME SICK.","en","","5","1"],["1108369485143175170","1108020712021868547","1553090852","Second City Bureaucrat","CityBureaucrat",false,"AOC",false,"How many are asian?","en","","19",""],["1108398977588830209","1108020712021868547","1553097883","a stark form","abjectyetalive",false,"CityBureaucrat AOC",false,"+61%","und","","2",""],["1108399347211948034","1108020712021868547","1553097972","Second City Bureaucrat","CityBureaucrat",false,"abjectyetalive AOC",false,"68% black and latino, 61% asian. Checks out.","en","","3",""],["1108411607468703744","1108020712021868547","1553100895","Rebecca Thought Criminal 63788","starboard_light",false,"AOC",false,"Who runs the public education system in NYC and by and large everywhere else too?","en","","16","1"],["1108460974003101697","1108020712021868547","1553112665","Bill Barbari","DrJava1982",false,"starboard_light AOC",false,"The United Federation of Teachers runs the public schools in NYC.","en","","1",""],["1108423557057601536","1108020712021868547","1553103744","BonkPolitics","BonkPolitics",false,"AOC",false,"What it tells you is NYC public schools in black/Hispanic communities along with parents of black/Hispanic kids are failures.\n\nThere's no reason a black/Hispanic kid can't pass the same tests white/Asian kids do unless you believe they are somehow genetically inferior.\n\nDo you?","en","","9","2"],["1108694023257100289","1108020712021868547","1553168228","Dez 🥍","dezlax1",false,"AOC",false,"I’ve heard that 74 % od Stuyvesant student pop is Asian....are they all wealthy Asians?  Real question.","en","","5",""],["1108694492675297287","1108020712021868547","1553168340","6xPsycho TrapMoneyBrady","damnJAYfly12",false,"dezlax1 AOC",false,"Is there really such a thing of a broke Asian","en","","1",""],["1108695091248619520","1108020712021868547","1553168482","Scott Kincaid","scottk517",false,"damnJAYfly12 dezlax1 AOC",false,"Yes.. come to Flushing... I will show you..","en","","7",""],["1108368722572402688","1108020712021868547","1553090670","Patroit","82ParaFalcon",false,"AOC",false,"Everything is earned , nothing should be given because of race ,color, or religion. I am Argentine and I have worked hard and earned my way. Thank You America ","en","","8","1"],["1108742749300445184","1108020712021868547","1553179845","Matteo Ceurvels","matteo_ceurvels",false,"AOC",false,"So we're considering Asians aren't a minority now? Your logic is flawed given that Asian-Americans have one of the highest poverty rates in NYC. It's a matter of cultural values where Asian families place a greater emphasis on education than most other \"races\" combined.","en","","9","1"],["1108756795470872576","1108020712021868547","1553183194","No Use For A Name (not the punk band)","SlapdatAssPaPa1",false,"AOC NYCMayorsOffice",false,"Dear congress woman I'm a supporter of your cause and I'm also a member of Democratic socialist of America.  But back in 1993 I was among the 7 Asians out of 50 who took the #SHSAT and failed. I hate the fact @NYCMayorsOffice don't believe SHSAT is the fairest way for SHS entry.","en","/hashtag/SHSAT?src=hash /NYCMayorsOffice","2",""],["1109203899641151489","1108020712021868547","1553289792","No Use For A Name (not the punk band)","SlapdatAssPaPa1",false,"AOC NYCMayorsOffice",false,"Instead of punishing the Asians and scrapping the #SHSAT how about strengthening curriculum so kids can learn more about what's on the test instead of having to spend money to pay for #testprep.","en","/hashtag/SHSAT?src=hash /hashtag/testprep?src=hash","4","2"],["1108488610037272576","1108020712021868547","1553119254","TEXAS AF!/Nationalist 🇺🇸","Troy75801",false,"AOC",false,"No, this is what BAD PARENTING OR NO PARENTING LOOKS LIKE .\n\nYou libs have subsidized the destruction of the family and this is what you have created.\n\nThis is on liberal policy.\nIt's not on the average white guy or the founding fathers, it's on you and your libtard ilk, own it!","en","","1","1"],["1108502037443108865","1108020712021868547","1553122455","Francine ❤❤","Francin04915559",false,"Troy75801 AOC",false,"Isnt it based on grades, scores, extra curricular, etc? EVERYTHING is made into a race issue. I see how it looks to her but before passing judgement or making assumptions questions should be asked. If theres a hispanic kid & a white kid & the hispanic kid has the better grades,","en","","1",""],["1108510858492211201","1108020712021868547","1553124558","TEXAS AF!/Nationalist 🇺🇸","Troy75801",false,"Francin04915559 AOC",false,"She's lying. These libtards don't believe the  their spewing!\nShe's just spinning it to cause economic and cultural discourse.","en","","1",""],["1108514785602228224","1108020712021868547","1553125494","Francine ❤❤","Francin04915559",false,"Troy75801 AOC",false,"I dont understand WHY they WANT everyone hating each other, being divided, and to cause economic turmoil though. No one benefits from that. Its craziness","en","","",""],["1108782957261664256","1108020712021868547","1553189431","TEXAS AF!/Nationalist 🇺🇸","Troy75801",false,"onedovealone Francin04915559 AOC",false,"Yep!","und","","1",""],["1108388407921643520","1108020712021868547","1553095363","NegotiatingReason","PeligrosoCarlos",false,"AOC",false,"What about the kids who don't participate? What if there is a lack of responsibility or accountability held to the parents of these failing minorities? Or are the teachers you represent so bad at their job that getting their class to focus and do the work is impossible?","en","","3","2"],["1108403595257565185","1108020712021868547","1553098984","Bradley","BradWall45",false,"AOC",false,"You know when I thought someone had an advantage over me I didn’t look at the inequality between me and whoever. I knew I had to work that much harder if I wanted it. Does no one want to work for their accomplishments? Should it be handed to us? Stop crying and get to work!","en","","12",""],["1108457525572177921","1108020712021868547","1553111842","Willie Ortiz","OrtizRCFOP614",false,"AOC",false,"Injustice? 66% of students in all selective HS in NYC are Asian. What makes these schools good is they have High Admission Standards that require students to perform. Lowering those test standards so more brown and black could attend is in fact an INJUSTICE! #FreaknRican4Trump ","en","/hashtag/FreaknRican4Trump?src=hash","5","1"],["1108896170640695298","1108020712021868547","1553216424","Hermans ECO Fashion","hermanseco",false,"AOC NormanBuffong",false,"The world is very unfair place . I don't know how to get into people's minds and make them change their close minded entitled views . Black people deserve better.","en","","3","2"],["1108544567329128449","1108020712021868547","1553132595","Dems☠Love💀Dead☠Babies","AnnKelly007",false,"AOC",false,"Every student that I had that was accepted into Stuyvesant was a minority who received free breakfast & lunch. Every single one of them worked their asses off to get there. Every one! You do them such a disservice & dishonor  with your tweet. Stuy having standards isn't a failure","en","","5","1"],["1108396789755977729","1108020712021868547","1553097362","Norbit Peters","ItsNorbitPeters",false,"AOC","true","73% of black students come from single-parent households, a condition calculatingly encouraged by Democrat welfare requirements!\n\nThe reason?\nGov't-dependency = Democrat votes!\n\nOnce u realize it's all about Democrats keeping power is when everything they do begins to make sense. pic.twitter.com/MrCfwtm1HO","en","https://t.co/MrCfwtm1HO","2","3"],["1108396901315928065","1108020712021868547","1553097388","Sullivan Cauley","sullytroy100",false,"AOC",false,"Or you could just let in the kids with the best test scores","en","","5",""],["1108412894025179136","1108020712021868547","1553101201","Michael Fujimori","the_Obake",false,"sullytroy100 AOC",false,"Sully, when are you ever going to learn that Twitter is no place for common sense.","en","","2",""],["1108400570061258752","1108020712021868547","1553098263","Anna Fine AF","somefinetweets",false,"AOC",false,"The school clearly accepts students based on testing, not profiles of students.\nThe fact they didn't get in is, as you said, a symptom of system failure. Minorities should be given equal educational opportunity early in life to give them an equal shot at testing into this school.","en","","3",""],["1108860711441182721","1108020712021868547","1553207969","mrscog","mrscog58",false,"somefinetweets AOC",false,"It' s 74% Asian students. They ARE the minority!! Jeez...","en","","3",""],["1108370153643872256","1108020712021868547","1553091011","Vida","wheezyvida",false,"AOC",false,"7 Black students but how many ACTUAL PEOPLE OF COLOR Alexandria?  SEVENTY FOUR PERCENT PEOPLE OF COLOR, AKA ASIAN.  Or are they not brown enough? Enough with your racial divisiveness bullshit.","en","","16",""],["1108523508831830016","1108020712021868547","1553127574","Harry Haszcrak","haszcrak",false,"wheezyvida AOC",false,"It's all about that race, bout that race, with AOC. Nothing else matters. A one-term wonder for sure.","en","","",""],["1108383532949237760","1108020712021868547","1553094201","Klondike The Cat","KlondikeTheCat",false,"AOC",false,"The majority of black or Latino students are trapped in government schools.\n\nVouchers = options","en","","4","3"],["1108385212252200960","1108020712021868547","1553094602","Eugènie La Borgia","EugenieLaBorgia",false,"KlondikeTheCat AOC",false,"Poor old Cortez, she still thinks that grasping at straws will save her from drowning as the waves of unpopularity wash over her head. Watching her is like watching the Keystone Cops!","en","","1",""],["1108396083099504640","1108020712021868547","1553097193","_Marta_","_Marta_",false,"EugenieLaBorgia KlondikeTheCat AOC",false,"For someone who claims to be an American patriot, you re-tweet of lot of news stories from the state-run newspaper of China. Hello, Russian bot.","en","","",""],["1108409685760077824","1108020712021868547","1553100436","Klondike The Cat","KlondikeTheCat",false,"_Marta_ EugenieLaBorgia AOC",false,"Thank you for your input Miss Marta,\n\nI hope you can make a new friend today.\n\n","en","","1",""],["1108418696936972288","1108020712021868547","1553102585","_Marta_","_Marta_",false,"KlondikeTheCat EugenieLaBorgia AOC",false,"Ooooo, and auto-Block built in!  Someone actually wrote some sophisticated code.  Either that, or “EugenieLaBorgia” is a real but very thin skinned individual who can’t take what they dish out.","en","","",""],["1108419998391783424","1108020712021868547","1553102895","Klondike The Cat","KlondikeTheCat",false,"_Marta_ EugenieLaBorgia AOC",false,"Thanks Marta, Eugènie La Borgia is real and she is really nice. Why are you mad at her?\n","en","","1",""],["1108431889591922688","1108020712021868547","1553105730","_Marta_","_Marta_",false,"KlondikeTheCat EugenieLaBorgia AOC",false,"*shrug* Fair enough, if you know her in person. I have learned from very sad experience that venting online can be incredibly destructive.  Btw she blocked me, so I can’t see anything she’s posting.  I like your feed, by the way—lots of delightful videos (really).","en","","1",""],["1108434254214500352","1108020712021868547","1553106294","Klondike The Cat","KlondikeTheCat",false,"_Marta_ EugenieLaBorgia AOC",false,"Thank you, yes, I consider Eugènie a friend and I enjoy reading her comments from Paris. I hope that she never blocks me!\n\nHave a great day, today is:\n\n#InternationalDayOfHappiness\n\n","en","/hashtag/InternationalDayOfHappiness?src=hash","",""],["1108747656761917440","1108020712021868547","1553181015","Mary Miller 🌟 🌟 🌟","ThriftMoments",false,"AOC",false,"This is the top rated school in NYC.  Students can take the admissions test.  Entrance is based solely on this score & their desire to go to Stuyvesant to study math, science, tech.","en","","2","1"],["1108750256357941251","1108020712021868547","1553181635","BubblePuppy7","BubblePuppy7",false,"ThriftMoments desertratphil AOC",false,"Based on their score? Racist! We don’t do anything based on merit any longer! ","en","","2",""],["1108482890763898880","1108020712021868547","1553117890","Sean Ess","SSinSeattle",false,"AOC",false,"You wanna talk racism?  What about how few Asians are in the NBA....\n#LiberalismIsAMentalDisorder","en","/hashtag/LiberalismIsAMentalDisorder?src=hash","2","2"],["1108487504360103936","1108020712021868547","1553118990","Dorcas","wisecc1",false,"SSinSeattle ImmoralReport AOC","true","And wacky Democrats that want to keep\" y'all in chains.\" Biden.  pic.twitter.com/YPPgVoH0ON","en","https://t.co/YPPgVoH0ON","1",""],["1108398080334983169","1108020712021868547","1553097670","James Dark Wolf🌟🌟🌟","JamieOrtegafree",false,"AOC",false,"Why are you diminishing the accomplishments of these seven? Lowering the bar doesn't encourage excellence.","en","","4",""],["1108398894860431361","1108020712021868547","1553097864","Puddintane","imwren",false,"JamieOrtegafree AOC",false,"Thank you, the lowered bar has been hugely destructive.","en","","1","1"],["1111114417532334080","1108020712021868547","1553745295","Bryan Green","jjgiablue",false,"AOC",false,"According to Alexandria Ocasio-Cortez, at any school where Asian students overwhelmingly excel compared to other groups - \"This is what injustice looks like.\" According to AOC, when it comes to education, Asian success is synonymous with \"injustice.\"","en","","3",""],["1111213993966866433","1108020712021868547","1553769036","grw1177 🌀","grw1177",false,"jjgiablue AOC",false,"Blowing out my candle does not make yours shine brighter.","en","","",""],["1111255469127950337","1108020712021868547","1553778924","Bryan Green","jjgiablue",false,"grw1177 AOC",false,"I understand your point but I truly don't see a meritocratic approach that has benefited Asian students as the root cause of what is seen at NYC magnet schools. It's what happens before students ever take the SHSAT - at home, at elementary school, and at middle school.","en","","1",""],["1111257022928953349","1108020712021868547","1553779295","grw1177 🌀","grw1177",false,"jjgiablue AOC",false,"Bryan - I agree with you.  She's trying to discredit other students' hard work and subsequent success and call it \"injustice\".  Until other student's and families are willing to step up and do the hard work for their own benefit, they should not cry foul.","en","","2",""],["1111258323465072640","1108020712021868547","1553779605","Bryan Green","jjgiablue",false,"grw1177 AOC",false,"Well I certainly agree with that. I do think that black and latino students need a benefit, and I try to do my part through participation at latino lawyer events where I speak and encourage interest in STEM and IP law, but as you note - the hard work has to come from within.","en","","2",""],["1108400079797399552","1108020712021868547","1553098146","Bearfort","So_ynoT",false,"AOC",false,"NYC is run by Democrats*","en","","4","1"],["1108375756806197250","1108020712021868547","1553092347","trkn4@msn.com","trkn4",false,"AOC",false,"You do realize that this school is 76% Asian and 19% white - and the school is 100% based on test scores.   If NYC isn't providing education equality - sounds like you should be talking to NYC administration/city councils - not telling the rest of America it's their fault.","en","","2","2"],["1108588956159897600","1108020712021868547","1553143178","🇺🇸 Hero of the Republic","RepublicanMarty",false,"AOC",false,"Once again the #democrats are using logical fallacies and appealing to the idiocy of their general base to make rash assumptions based on minute and partial evidence  Do #america a favor @AOC and just resign already before you kill us with your ignorance and make me a ","en","/hashtag/democrats?src=hash /hashtag/america?src=hash /AOC","3","1"],["1108486032830418945","1108020712021868547","1553118639","Clay Shaw","DominicDeCocoa",false,"AOC",false,"Actually this is what merit based fairness looks like.  If you think it’s unfair, try selling this to your extremely Asian Queens constituency in 2 years","en","","8",""],["1108490095131148288","1108020712021868547","1553119608","Carolyn","wooleeacre",false,"AOC RepAOC",false,"Injustice is when you pick race over merit for kids who work hard, study hard to get into colleges over what their race might be.. @AOC @RepAOC how bigoted and race baiting you are, how dare you in your arrogant,  silver-spooned, coifed little brain post crap like this.","en","/AOC /RepAOC","7",""],["1108486117337321473","1108020712021868547","1553118659","SuperDaveLj","SuperDaveLj",false,"AOC",false,"So you're saying that their skin color somehow has some impact on their ability to pass the very difficult entrance exam? What would you suggest? Lower the standards so more \"people of color\" meet the requirements?  Do you lower the standards for all, or just for people of color?","en","","9",""],["1108379817563570179","1108020712021868547","1553093315","BRC🇺🇸","bcordon32",false,"AOC",false,"7 Black & 33 Latino students. Do we know how many applications were submitted? How many Asian and other ethnicities were admitted? What % do white students make up of the total class? I always feel like stories like this suppress all the facts. Congrats to the ones that made it!","en","","8",""],["1108511097429114881","1108020712021868547","1553124615","BRUCE - #MAGA - #Trump2020","BruceChambers",false,"AOC",false,"You are a Liar. Why would you lie to the American people? We are not stupid. The New York Times reported that “mostly low-income Asian students” make up a whopping 74 percent of students at Stuyvesant, and 66 percent of students admitted this year are Asian-American.","en","","3","1"],["1108383729414782981","1108020712021868547","1553094248","Sandrita","MissStunnaaaa",false,"AOC",false,"It’s because they all Asian homegirl. You gotta take a test to get in. Numbers don’t lie","en","","7",""],["1108397353638088706","1108020712021868547","1553097496","ztan","tantenaia",false,"AOC","true","This is what many asians do to study for entrance exam for weeks. pic.twitter.com/ug2n5OGEjH","en","https://t.co/ug2n5OGEjH","4","1"],["1108400220315045888","1108020712021868547","1553098180","#One God On Spotify/Apple Music","Bates_STL",false,"AOC",false,"Maybe we should be focusing on restoring public education instead of free college right now. Just a thought.","en","","7",""],["1108383067981447168","1108020712021868547","1553094090","Karen Unverzagt","KSU_Accessories",false,"AOC",false,"Stats show minority enrollment is 81%.Did you check the stats on how many of those NOT accepted were NOT qualified to be accepted. Irresponsible to throw out one side of the information. If they were qualified you have a point. If not, you are irresponsible for stirring negative","en","","2","2"],["1108394145134137345","1108020712021868547","1553096731","Hector D.","soyyomicorazon",false,"AOC",false,"The question is how many black kids actually applied for admission, before considering discrimination. Socialists “worry” so much about discrimination.","en","","2","2"],["1108743289002319872","1108020712021868547","1553179974","Sarah⭐⭐⭐","Trump2020AK",false,"AOC","true","Explain this\n\nIf you can pic.twitter.com/QJc5YnaMcR","en","https://t.co/QJc5YnaMcR","2","2"],["1108585430495227904","1108020712021868547","1553142337","Buster Bunker 🕇 🗡⚔🔫🏹🛡","BusterBunker1",false,"AOC","true"," pic.twitter.com/hu3qZlwaHb","und","https://t.co/hu3qZlwaHb","3","1"],["1108377336167178240","1108020712021868547","1553092724","J THE DENIER","jthedenier",false,"AOC",false,"If only seven meet the criteria then what's your point. Now we have to lower standards. You probably couldn't get in now. As an adult. In Congress. Cuz I've been listening. But these seven kids did and you have to shit on that achievement. Are you mad or what","en","","3","1"],["1108545397058871296","1108020712021868547","1553132793","Flo C","TrebleandFlo",false,"AOC","true","Education inequity is a major factor in the racial wealth gap. This is what injustice looks like. #fixthepipeline #donttreatsymptoms #shsat pic.twitter.com/9df9wf35ul","en","/hashtag/fixthepipeline?src=hash /hashtag/donttreatsymptoms?src=hash /hashtag/shsat?src=hash https://t.co/9df9wf35ul","4",""],["1108547347871608832","1108020712021868547","1553133258","SHSAT Sunset: Replace Hecht-Calandra","shsatsunset",false,"AOC",false,"by your own graphic, more Black students are proficient than Asian students.","en","","",""],["1108560610504134657","1108020712021868547","1553136420","Flo C","TrebleandFlo",false,"shsatsunset AOC",false,"When is 19% greater than 66% or 21% greater than 54%? #readingcomprehensionmatters","en","/hashtag/readingcomprehensionmatters?src=hash","",""],["1108739609834467328","1108020712021868547","1553179097","Flo C","TrebleandFlo",false,"shsatsunset AOC","true","Also take a look at this data on Brooklyn Tech students. SHSAT was in place since 1971. There is a feeder problem, fixing admissions is too late pic.twitter.com/PIAr5Bnf7b","en","https://t.co/PIAr5Bnf7b","4","1"],["1108744164177575937","1108020712021868547","1553180182","SHSAT Sunset: Replace Hecht-Calandra","shsatsunset",false,"TrebleandFlo AOC",false,"Every psychometrician interviewed believes we should NOT be using 114 multiple-choice questions as the SOLE measure of admissions.\n\nLet's fix that problem THEN we can discuss what else can also be an issue.","en","","",""],["1110345397078294528","1108020712021868547","1553561946","Cee Jay","ChanJ03Ge",false,"AOC","true","The reasons why “only have 7 Black students accepted into Stuyvesant” is because most Black & Hispanic/Latino students are NOT high school READY. They barely make it at the primary and secondary levels in NYC, and that’s that problem this city needs to fix. pic.twitter.com/nCsE1UR0h4","en","https://t.co/nCsE1UR0h4","5",""],["1108874926092664833","1108020712021868547","1553211358","Herkimer","Patrickmatrades",false,"AOC",false,"So white and Asian kids are the minorities.","en","","2","1"],["1108385474232627200","1108020712021868547","1553094664","Tozy","TozyTerry",false,"AOC",false," https://twitter.com/tozyterry/status/1108367215244513280?s=21 …","und","https://t.co/wDsvctuSHz","2","1"],["1108534244836544513","1108020712021868547","1553130134","Paul Impellizeri","casper756",false,"AOC",false,"Yes it is unfair but it is truly performance based. If you change the standards you will diminish the value of the special program. Study hard and you will get in there is no magic in this one. Figure this out and you win","en","","6",""],["1108385793876332545","1108020712021868547","1553094740","mrbiglefty","Biglefty",false,"AOC",false,"I'm an avid @aoc supporter and agree that the NYC education system has been atrocious for so long.. but to say that the reason only 7 black kids got into Stuyvesant is due to a racial wealth gap... well thats just 100% wrong!","en","/AOC","6",""],["1108555478995558401","1108020712021868547","1553135196","LvLx Ninja","LVLxNinja",false,"AOC",false,"Are Asians not even worth mentioning in this? By favoring two larger minority groups, you will make it unfair for other sub-minorities. Opportunities should be based on merits not skin color","en","","5",""],["1108453836723798021","1108020712021868547","1553110963","Christine AuYeung","krissee007",false,"AOC",false,"I am disappointed in you @aoc for jumping on this bandwagon. This argument is racist and pits #aapi against other minorities. Consider bringing #poc together. SHAME ON YOU. #solidarity #notyourwedge","en","/AOC /hashtag/aapi?src=hash /hashtag/poc?src=hash /hashtag/solidarity?src=hash /hashtag/notyourwedge?src=hash","5",""],["1108468060149743617","1108020712021868547","1553114354","Captain GreyBeard","HisNameSethRich",false,"AOC",false,"Any studies on IQ gaps between races? \n\nWe both know that they exist, I simply wonder if you have the stones to admit it and quit blaming \"inequality\".","en","","2","1"],["1108459594324590592","1108020712021868547","1553112336","ibidPREP","ibidPREP",false,"AOC",false,"To use numbers in a more comprehensive sense: although as is oft cited 68% of all NYC public students are Black or Latino etc. etc., only 44% of all SHSAT test takers were Black or Latino. Even before we talk about the test itself, it is clear there is an info gap at play.","en","","2","1"],["1108870477030834176","1108020712021868547","1553210298","جلال التريكي","lovmyhorse2",false,"AOC",false,"girl you are so out of line in Congress... You need to slow down and look what has already been accomplished by the people before you. .. You're so bust running your mouth you don't think before you speck.. Stop being an idiot before you're impeached...","en","","5",""],["1108428908314140674","1108020712021868547","1553105020","Stephan Polansky","snp042000",false,"AOC",false,"Let’s leave race off the application and let merit speak for itself","en","","5",""],["1108747156179976198","1108020712021868547","1553180896","Will Bartlett","WillBartlett19",false,"AOC",false,"Maybe blame the parents, not the system.  Parents are the reason children are successful not the government.","en","","5",""],["1108591579667681280","1108020712021868547","1553143803","MamaBear","mamabearpa06",false,"AOC",false,"You for got to mention that \n74% ARE ASIAN ","en","","5",""],["1108401470439911424","1108020712021868547","1553098478","Hadouhameha","Hadouhameha",false,"AOC",false,"So where was the failure? The education they received up to that point? Personal accountability? Scores? There are so many factors that could have caused it that no amount of social justice will fix. In fact, it will likely hurt it.","en","","2","1"],["1108370966009262080","1108020712021868547","1553091205","Donald Simmons","theunbornnovel",false,"AOC",false,"Is their evidence? Could it be it was their merit that failed them? Maybe you’re right. If one student makes a 100 and another student makes a 50 because he didn’t try, then the good student should give him 25 points so they are equal. That works in your world.","en","","6",""],["1109510168566530048","1108020712021868547","1553362812","bcsurvivor⭐️⭐️⭐️","jacknbridge",false,"AOC",false,"Obviously you have no clue what it even takes to be accepted into these schools... stop promoting racism!!","en","","2","1"],["1108413093141372928","1108020712021868547","1553101249","Imagine...","chattykathykb1",false,"AOC",false,"Maybe it's not always about color! Maybe it is determined by who is qualified!!! Quit trying to play with the numbers","en","","2","1"],["1108479663829975040","1108020712021868547","1553117121","jhsieh","john2hsieh",false,"AOC","true","Deblasio threw 773 million into the public schools. What happened? https://www.nytimes.com/2019/02/26/nyregion/renewal-initiative-de-blasio.html …","en","https://t.co/LccoDN7fb9","2","1"],["1108384490005692416","1108020712021868547","1553094429","mrbiglefty","Biglefty",false,"AOC",false,"Holy cow. This is highly incorrect @AOC! Wealth has NOTHING to do with getting into these schools! Asian kids were brought up knowing that education is the top priority and that just going to school IS NOT ENOUGH! GEEZ! Thats why they're considered specialized schools!","en","/AOC","5",""],["1108438142686777345","1108020712021868547","1553107221","Jan Brauner","JaniceBrauner",false,"AOC",false,"As commenters noted, 74% of the students r Asian. MANY of them come from impoverished backgrounds.  \n\nThis is what working incredibly hard looks like.","en","","2","1"],["1108402527324639232","1108020712021868547","1553098730","Magic Wand","colleen2301",false,"AOC RealDavidHogg",false,"Umm wrong I know several straight white kids with great SAT scores & great grades that are being passed over in prestigious Universities  scores bc they don't fit the classifications, or bc their parents don't have the funds 2 bribe anyone. @RealDavidHogg.","en","/RealDavidHogg","2","1"],["1108492206459904000","1108020712021868547","1553120111","Johanna Clark Haag","joho3591",false,"AOC",false,"It is my understanding a majority of children at this school are low income Asians that ace the test. Are you suggesting no tests or discriminate against low income Asian students that ace the test?","en","","2","1"],["1108372199101132800","1108020712021868547","1553091499","richardADOS🇺🇸🇺🇸","AdosRichard",false,"AOC",false,"I don’t understand how any  prejudice /injustice against blk people you must bring in the word “Latino” in the mix. Like damn can we have an isolated moment","en","","2","1"],["1108449586157441025","1108020712021868547","1553109949","WC, I shortened my name because of threats of viol","wjcroy1",false,"Aijin_No_Shi AOC",false,"Her comments go directly to the Socialist idea of equality of outcome. And we all know that in the US we have equality of opportunity not outcome.","en","","4",""],["1108498361001406464","1108020712021868547","1553121578","Ricky2 Beto Davos","rtp7777",false,"AOC",false,"Must be the damn republicans.....oh, wait, there are none there","en","","3","1"],["1108409438480809984","1108020712021868547","1553100378","Aaron Freedman🌹","freedaaron",false,"AOC","true","Affluent white kids like me got private tutoring that helped us ace the #SHSAT https://www.nydailynews.com/opinion/ny-oped-another-education-advantage-wealthy-20190320-cshwlq7ofnaqpgm3nwcaxtwwqq-story.html …","en","/hashtag/SHSAT?src=hash https://t.co/ZL2tCrM7WL","1","1"],["1108507729407037440","1108020712021868547","1553123812","Robert Buckey","BuckeyRobert",false,"freedaaron AOC",false,"Oh no! Their parents give a shit about them!","en","","2",""],["1108744564150398976","1108020712021868547","1553180278","Lin","Lin90018159",false,"BuckeyRobert freedaaron AOC",false,"You don't have to be affluent to afford SAT courses for your child. I got them two and both of my parents are working class immigrants.","en","","",""],["1108481549316562947","1108020712021868547","1553117570","Hatchay","Hatchay",false,"AOC",false,"It's a public school if it is taxpayer based, not paid admissions.","en","","3",""],["1108453997919125504","1108020712021868547","1553111001","Jeremy","grilleyjeremy",false,"AOC",false,"you have to test to get in this school & it is made up of 66% Asian. majority of the test in schools are majority Asian in NY.  Is the system stacked for Asains in this country or is it culture & individuals testing up to par to be qualified? Maybe get out of the Teachers Union","en","","3",""],["1109684192592302086","1108020712021868547","1553404303","Xiaoyong Su","Xiaoyong16",false,"AOC",false,"stop putting racial profiling on education. this is racist. don't you understand how many hours of hard study these kids put in every day to get through the test? there is no evolution without hard working, smart people. democrats like you are disaster of human beings","en","","4",""],["1111052078506479618","1108020712021868547","1553730432","Michelle","o0omishieo0o",false,"AOC",false,"It’s the same exact test given to everyone who wants a seat at these schools. How is that a system failure?","en","","3",""],["1109474351391227905","1108020712021868547","1553354273","Anna Lui","PragmaticIdeaLi",false,"AOC",false,"43% of Stuy students are classified as economically disadvantaged","en","","4",""],["1108837531133579272","1108020712021868547","1553202443","Sandra Bodway","wooddragon1982",false,"AOC",false,"Funny how that works being democrats run the unions that control the whole fucking system in a democrat city and democrat state all because democrat voters continue voting for it.","en","","1","1"],["1108725509507215361","1108020712021868547","1553175735","coffey industries","designersunscre",false,"AOC",false,"Congratulations to those 7 students, may they continue to work hard and maintain the high levels necessary to achieve the American dream. Color does not decide what school you go to, its your academics. When you keep telling people they are owed something, they'll never work hard","en","","1","1"],["1108506026058436608","1108020712021868547","1553123406","ronda","morningstar70",false,"AOC",false,"OMG will you PLEASE close your mouth!! No one even cares what you have to say!! Please please stop! People are losing everything they have in the middle of this country and you are sounding like a 3 year old who needs a time put!! SHUT UP!!","en","","4",""],["1110899004638937091","1108020712021868547","1553693936","jason wu, esq.","CriticalRace",false,"AOC","true","The system is broken.  My op-ed on SHSAT and the racial politics of the recent lawsuit, and how it attempts to use Asian Americans as a wedge against other communities of color.  \n https://chalkbeat.org/posts/ny/2019/03/20/im-an-asian-american-graduate-of-brooklyn-tech-please-dont-use-me-as-a-wedge-in-your-education-lawsuit/ …\n\n#wewillnotbeused\n#defenddiversity\n#notyourwedge","en","https://t.co/uJ3MiwG9n7 /hashtag/wewillnotbeused?src=hash /hashtag/defenddiversity?src=hash /hashtag/notyourwedge?src=hash","4",""],["1108951030811656192","1108020712021868547","1553229503","⭐️⭐️⭐️Nancy Albertson","NancyNeale",false,"AOC",false,"Then get rid of the Department of Education.  We are robbing our children of decent education because the Dept of Ed is a massive failure. You, for one, are proof.","en","","3",""],["1108474553796308994","1108020712021868547","1553115902","Chris Burns","chrisburns61",false,"AOC",false,"When seeking the best, most qualified individuals race, gender or any other individual identifier is best left out of the equation. Intelligence and ability should be all that is taken into consideration. The Asian students earned their place by hard work and diligence to succeed","en","","3",""],["1108559252128436224","1108020712021868547","1553136096","dave foster","fawstaman",false,"AOC",false,"Stanford just accepted 4% of its applicants.","en","","1","1"],["1108679900712615936","1108020712021868547","1553164861","Harley Davidson","ckaprolet",false,"AOC",false,"Oh yeah, because everyone is entitled. I forgot","en","","3",""],["1108428407984087042","1108020712021868547","1553104900","Jonny","Jonny18499748",false,"AOC",false,"Here we go...Minority blaming the white man and not taking resposibility for your failure. Maybe the parents should PARENT!!!!!","en","","3",""],["1109474483675389957","1108020712021868547","1553354304","Anna Lui","PragmaticIdeaLi",false,"AOC",false,"Instead of attacking the test-based admission policies of one school, I'd like to see you talk about how to desegregate all NYC schools. The convo should be around policies that raise the quality of education at ALL local public schools.","en","","4",""],["1108373828256890880","1108020712021868547","1553091887","I SUPPORT TRUMP 🇺🇸","SarahJRossiter2",false,"AOC",false,"It’s called not everyone gets a trophy !!!","en","","4",""],["1108465978818519042","1108020712021868547","1553113858","CeaLee","Cealee",false,"AOC",false,"“mostly low-income Asian students” make up a whopping 74 percent of students at Stuyvesant, and 66 percent of students admitted this year are Asian-American.” Admission was based on merit and an exam which reflected their mastery of math and English is what I read. Is that wrong?","en","","4",""],["1109299732604551173","1108020712021868547","1553312640","COWFART CORTEZ","mcwalter_david",false,"AOC","true"," pic.twitter.com/hgRp6UukZD","und","https://t.co/hgRp6UukZD","1","1"],["1109571945186689024","1108020712021868547","1553377541","Michael Armstrong","WoodlawnMike",false,"AOC",false,"74% of students at Stuyvesant are Asian. A lot of the success of Asian students has to do with their parents’ high expectations for their kids when it comes to education.","en","","4",""],["1109075043215126534","1108020712021868547","1553259070","PuertoRicanSpic.COM","PuertoRicanSpic",false,"AOC",false,"Bronx HS of science is not located in a rich upper class neighborhood catering to wealthy white parents  the school is located in the west BX next Lehman college another school not catering to the rich elite The reality is not every person can score high on a admission test study","en","","3",""],["1108368554250985472","1108020712021868547","1553090630","~~~~^~~~~~\\o/","Y4LYFE",false,"AOC",false,"Hard work will eliminate all that system failure","en","","3",""],["1109462731793592322","1108020712021868547","1553351502","G Ratnanandan","GRatnanandan",false,"AOC",false,"I think this is unfair to Stuyvesant - I looked on their website - it is full of non-whites... just happen to be far eastern or south asian. perhaps the ball is in the latino and black student's&families' court to reorder their priorities.","en","","4",""],["1109153415475748865","1108020712021868547","1553277755","Joanne Smith","seagull211",false,"AOC",false,"74% of Stuy is Asian- no inequity or system fails, just Asian families putting high value on hard work and education. Congrats to those 7 students for their hard work and passing the test to get in, may no one EVER take that away from you","en","","4",""],["1108493703382007808","1108020712021868547","1553120468","Elvin Jusino","ejusino",false,"AOC",false,"Isn’t it the job of a congressional leader such as yourself to get appropriate funding for schools in these districts to help level the playing field? What else is causing blacks & Latinos to not get into a Stuyvesant? I got in thru hard work in spite of my poverty","en","","4",""],["1108526711363260416","1108020712021868547","1553128338","CHRISTiansoldier","nicholasprop",false,"AOC PamelaW31986513",false,"@AOC your #GreenNewDisaster will harm poor blacks and poor Latinos most of all","en","/AOC /hashtag/GreenNewDisaster?src=hash","1","1"],["1108453795254726657","1108020712021868547","1553110953","Dr. Rob PharmD, PA-C, JD","BShakakalaka",false,"AOC",false,"well, they have mostly asian students. it's based on this weird thing called academic merit. try again you fool, has nothing to do with race..it's about hard work.","en","","1","1"],["1108876727118454785","1108020712021868547","1553211788","Cecilia Pautrat","pautrat_cecilia",false,"AOC",false,"Injustice is you give away spots without earning it! We r Spanish and we got a spot fair and square! Not bc we r brown. We study and do not fool around. #Diblasio make every school like those specialized ones, not destroy them!","en","/hashtag/Diblasio?src=hash","4",""],["1109103689191428097","1108020712021868547","1553265900","Sean Emerson","SeanEmerson63",false,"AOC",false,"How do you explain why Asian students excel at the rates they do? Until you can have an honest answer for that, and explain why black and Latino kids can't emulate their success, you have no business trying to fix the system. You won't consider the real answer.","en","","4",""],["1108949496715591681","1108020712021868547","1553229137","Cynthia J Cate","bikergirl1964",false,"AOC",false,"You are an idiot. You also join Blasio in calling to o punish Asian students. That is just hateful. Looking forward to seeing most of you democrats voted out.","en","","3",""],["1108748931578634241","1108020712021868547","1553181319","Annastoya 💯 🇺🇸","Annastoya",false,"AOC","true","You're such a defective thinker. pic.twitter.com/QJ48NdFvBp","en","https://t.co/QJ48NdFvBp","1","1"],["1109474197191835649","1108020712021868547","1553354236","Anna Lui","PragmaticIdeaLi",false,"AOC",false,"81% of Stuy students are ethnic minorities. Many are children of immigrants. (yes, Asians are minorities in the US and many self-identify as people of color).","en","","4",""],["1109474078316883968","1108020712021868547","1553354207","Anna Lui","PragmaticIdeaLi",false,"AOC",false,"@AOC I'm a big supporter of the #GreenNewDeal and am really disappointed in your narrow-minded comment about Stuy.","en","/AOC /hashtag/GreenNewDeal?src=hash","4",""],["1108454122284556288","1108020712021868547","1553111031","MARTINEZ","MartinezReality",false,"AOC","true","MORON - are you really that type of progressive racist of low expectations? Are you implying that black kids & hispanics cannot compete with the majority asian kids on purely intellectual grounds or are you claiming \"Asian privilege\" is oppressing all the other minorities? UGH! pic.twitter.com/IdfuAwrAoC","en","https://t.co/IdfuAwrAoC","1","1"],["1109497742781485056","1108020712021868547","1553359850","flombardi07726","flombardi077261",false,"AOC","true","68% of people polled agree that you’re an idiot so #thanksfornothingAOC pic.twitter.com/1iRko6qxDG","en","/hashtag/thanksfornothingAOC?src=hash https://t.co/1iRko6qxDG","1","1"],["1108743909457494016","1108020712021868547","1553180122","Selwyn Duke","SelwynDuke",false,"AOC",false,"To be precise, 74 percent of Stuyvesant's students are Asian. Is this Asian privilege, La Vida Loca? Are you going to play the anti-Asian card? I'd like to see that.","en","","4",""],["1108887415501058049","1108020712021868547","1553214336","Isaiah 5:20","_Isaiah_5_20",false,"AOC",false,"Alexandria, Alexandria, Alexandria! Would you please do some homework or are you a masochist for being called out for consistently making up your own facts? Do you really think you’re going to pass your faux info by those who do their due diligence? Your fans are gullible!","en","","3",""],["1109379525685755904","1108020712021868547","1553331664","Ed Devlin","efxdevlin",false,"AOC",false,"Did it ever dawn on you that these seven students might be among the best of the best in applicants? Did you consider how proud they may be of their accomplishments, or are you too busy diluting their good work with your divisive rhetoric?","en","","3",""],["1108722500995825664","1108020712021868547","1553175017","Joe Kidd 1992","JoeKidd1992",false,"AOC",false,"Wow congratulations on trying to dumb down the system. “You don’t have good grades but you still get to go to top University”. And people wonder why our education system is failing. It’s because we reward failure like AOC wants to do.","en","","1","1"],["1108368038930202626","1108020712021868547","1553090507","LL Viola","LLViola",false,"AOC TheDemocrats NYCMayor",false,"Thanks for letting us know about Another failure of @TheDemocrats @NYCMayor who you are a part of ","en","/TheDemocrats /NYCMayor","1","1"],["1108759409734402048","1108020712021868547","1553183817","W. R. Pasquale","WRPasquale1",false,"AOC",false,"Why don’t you advocate for the removal of race, gender, religion and letters of recommendation from college application, grants and student loans? The selection should be based on merit alone, you know grades, SATs, etc.  News flash: people are not all gifted equally or the same.","en","","1","1"],["1108496139849031682","1108020712021868547","1553121049","Johnny Mac","Baldcapitalist",false,"AOC",false,"I look to a day when we will all be judged by the content of our character and not the color of our skin.","en","","3",""],["1108426805676044288","1108020712021868547","1553104518","Jenny♡♡","jny_jen23",false,"AOC",false,"Oh Democrats the great Dividers at it again","en","","4",""],["1108374279819804673","1108020712021868547","1553091995","Donna Timefadis","Tigburrchubz",false,"AOC",false,"This is just...wow.\n\nAlso about the teachers in middle and elementary schools, we need to support them because these kids are coming from nonsupportive households. Yaknow, where parents won’t be able to help their kids because work, dropping out themselves etc.","en","","4",""],["1108398964158533632","1108020712021868547","1553097880","Ken Dobranski","kennydob",false,"AOC",false,"74% Asian? The left pushes hard to bring in mass immigration but when new immigrants take your jobs and seats in schools your mad??????","en","","1","1"],["1108680860272943105","1108020712021868547","1553165090","David Mondrus","mongoosenewyork",false,"AOC",false,"How many black student won the ISEF fair? Maybe you should give up your prize. Maybe you should complain about how black students aren't being prepared for Stuy, instead of lowering the admission standards. YOU, of all congresspeople should know better.","en","","",""],["1108724329804636160","1108020712021868547","1553175453","Tim","bentoboxbonanza",false,"mongoosenewyork AOC","true"," pic.twitter.com/jI3Us59EOK","und","https://t.co/jI3Us59EOK","",""],["1108729884627603456","1108020712021868547","1553176778","David Mondrus","mongoosenewyork",false,"bentoboxbonanza AOC",false,"Because seats at places like Stuy and Bronx Science are limited.","en","","1",""],["1108730074277314566","1108020712021868547","1553176823","David Mondrus","mongoosenewyork",false,"bentoboxbonanza AOC",false,"And I might add, the very few places where a poor NY kid can excel on his/her own merits rather than paying 40K/y for Dalton","en","","1",""],["1108815806052384769","1108020712021868547","1553197263","Tim","bentoboxbonanza",false,"mongoosenewyork AOC",false,"Ok so inelastic demand means we shouldn’t scrutinize admissions practices at all? Not sure I agree with you there","en","","",""],["1108816793051848705","1108020712021868547","1553197498","David Mondrus","mongoosenewyork",false,"bentoboxbonanza AOC",false,"Have you gone through the process? Are you a NY'r? The admissions process is as straight forward as can be. Take the test and get placed. The rigor is beyond intense. 75 of the student body are Asian, but most of them are poor. The wealthy go to 40k/y schools.","en","","1",""],["1108817109646229509","1108020712021868547","1553197574","David Mondrus","mongoosenewyork",false,"bentoboxbonanza AOC",false,"You will destroy a system that produced 8 Nobel Prize winners and something that makes NY great. Stuyvesant is one of the few place a poor kid can succeed and make something of themselves. This will end that. And likely a good reason to be in NY.","en","","2",""],["1108404706261426178","1108020712021868547","1553099249","PoetiCal","CalGenius",false,"AOC",false,"Ugh, I hate agreeing with AOC!  7 is way too few.  It should match the demographics of the State I’d say.  Institutional racism is the hardest to knock down","en","","1",""],["1108524208781295617","1108020712021868547","1553127741","Dakota Erdmann","DakotaErdmann",false,"CalGenius AOC",false,"So if a white person is more qualified than a black person to get into a school, the black person should get in so it matches the demographics of the state? Skin color isn't a reason for a handout. I support equality of opportunity. There is more to this story than AOC will say.","en","","1",""],["1108524564835786752","1108020712021868547","1553127826","PoetiCal","CalGenius",false,"DakotaErdmann AOC",false,"Fair point","en","","",""],["1108525158908813312","1108020712021868547","1553127967","st3chri","st3chri",false,"CalGenius DakotaErdmann AOC",false,"74% of the students at the high school she’s talking about are Asian Americans who do not come from economically advanced areas they simply work harder for the place in that high school and it take that away from them would be wrong","en","","1",""],["1108524329686495232","1108020712021868547","1553127770","st3chri","st3chri",false,"AOC",false,"I swear if you get any dumber you’re going to need to start wearing a helmet when you go out in public 74% of the students at that high school are Asian They do not come from economically advantage areas they just work harder and you want to take that away from them","en","","1",""],["1108524641335824384","1108020712021868547","1553127844","st3chri","st3chri",false,"AOC",false,"In your drive to diversified you will deny students who have worked hard for their place in that high school \nWhy are you racist towards Asian Americans how long have you held your racist views against Asian Americans?","en","","1",""],["1108403223365324801","1108020712021868547","1553098896","337","threethirtysvn",false,"AOC",false,"Maybe the others were short on bribe money. ","en","","2",""],["1108371870628364288","1108020712021868547","1553091421","#MAGA Chris","thaCDP",false,"AOC","true","Stop the victim mentality! Regardless of color, the only way to success is hard work. Go back to the bar! pic.twitter.com/KmH2MR7CX5","en","https://t.co/KmH2MR7CX5","2",""],["1108517427833376770","1108020712021868547","1553126124","Melanie","melanie42564657",false,"AOC","true","In its report on Stuyvesant, the Times uses some curious language: “… out of 895 slots in the freshman class, only seven were offered to black students.” That word “offered” is interesting, isn’t it? Admission is exam-based, period (as I understand it). https://www.nationalreview.com/corner/an-american-dilemma-stuyvesant-high-school/ …","en","https://t.co/MDP7Xx9nk7","2",""],["1108378034950885381","1108020712021868547","1553092890","Mara Lago 03-16","RichardFee2",false,"AOC",false,"Base it solely on merit, never mind the rest. That's fair! Any kind of control to the contrary is unfair.","en","","2",""],["1108429366499991554","1108020712021868547","1553105129","Steve Popescu","StevePopescu",false,"AOC",false,"Does the colour of ones skin change test scores / grades?  What if this was changed to sort by colour and kids who weren't in the now preferred group with high scores were left out, what then?","en","","2",""],["1109131115963523073","1108020712021868547","1553272439","Barbara  Robinson","barbiegirlmeier",false,"AOC",false,"And 74% are Asian...how the hell is this idiot in office? This would greatly impact a section of society that we’re not talking about...one that does so much. Fire her...she’s useless!","en","","2",""],["1109129869454176258","1108020712021868547","1553272142","Belldandy shrine","smart_intellecc",false,"AOC",false,"Morehouse University is 96% black. Is that acceptable to you?","en","","2",""],["1108419241986924544","1108020712021868547","1553102715","Joey Fiore","570joe",false,"AOC",false,"Disparity =/= Discrimination","en","","2",""],["1108371552490438656","1108020712021868547","1553091345","Timmy Timson 👌","pancoVilla88",false,"AOC",false,"Did any of those not accepted get better scores than someone who was accepted? Were places awarded on merit or race?","en","","2",""],["1109559283023335429","1108020712021868547","1553374522","Ken","KenMacMillan",false,"AOC",false,"Pure demagoguery. The number of blacks and latinos getting into Stuyvesant is representative of the cultures they live by. The proper way to get more into top schools is to fix their culture.","en","","2",""],["1108379038421340160","1108020712021868547","1553093130","Rick Langel","RickLangel",false,"AOC",false,"What a great argument about the utter failure of public schools in educating kids. Your Progressive public NY schools simply are failing to do their job.","en","","2",""],["1108542110570106881","1108020712021868547","1553132009","Kevin","The_Sober_Hobo",false,"AOC",false," https://www.usnews.com/education/best-high-schools/new-york/districts/new-york-city-public-schools/stuyvesant-high-school-13092/student-body …\n\nWhat seems to be the majority?","en","https://t.co/t1oX0Kx5hN","2",""],["1108433099665358848","1108020712021868547","1553106019","Blue Phoenix","thruphoenixeyes",false,"AOC",false,"I get what people are saying in the comments-including people I don’t agree with.Part of the reason for outrage is, Stuyvesant was a predominantly Black area till 911. Black people have fought for proper Ed for years and there are reasons for the problem.Not a simple discussion.","en","","2",""],["1108380738783711233","1108020712021868547","1553093535","KPM152","martyn_kevin",false,"AOC",false,"Wow.... I actually agree that the educational system is in extreme need of restructuring to eliminate waste, pay a fair salary to the best teachers, and actually educate the kids and spend less time indoctrinating them and teaching them protesting 101.","en","","2",""],["1108422240943656961","1108020712021868547","1553103430","Ronald E Springer","MoralArmor",false,"AOC",false,"I have a favorite color but it doesn't apply to people. Kids should get in on scholastic merit alone.","en","","2",""],["1108876995700625410","1108020712021868547","1553211852","Dagleish","Dagleishmv",false,"AOC POTUS realDonaldTrump BetsyDeVosED",false,"You do realize that this is why the @potus administration is trying to promote school choice so the disadvantaged can choose to go to better schools? Use your celebrity to help @realDonaldTrump and @BetsyDeVosED. It would drive Nancy crazy ","en","/POTUS /realDonaldTrump /BetsyDeVosED","2",""],["1108412936173899776","1108020712021868547","1553101211","Joel W Cummings","JWC505",false,"AOC",false,"I think this is the first thing you have said that I fundamentally agree with but, I'm guessing there is more to the story.","en","","2",""],["1108564307929976833","1108020712021868547","1553137301","Chris Yip","KkruruYip",false,"AOC",false,"Spreading toxic material online much? Yeah, 7 blacks in one specialized school was admitted based on GRADES and SCORES not SKIN COLOR. If you despise Asians so much, you should begin the next genocide in America because it is TOO OBVIOUS you don't care about them.","en","","2",""],["1108380789023141888","1108020712021868547","1553093547","Adam Bilsky","AdamBilsky",false,"AOC",false,"It will be extremely important to understand ALL the causes of that “system failure,” including looking at what supports were offered all students, whether those supports were truly accessible to all students, and whether all students took equal advantage. #edchat","en","/hashtag/edchat?src=hash","2",""],["1108399574245363713","1108020712021868547","1553098026","JJP","rico15803",false,"AOC",false,"Public education has been on the decline for many years.. that us because it is run by the government.. keep on pushing for more government. And it will be worse..","en","","2",""],["1108440797098246146","1108020712021868547","1553107854","Al L.","AlL07823689",false,"AOC",false,"Ms. Ocasio-Cortez, the word Black is totally unfair.  Many of them just came from African, why can't they be called African Americans if they are citizens?","en","","2",""],["1108387815941787648","1108020712021868547","1553095222","Janya Cochran ","JanyaCochran",false,"AOC",false,"The test that all students take is the same test taken when your father attended, was it a failure then? The real failure lies at the feet of the teachers, the school who fail to properly educate and the students who rather protest climate change than learn.","en","","2",""],["1108371542738636800","1108020712021868547","1553091342","Anne Whipple","akhw11",false,"AOC",false,"As long as schoools are primarily funded with property taxes, this will never change.","en","","2",""],["1108400967211323393","1108020712021868547","1553098358","Mike Latauska","latalksalot",false,"AOC",false,"News flash: New York City Public School admissions system is broken","en","","2",""],["1108869711641698306","1108020712021868547","1553210115","Citizen Q - Roseanne Fan","CitizenQ17",false,"AOC",false,"You're a system failure","en","","2",""],["1108460041886142465","1108020712021868547","1553112442","Doug Paul","TheRealDougPaul",false,"AOC",false,"Starts with the parents.....maybe it's time to push for family values. Oh wait !    That's to conservative for you.","en","","2",""],["1108404710174654466","1108020712021868547","1553099250","Charles Masters","masters_charles",false,"AOC",false,"So are you saying, Stuyvesant should dumb down their entrance  requirements? Another brilliant idea! You need to take your ire out on NYC secondary education! Think before you speak!","en","","2",""],["1108652020880367618","1108020712021868547","1553158214","JosephNYC","JosephXNYC",false,"AOC",false,"If Asian Kids are punished for going to after-school and have a high score in their test (which is the same test for everyone), and therefore the rule should be changed to offer the \"opportunity\", then how about change NBA rules and let more Asian Kids get drafted into NBA?","en","","2",""],["1108421587156549635","1108020712021868547","1553103274","Avichal Singh","avicrash",false,"AOC",false,"This inequity is based more on the emphasis placed on education by Asian and south Asian families. Stuyvesant is a public high school and everyone has the same chance to get into these schools just as your father did going to Brooklyn tech","en","","2",""],["1108382553780686849","1108020712021868547","1553093968","Kathy","Kleachy71",false,"AOC",false,"This is what the dumbing down of America’s schools produces. A vacuous, arrogant woman who has no business being a representative.","en","","2",""],["1108506182996508672","1108020712021868547","1553123443","Jake R.","jaker1419",false,"AOC",false,"Yes, YOUR system is a failure. Maybe you should focus on fixing YOUR shitty system before telling the rest of the country what to do?","en","","2",""],["1108405326368464896","1108020712021868547","1553099397","Rob","nyc_Robinson",false,"AOC",false,"...centers (Hispanic kids don’t go to these, why? ) \n  What I think our latino and black communities need assistance with is 1. Encouraging parents to take a more active role in their children’s education by socializing and highly promoting these after school tutoring programs...","en","","2",""],["1108872671008178178","1108020712021868547","1553210821","Darin Dunn","darin_dunn",false,"AOC",false,"Admissions are based on academics. So this is a black society failure.","en","","2",""],["1108570856341626881","1108020712021868547","1553138863","Puerto Rico, USA","Leoimpr",false,"AOC",false,"I, it tells you the quality of teachers in NYC","en","","2",""],["1108455937176678400","1108020712021868547","1553111464","ECW | Dr. Eggplant","DrEggplantGG",false,"AOC",false,"I just wanted to point out to everyone upset over her statement that she didn't say a single word about lowering Stuyvesant's admission standards.","en","","2",""],["1109583394780909569","1108020712021868547","1553380271","Farhad Ahmed","farhada123",false,"AOC",false,"She should sit down with an alumni of these schools, someone like myself and have an conversation about the lifestyle of an immigrant child and the EFFORT that's required to be considered for such schools. These schools have been uplifting immigrant children in NYC for years.","en","","2",""],["1108396998435045376","1108020712021868547","1553097412","Sunshine","az_mathe",false,"AOC",false,"~What it tells us is that maybe students need to study harder to reach their goal, no matter what color they are~","en","","2",""],["1108528057369927681","1108020712021868547","1553128658","Larry Holmack","LarryHolmack",false,"AOC",false,"Did you ever think to check out the demographics of the school in question?  So 65% of the students are Asian- American and that makes the school racist?  AOC just \"forgot\" to mention that FACT!","en","","",""]]}